[{"text": "Health care marketplace enrollment numbers are in, and it's good news. Take a look: https://t.co/dfmjlkF6Mz #Obamacare"}, {"text": "We need to #FixTheSystem. https://t.co/hXk84oRzMQ"}, {"text": "Criminal justice reform is overdue. Speak up for fairness—add your name: https://t.co/A1b1B574uJ #FixTheSystem"}, {"text": "Good news: 2015 was another great year for clean energy growth. https://t.co/IoCSX8ybwm #ActOnClimate"}, {"text": "An increase in solar jobs is good for our economy and our environment. #ActOnClimate https://t.co/g22J3tMhVp"}, {"text": "Say cheese. #NationalPizzaDay https://t.co/cqNblFDAta"}, {"text": "Join the @OFA Truth Team and spread the facts on issues that matter: https://t.co/4EOm2PAXq0 https://t.co/19qvZpVawl"}, {"text": "Tune in at 4:25 p.m. ET to watch President Obama speak to supporters in Springfield, Illinois: https://t.co/mE04l0NorZ"}, {"text": "LIVE: President Obama is speaking in Springfield, Illinois. https://t.co/FZPraej5FL"}, {"text": "\"The fact is we’ve gotten a heck of a lot done these past seven years, despite the gridlock.\" —President Obama https://t.co/hrw7PNSEX1"}, {"text": "Celebrate this Valentine's Day with pride, and no matter who you love, commit to ending discrimination. #LoveIsLove https://t.co/mn6BZWEe1y"}, {"text": "Show what you believe—get the #LoveIsLove tee. https://t.co/4uqGPAt4TZ https://t.co/FxaPN3Z36l"}, {"text": "Marriage equality may be the law of the land, but there's more work to do to end discrimination. Join the fight: https://t.co/DlDQ35K8o6"}, {"text": "President Obama has protected more land and water than any of his predecessors—and he's not done yet: https://t.co/KEZZOHgyij #FindYourPark"}, {"text": "Thanks to President Obama, future generations will still be able to explore—from sea to shining sea. #FindYourPark https://t.co/Zt1U8dF3vW"}, {"text": "Read President Obama's thoughts on climate change, technology, and #WomenInSTEM: https://t.co/VRyX8cxFEk https://t.co/IrcnE2T88M"}, {"text": "Watch President Obama thank @TheEllenShow for all she's done for the LGBT community: https://t.co/Und55Vdlxy #LoveIsLove"}, {"text": "Retweet if you believe #LoveIsLove. https://t.co/ssMsbWMcXE"}, {"text": "Stand against discrimination—join the fight for equality. https://t.co/ZUDqZ6fbQM #LoveIsLove"}, {"text": "No matter who you are or whom you love, celebrate #Valentines Day with pride. #LoveIsLove https://t.co/btFuHnIEfV"}, {"text": "This #Valentines Day, speak up for equality: https://t.co/WAuwEmxUhm #LoveIsLove"}, {"text": "In the past seven years, our economy has made real progress. https://t.co/D1XXOQVPCT"}, {"text": "Read what @VP Biden has to say about our economic comeback, thanks in part to the Recovery Act: https://t.co/mKwr9m3608"}, {"text": "It's official: January 2016 was the most abnormally warm month on record. https://t.co/nAGoY6DXuB #ActOnClimate"}, {"text": "The longest streak of private-sector job growth, 4.9% unemployment rate—middle-class economics is working. https://t.co/jWIZ0IZwL1"}, {"text": "The impact of climate change in one GIF: https://t.co/tsQOp3cIVn #ActOnClimate"}, {"text": "Gain the skills you need to turn a desire for change into impact—apply to be an @OFA fellow today: https://t.co/q4t5Da7uyW"}, {"text": "Add your name to let the Senate know: The Supreme Court is too important to be held hostage by partisan politics. https://t.co/jPIEbRS7ig"}, {"text": "\"The Senate also has a constitutional duty: to consider presidential nominees expeditiously.\" https://t.co/mnL8KCDwe5 (h/t @latimes)"}, {"text": "The Senate should not play political games with our Supreme Court. https://t.co/RoNN4vaw0a"}, {"text": "Speak up for a fair nomination process and a timely vote by the Senate—sign @OFA's petition: https://t.co/HlQMqNYhVr #DoYourJob"}, {"text": "A fair judicial nomination process is important for a functioning democracy—read more: https://t.co/C7DSRLXgTV"}, {"text": "LIVE: President Obama is delivering a statement from the Roosevelt Room. https://t.co/8yT6ov8klS"}, {"text": "Be part of the team debunking myths with facts—join the @OFA Truth Team: https://t.co/6z9PgSYuSk https://t.co/51zJn9N8qa"}, {"text": "With more than 300 days left in President Obama's term, the Senate has no excuse to delay. #DoYourJob https://t.co/ultmGstueA"}, {"text": "Refusing to even consider the President's Supreme Court nominee is unprecedented. Tell the Senate: #DoYourJob. https://t.co/kSrKv5e3Ae"}, {"text": "President Obama on his constitutional responsibility and the qualities he's looking for in his #SCOTUS nominee: https://t.co/CFDl6l1hhC"}, {"text": "Sign @OFA's petition to let the Senate know you demand a fair Supreme Court nomination process: https://t.co/PlX9s74RIs"}, {"text": "This kind of obstruction is unprecedented. Tell Senate leaders: #DoYourJob https://t.co/IZgCuoWE4O"}, {"text": "The solar industry hit record growth last year, surpassing natural gas installations for the first time: https://t.co/9M4rqbVGCC"}, {"text": "Retweet if you agree that we can't afford to play political games over the Supreme Court vacancy. #DoYourJob https://t.co/NE380YtV41"}, {"text": "Add your name if you agree: Failing to fill the Supreme Court vacancy for over a year is unacceptable. https://t.co/uDxtenkam5 #DoYourJob"}, {"text": "The Senate should fulfill its constitutional duty and fairly consider the President's nominee. #DoYourJob https://t.co/AXpbOQ1bxD"}, {"text": "Tell the Senate: Stop playing games with our Supreme Court. https://t.co/2vkSnL2KWC #DoYourJob"}, {"text": "Tune in at 1:55 p.m. ET to see President Obama speak about the economic progress we've made since the #RecoveryAct. https://t.co/Ve3DprDXKH"}, {"text": "LIVE: President Obama is highlighting the progress of the American economy. https://t.co/7noFkjk0F8"}, {"text": "Our economy has added 14 million jobs over the longest streak of private-sector job growth on record. https://t.co/FwScd1Soxi"}, {"text": "Seven years ago, our economy was shedding nearly 800,000 jobs a day. We've come a long way. https://t.co/ueSHbf52YE"}, {"text": "Our economy has come a long way, but there's more work to do—say you support common-sense economic policies: https://t.co/UzcGjwykjs"}, {"text": "Thanks to the #RecoveryAct, clean energy investments have created hundreds of thousands of jobs. https://t.co/U82fX6P2nB"}, {"text": "LIVE: President Obama is presenting the Medal of Honor to Senior Chief Special Warfare Operator Edward Byers. https://t.co/NGInOc0ccN"}, {"text": "Sign @OFA's petition to let the Senate know you demand a fair Supreme Court nomination process: https://t.co/SeDGtpwnU5"}, {"text": "\"One-third of all U.S. presidents appointed a Supreme Court justice in an election year.\" https://t.co/PY8dR1owzf (h/t @washingtonpost)"}, {"text": "It's the Senate's duty to give the President's nominee a fair hearing and a timely vote. #DoYourJob https://t.co/yquRBNfS9k"}, {"text": "Today's the 55th birthday of the @PeaceCorps. Thanks to all who have served across the globe. #PeaceCorpsWeek2016"}, {"text": "Get the facts on everything from a fair #SCOTUS nomination process to climate change: https://t.co/jCZzreLARW https://t.co/qnB5GLM8eC"}, {"text": "We're seeing the fastest rise in sea-levels in nearly 3,000 years: https://t.co/MwO2QKE4GW #ActOnClimate"}, {"text": "Leaving a seat open on the Supreme Court for more than a year is irresponsible—sign the petition: https://t.co/qWvL5ANmqP #DoYourJob"}, {"text": "Refusing to consider a #SCOTUS nominee before one is even announced is irresponsible. #DoYourJob https://t.co/NiZtwUHmE5"}, {"text": "The obstruction of our Supreme Court is completely unprecedented. Sign the petition telling the Senate: #DoYourJob. https://t.co/STmBjGzaA0"}, {"text": "Deliberately creating partisan gridlock is not the way our democracy should work. #DoYourJob https://t.co/ubjy1N9NlS"}, {"text": "This is what a consensus looks like. #DoYourJob https://t.co/t7ZGvXIpIk"}, {"text": "Tune in at 12:50 p.m. ET to see President Obama congratulate Milwaukee on winning the Healthy Communities Challenge. https://t.co/JAbnRHsWSi"}, {"text": "Sign the petition—join the thousands of voices speaking up for a fair Supreme Court nomination process: https://t.co/BAOLv8FMEA #DoYourJob"}, {"text": "LIVE: President Obama is celebrating Milwaukee's victory in the Healthy Communities Challenge. https://t.co/aB2PNdzoXT"}, {"text": "The majority of Americans agree that President Obama should nominate someone to fill the #SCOTUS vacancy: https://t.co/RGQEw9WAc2"}, {"text": "The economy added 242,000 jobs in February—a record-breaking six straight years of private-sector job growth."}, {"text": "The American economy continues its comeback. https://t.co/5RZ5lB6AUV"}, {"text": "February's 242,000 new jobs mean the American economy has been creating jobs for six straight years. https://t.co/xCkKrs9gJp"}, {"text": "It's the Senate's duty to fairly consider the President's #SCOTUS nominee—and there's plenty of time to do so. https://t.co/X8kMjL1pdc"}, {"text": "Take a look at what editorial boards across the country think of the Senate refusing to do its job: https://t.co/6n3JNK6WoZ #DoYourJob"}, {"text": "A well-qualified #SCOTUS nominee deserves a fair hearing and a timely up-or-down vote. https://t.co/rBZe7gz2vD #DoYourJob"}, {"text": "Most Americans agree that the Senate should do its job and give the #SCOTUS nominee a fair hearing: https://t.co/8pA0rFXwrm #DoYourJob"}, {"text": "There is no excuse to delay the #SCOTUS nomination—add your name to @OFA's petition if you agree: https://t.co/WMFAOI6czO"}, {"text": "Refusing to hold hearings for a president's #SCOTUS nominee has never happened before. https://t.co/G7knZPAy7x"}, {"text": "\"If Selma taught us anything, it’s that our work is never done.\" —President Obama #Selma51 https://t.co/MoaVS02Crw"}, {"text": "\"U.S. solar seems poised for not just a record year but perhaps a blowout year.\" Get the numbers: https://t.co/MfDphKshcl #ActOnClimate"}, {"text": "We've come a long way on women's equality, but there's still so much work to be done. #InternationalWomensDay https://t.co/bqi94Ao2iV"}, {"text": "From @VP Biden: Why the Senate shouldn't hold back the #SCOTUS nomination process. https://t.co/A61OoqQszS"}, {"text": "The President is going to nominate a qualified Supreme Court Justice—tell Senate leaders to do their jobs: https://t.co/uks53rbxHX"}, {"text": "\"Senate needs to think and vote.\" See what editorials boards are saying about the Supreme Court nomination: https://t.co/ENU64s5Cud"}, {"text": "Add your name if you think the Senate should do its job: https://t.co/cRmr4M8lSl #DoYourJob https://t.co/DNxgqTSRTN"}, {"text": "\"Under my chairmanship, every Supreme Court nominee was given a hearing and a vote in the Judiciary Committee.\" —@VP https://t.co/DKjBws90CZ"}, {"text": "Senators on the Judiciary Committee have demanded a vote on judicial nominees 90 times. Here's a list: https://t.co/hjOn65IgI4 #DoYourJob"}, {"text": "Refusing to hold a hearing on a presidential nominee is unprecedented. Tell Senate leaders: #DoYourJob https://t.co/jmqg76dutN"}, {"text": "The United States and Canada are joining together to reduce methane pollution. Read more: https://t.co/RfWitsRxpB #ActOnClimate"}, {"text": "Not caught up on the Supreme Court vacancy? Read what editorial boards around the country are saying: https://t.co/ALJKaArA7i #DoYourJob"}, {"text": "The Senate should fairly consider a #SCOTUS nominee—sign the petition if you agree: https://t.co/clUtC1qTb8 https://t.co/UmjWwD7sQw"}, {"text": "LIVE: President Obama is participating in a #SXSW2016 panel on civic engagement and technology. https://t.co/BBoIZW0LWP"}, {"text": "If you think the Senate should give President Obama's #SCOTUS nominee a fair hearing, add your name: https://t.co/tFFrncdg1W #DoYourJob"}, {"text": "Refusing to even meet with a #SCOTUS nominee has no basis in the Constitution. #DoYourJob https://t.co/5xqIrZVLqj"}, {"text": "By a margin of nearly 2-to-1, Americans believe the Senate should hold hearings on a #SCOTUS nominee: https://t.co/zssLeUT1O3"}, {"text": "Happy #PiDay. https://t.co/gDZPJwKFk7"}, {"text": "There's a lot of misinformation out there—help spread the facts with the @OFA Truth Team: https://t.co/srdrvXgfKA https://t.co/MrkBKYeCnm"}, {"text": "This February was so hot that it shattered global records. Check it out: https://t.co/7tkAzF6CT8 #ActOnClimate"}, {"text": "These editorials explain why the Senate must do its job and hold fair #SCOTUS nomination hearings: https://t.co/0Erxa1SnlA #DoYourJob"}, {"text": "Senate leaders shouldn't hold up the Supreme Court nomination process—sign the petition: https://t.co/HPbnxeAKmT"}, {"text": "Tune in at 11 a.m. ET to watch President Obama announce his #SCOTUSnominee: https://t.co/IXUu3eUHdv"}, {"text": "HAPPENING NOW: President Obama is announcing his nominee to fill the #SCOTUS vacancy. https://t.co/ZDrkhxZpTB"}, {"text": "Judge Merrick Garland deserves a fair hearing and a timely vote. #SCOTUSnominee https://t.co/raFkOw5N3C"}, {"text": "Judge Garland is a qualified #SCOTUSnominee with past bipartisan approval—show your support: https://t.co/rh4XUpRSws https://t.co/MHhTEoewLn"}, {"text": "President Obama took his constitutional duty seriously and nominated a well qualified #SCOTUSnominee. https://t.co/zTOKXgLnj8"}, {"text": "Yesterday President Obama revealed his March Madness bracket. Check it out: https://t.co/AzKCRr5DQg #Baracketology"}, {"text": "Happy #StPatricksDay. https://t.co/VuguIeyUO1"}, {"text": "Make your voice heard on a fair #SCOTUS nomination process for Judge Merrick Garland: https://t.co/9kCCJ2ebUp"}, {"text": "Retweet if you believe Judge Merrick Garland deserves fair consideration. #DoYourJobFriday https://t.co/NYvoxcFO8H"}, {"text": "Check out how @OFA supporters are calling for a fair #SCOTUS hearing and timely up-or-down vote: https://t.co/JFf3hAf189"}, {"text": "Read from @business editorial board on why Judge Merrick Garland deserves a fair hearing: https://t.co/yzIDDgOfEs"}, {"text": "In the weekly address, President Obama urges the Senate to give Judge Garland a fair hearing and timely vote: https://t.co/1EuiCg8e8E"}, {"text": "\"Give Judge Garland the respect he has earned. Give him a hearing. Give him an up-or-down vote.\" —President Obama https://t.co/R2qBVx7O6s"}, {"text": "Tell Senate leaders: Your constituents expect you to #DoYourJob. https://t.co/xJFlsGS3Ry https://t.co/qdeP1x3QTC"}, {"text": "Judge Merrick Garland deserves fair consideration from the Senate. #DoYourJob https://t.co/9LteYSfKpo"}, {"text": "Want to meet James Taylor in Chicago? Enter today for your chance: https://t.co/gf36KXxU4Q https://t.co/Aql1tqH2Ba"}, {"text": "On the sixth anniversary of #Obamacare, stand with @OFA and say you'll keep fighting for affordable health care: https://t.co/O2KiiRPjB1"}, {"text": "20 million Americans covered: ✔\n9 in 10 Americans now have health insurance: ✔\nLowest uninsured rate on record: ✔ https://t.co/xTyZt3aa82"}, {"text": "Obamacare is here to stay. https://t.co/sgHCIYtn5w"}, {"text": "Obamacare: Giving young adults (and their parents) peace of mind since 2010. https://t.co/StT3XzFVGB"}, {"text": "It's a paws-itively beautiful day. #NationalPuppyDay https://t.co/dRY9SdgpHe"}, {"text": "Tune in at 12:30 p.m. ET to see @VP Biden speak about why fair consideration for Judge Garland is so important: https://t.co/e07gl2q8jv"}, {"text": "LIVE: @VP Biden is urging the Senate to give Judge Merrick Garland a fair hearing and timely up-or-down vote. https://t.co/2vG15zNgNn"}, {"text": "The support for a fair hearing for Judge Garland is growing. #DoYourJob https://t.co/qFYf3senWM"}, {"text": "Join @OFA in calling on Senate leaders to give Judge Garland a fair hearing and a timely vote: https://t.co/eafdeTvt3s #DoYourJob"}, {"text": "Judge Garland deserves fair consideration from the Senate. #DoYourJob https://t.co/gKTzocthGh"}, {"text": "\"I believe Judge Garland is exactly the kind of judge we need on the Supreme Court.\" —President Obama https://t.co/uGHiUD1LU9 #DoYourJob"}, {"text": "Judge Garland is a highly qualified nominee to fill the #SCOTUS vacancy. Senators, it's time to #DoYourJob. https://t.co/6V9uT2j7GK"}, {"text": "Tell Senate leaders to do their jobs and give Judge Garland a fair hearing: https://t.co/U8LouSCMJl #DoYourJob https://t.co/3hWl3k4gla"}, {"text": "Follow @WeNeedNine for updates on the fight to fill the Supreme Court vacancy. #FF"}, {"text": "\"Michelle and I join our fellow Christians in observing Good Friday and celebrating Easter this weekend.\" —President Obama #GoodFriday"}, {"text": "\"We wish all who celebrate a blessed and joyful Easter.\" —President Obama https://t.co/sSls4YLCYe"}, {"text": "LIVE: President Obama and @FLOTUS are participating in the annual White House #EasterEggRoll. https://t.co/VM9ImySkCQ"}, {"text": "Add your name for a chance to see James Taylor perform live in Chicago this summer: https://t.co/3Iz7oEkTzq https://t.co/EhvQXqDcmI"}, {"text": "Judge Garland deserves a fair hearing. https://t.co/SZPqoMUI5t"}, {"text": "Read President Obama's op-ed on why Judge Merrick Garland deserves a Senate hearing: https://t.co/1ZPiOzQszv #DoYourJob"}, {"text": "Judge Merrick Garland deserves fair consideration from the Senate: https://t.co/kaCTVBclmh #DoYourJob https://t.co/IljdAUY3qB"}, {"text": "Ever met a music legend? Here's your chance—meet James Taylor in Chicago this summer: https://t.co/6QAeg2ZqxX https://t.co/Q0EyXlAXA4"}, {"text": "Start your engines—the big fundraising deadline is coming up. Chip in: https://t.co/bWWIWl8vWU https://t.co/v7tSjLAct9"}, {"text": "A free flight to Chicago.\nA free hotel room.\nTickets to see the legendary James Taylor.\nEnter now: https://t.co/2frBiqy0q5"}, {"text": "Make a play before the big fundraising deadline tomorrow—pitch in now: https://t.co/1AnNryV2ls https://t.co/fDbZmlBGGz"}, {"text": "Tell Senate leaders to do their jobs and give Judge Garland a fair hearing: https://t.co/WBgbg7zLPR #DoYourJob https://t.co/uequq6N7pl"}, {"text": "Time's almost up. Pitch in before the deadline: https://t.co/T5y1mvq8Zu https://t.co/lKZxwjirge"}, {"text": "Enjoy the tunes of James Taylor in Chicago this summer—enter before tomorrow's deadline: https://t.co/Uid4X7idZA https://t.co/hhhBdEhfzq"}, {"text": "Calling all supporters—the fundraising deadline is here. Do your part to chip in: https://t.co/mRBj02GezI https://t.co/md6ajk1oki"}, {"text": "Get weekly updates on everything from the #SCOTUS nomination process to climate change: https://t.co/mqDVfWXVbZ https://t.co/Ms5hVDn8se"}, {"text": "Marriage equality. \nObamacare. \nA global climate agreement. \nPush for more progress: https://t.co/aT3bWC5EjY https://t.co/OFqJ3OUjoM"}, {"text": "You've got a friend that wants to meet James Taylor? Enter today and you could both be heading to Chicago: https://t.co/pXfBEQYcES"}, {"text": "DEADLINE: Chip in to support this grassroots movement before midnight tonight. https://t.co/1jc6aDshbl https://t.co/DJDHZQMMWn"}, {"text": "This is it—your last chance to win a free trip to Chicago to meet James Taylor: https://t.co/ryoo6ZGLdo https://t.co/y8BYvl0HIb"}, {"text": "The economy added 215,000 jobs in March—a record-breaking 73 months of private-sector job growth."}, {"text": "The United States of America has the strongest, most durable economy in the world—and it's getting better. https://t.co/mCyYWccvf5"}, {"text": "\"Another encouraging jobs report,\" as the longest streak of private-sector job growth on record continues. https://t.co/SfwVx1mkwu"}, {"text": "Our economy is making real progress, but we have to keep fighting to make sure that it works for everybody. https://t.co/i10j4c9dTo"}, {"text": "Stay informed and get the facts with the @OFA Truth Team: https://t.co/3GuF7OCxdC https://t.co/ypohneIQcS"}, {"text": "Judge Merrick Garland received bipartisan support in the past. Today should be no different. #DoYourJob https://t.co/4S4E2x8RZk"}, {"text": "An overwhelming majority of Americans want a fair #SCOTUS nomination process—add your name if you're one of them: https://t.co/rC9AMKaQVm"}, {"text": "\"Supreme Court struggles with just eight justices.\" https://t.co/ql8DEPqrIg #DoYourJob"}, {"text": "Tune in at 12:15 p.m. ET to watch President Obama deliver a statement about the economy: https://t.co/yOJQ9yCJJ9"}, {"text": "LIVE: President Obama is delivering a statement on the economy. https://t.co/7u5ZLGAoK4"}, {"text": "Ten million workers in California and New York now have better economic security: https://t.co/ivMeLnflQI #RaiseTheWage"}, {"text": "Clean energy currently employs 2.5 million people in the United States. Check it out: https://t.co/ToV5ZYc5kI #ActOnClimate"}, {"text": "If we don't #ActOnClimate now, the sea level could rise by more than six feet by the end of the century: https://t.co/xDvYsS3aYA"}, {"text": "Add your voice to the thousands calling on Senate leaders to give Judge Merrick Garland a fair hearing: https://t.co/RPAVha9eW9 #DoYourJob"}, {"text": "The Senate has more than enough time to give Judge Garland a fair up-or-down vote. #DoYourJob https://t.co/ybHNMwMWLm"}, {"text": "The U.S. is the only advanced nation that doesn't guarantee paid sick leave—it's time to change that. #LeadOnLeave https://t.co/LoUwswnXLg"}, {"text": "Show your support for the proposal to expand paid sick leave—add a comment today: https://t.co/3zFKbN3E0v #LeadOnLeave"}, {"text": "Read what a former @UChicagoLaw student learned from Professor Obama: https://t.co/fubKEiPum1 https://t.co/9DrfKTYIAS"}, {"text": "Tune in at 3:30 p.m. ET to watch President Obama speak about the #SCOTUS nomination process at @UChicagoLaw: https://t.co/hMSxVb9hpA"}, {"text": "LIVE: The President is at @UChicagoLaw discussing why Judge Garland deserves a fair hearing and an up-or-down vote. https://t.co/OKb612WkWb"}, {"text": "If you think Judge Merrick Garland deserves a fair hearing and an up-or-down vote, add your name: https://t.co/EDECatQHmj #DoYourJob"}, {"text": "Working families in America should have the basic security of paid sick leave. #LeadOnLeave https://t.co/0jxbEnUUJg"}, {"text": "Add a comment if you agree: American workers shouldn't have to choose between their health and a paycheck. https://t.co/AbSVkV1sEr"}, {"text": "This is unprecedented. #DoYourJob https://t.co/kMdn564dCW"}, {"text": "Speak up for a fair hearing for Judge Merrick Garland: https://t.co/Tf8yVdukBx #DoYourJob"}, {"text": "Retweet if you believe it's time for the United States to #LeadOnLeave. https://t.co/8jsAkBBqzx"}, {"text": "It's time for the United States to #LeadOnLeave—show your support if you agree: https://t.co/XtTmJH00Y9"}, {"text": "We cannot let political gridlock and dysfunction spread to our Supreme Court. https://t.co/ieJPV45nK5"}, {"text": "Side by side. #NationalPetDay https://t.co/nvursfUJqE"}, {"text": "Tune in at 11:25 a.m. ET to watch as President Obama designates a new national monument honoring women's equality: https://t.co/dP0wa1U6bc"}, {"text": "LIVE: President Obama is speaking about women's equality on #EqualPayDay. https://t.co/aulLEiX9Je"}, {"text": "\"I'm here to say we will close the wage gap.\" —President Obama #EqualPayDay https://t.co/NqmuWFRJHO"}, {"text": "Stand up for equal pay—add your name now: https://t.co/X3NldyL4LJ #EqualPayDay"}, {"text": "Retweet if you agree. #EqualPayDay https://t.co/tOZuPJJsX5"}, {"text": "\"Improving gender equality would add at least $2.1 trillion to U.S. gross domestic product by 2025.\" https://t.co/YHZW8QPEpR #EqualPayDay"}, {"text": "It's time. #EqualPayDay https://t.co/VpcBDOHABW"}, {"text": "Read why having nine Supreme Court justices is critical for our judicial system: https://t.co/2M6XYgYlK3 #DoYourJob"}, {"text": "Judge Garland is highly qualified for the Supreme Court—he deserves a hearing. https://t.co/P4g3JSQYem #DoYourJob https://t.co/6D9Adjikoz"}, {"text": "Tune in at 2:50 p.m. ET to watch President Obama speak at the #WHScienceFair: https://t.co/HRBcwVcXv4"}, {"text": "LIVE: President Obama is delivering remarks at the #WHScienceFair. https://t.co/b01pncM9iY"}, {"text": "Climate change means wildfires are now a continual threat in some parts of the country: https://t.co/uR7S3onk4T #ActOnClimate"}, {"text": "This kind of Senate obstructionism is completely unprecedented. #DoYourJob https://t.co/gPazJAImPi"}, {"text": "See what editorial boards are saying about Senate leaders' refusal to give Judge Garland a fair hearing: https://t.co/FETn702lVz"}, {"text": "Add your name if you think the Senate should give Judge Garland fair consideration: https://t.co/mlzf0SeE8t https://t.co/JjJMIwiEbF"}, {"text": "Editorial boards are making their voices heard on the #SCOTUS nomination process. See what they're saying: https://t.co/1teSLORDsG"}, {"text": "Show your support for a fair hearing and timely up-or-down vote for Judge Merrick Garland: https://t.co/o4vCIrG0HX #DoYourJob"}, {"text": "This is unprecedented. #DoYourJob https://t.co/bAo3uLvDtT"}, {"text": "Last month continued the streak of record-breaking global temperatures. https://t.co/HQk5xSCCkV #ActOnClimate"}, {"text": "President Obama's #ImmigrationAction could have a big economic impact. https://t.co/ss6UaGH8C3"}, {"text": "Happy National Park Week. Go #FindYourPark today. https://t.co/B00kPjS35Q https://t.co/uTNnDkSw6O"}, {"text": "Stand up today for a fair Supreme Court nomination process: https://t.co/ZNdQVurk9h #DoYourJob"}, {"text": "The wind energy industry keeps growing—here's the latest on its record-setting year: https://t.co/hf4vFdL0ze #ActOnClimate"}, {"text": "Climate change is real—and it's devastating communities across the country. We have #ActOnClimate now. https://t.co/RD8EC74QXZ"}, {"text": "Add your name to support bold action to combat climate change: https://t.co/b1d4PFfxyY #ActOnClimate"}, {"text": "Last year, wind energy generated enough electricity to power 17.5 million homes: https://t.co/RBMQxG7Pes #ActOnClimate"}, {"text": "Continuing to invest in clean energy like solar power is critical in the fight to #ActOnClimate. https://t.co/wvIKlRDDOD"}, {"text": "We can't let climate change deniers derail progress—say you stand for bold action: https://t.co/965Ps8qIfC #ActOnClimate"}, {"text": "President Obama is investing in a more sustainable future. #ActOnClimate https://t.co/MbDFRg0QcP"}, {"text": "\"'A strong spirit transcends rules,' Prince once said—and nobody's spirit was stronger, bolder, or more creative.\" —President Obama"}, {"text": "The Paris Agreement is a big deal. #ActOnClimate https://t.co/j75MzQKH0V"}, {"text": "Say you'll stand up for bold action to fight climate change: https://t.co/fU0rSHhQT1 #ActOnClimate"}, {"text": "Bold action on climate change matters. #ActOnClimate https://t.co/fzKtmRyFCQ"}, {"text": "We can tackle climate change—but it's going to take all of us working together. #ActOnClimate https://t.co/LEvJFzebLA"}, {"text": "Happy #EarthDay. https://t.co/grX8lqPkKI"}, {"text": "\"From our family to yours, chag sameach.\" —President Obama #Passover"}, {"text": "In the weekly address, President Obama talks about his efforts to improve our criminal justice system. https://t.co/7jF32GGJ3c #FixTheSystem"}, {"text": "\"We have criminal justice policies, including unfair sentencing laws, that need to be reformed.\" —President Obama https://t.co/ovSB7lu9Kl"}, {"text": "Carbon pollution is the biggest contributor to climate change—and President Obama is taking it head on. https://t.co/lZlIAyD9UV"}, {"text": "Show your support for bold moves to combat climate change—add your name: https://t.co/Wof6TIp08t #ActOnClimate"}, {"text": "We're already seeing the effects of climate change. Denial is unacceptable. #ActOnClimate https://t.co/k3sphu7KgC"}, {"text": "We all play a part in helping to stop gun violence. Do your part—#WearOrange on June 2. https://t.co/IUguOJg2Zk"}, {"text": "ICYMI: The U.S. and more than 170 other nations just signed the #ParisAgreement—the first ever global climate deal. https://t.co/Jlg4q4piDu"}, {"text": "The fight to tackle climate change took a big step on Friday with hundreds of countries signing the #ParisAgreement. https://t.co/gk7BWRRBqA"}, {"text": "Don't let climate change deniers derail progress—show your support for bold action on climate change: https://t.co/ZeUmitNSUb #ActOnClimate"}, {"text": "\"Not to let the Constitution function is totally irresponsible and it's never happened like this before.\" —@VP https://t.co/y6FXMAEzzd"}, {"text": "Watch: Professor Obama has a #SCOTUS lesson for obstructionists in the Senate. #DoYourJob https://t.co/CtFP33X8Lv"}, {"text": "The Senate should uphold its constitutional duty and give Judge Garland a fair hearing. Add your name if you agree: https://t.co/JmvJa0rHns"}, {"text": "For the health of our children and grandchildren, we have to #ActOnClimate. https://t.co/pJz7ODyr3p"}, {"text": "Watch Professor Obama take obstructionists in the Senate back to school with #SCOTUS 101. #DoYourJob https://t.co/GaN9kDsQIp"}, {"text": "Add your name if you support global efforts to tackle climate change: https://t.co/IQJzH7sb2C"}, {"text": "Fighting climate change will save Americans money at the gas pump. #ActOnClimate https://t.co/ePl93jLYTU"}, {"text": "Don't let climate change deniers jeopardize the progress we've made toward a safer, healthier future. Call them out: https://t.co/GV1Stqvdoq"}, {"text": "It's been more than 40 days since Judge Garland was nominated. Senate leaders: #DoYourJob. https://t.co/RUBRebSJhZ"}, {"text": "Hundreds of thousands of Americans are calling on Senate leaders to fill the #SCOTUS vacancy—join them: https://t.co/9LwydN9bmk"}, {"text": "Clean air makes for healthier and safer communities. #ActOnClimate https://t.co/uuPdv41v0u"}, {"text": "Senate leaders need to do their jobs and fill the #SCOTUS vacancy. #DoYourJob https://t.co/ZGcyGEv2CS"}, {"text": "In the weekly address, President Obama has a simple message for Senate Republicans: #DoYourJob. https://t.co/Vj0BuPXlKM"}, {"text": "\"Poll after poll shows a majority of Americans think Senate Republicans should do their job.\" —President Obama https://t.co/L7wi8kiFj4"}, {"text": "Tune in at 8:00 p.m. ET to watch \"Comedian-in-Chief\" President Obama at the #WHCD: https://t.co/JePbRDQkgG"}, {"text": "LIVE: President Obama is speaking at the #WHCD. https://t.co/U8C7OEGjEC"}, {"text": "Watch \"Couch Commander\" President Obama at last night's #WHCD: https://t.co/MF3iohymbP"}, {"text": "\"And with that, I just have two more words to say—Obama out.\" —President Obama at the #WHCD\n\nDon't miss this: https://t.co/T4YNBb30zJ"}, {"text": "It's unacceptable for obstructionists in the Senate to play political games with the Supreme Court. Say you agree: https://t.co/ORb8MTAeAt"}, {"text": "Read what editorial boards across the country have to say about the #SCOTUS vacancy: https://t.co/xFqioAHA3l"}, {"text": "Building a clean energy economy is a great way to #ActOnClimate for people across the country. https://t.co/xfdVKh3Zhy"}, {"text": "Say you're one of the majority of Americans who want Senate leaders to give Judge Garland a fair hearing. https://t.co/Vq2kN3WWlq #DoYourJob"}, {"text": "The United States just hit one million solar installations—enough to power 5.5 million homes. #MillionSolarStrong"}, {"text": "American workers deserve a trade agreement that works for them. Check out President Obama's op-ed on #TPP: https://t.co/exMvIGmk2H"}, {"text": "Good climate change policy and good economic policy can go hand in hand. #ActOnClimate https://t.co/MEDMB870SP"}, {"text": "LIVE: President Obama honors the 2016 National Teacher of the Year. https://t.co/mWxAZq5RKm"}, {"text": "Make your voice heard on a fair #SCOTUS nomination process—add your name today: https://t.co/kHWdaefQAP #DoYourJob"}, {"text": "Retweet if you agree. #DoYourJob https://t.co/WjTM07LRL4"}, {"text": "LIVE: President Obama is speaking at Northwestern High School in Flint, Michigan. https://t.co/hg4ZAhZZId"}, {"text": "President Obama: When American workers and businesses compete on a level playing field, no one can beat us. https://t.co/RBHapsYhqp"}, {"text": "Check out President Obama's latest message to @OFA supporters and volunteers: https://t.co/DpKpYudQFa"}, {"text": "Say that Senate leaders should stop hiding behind excuses and give Judge Garland a fair hearing: https://t.co/mhCz1oKSyn #DoYourJob"}, {"text": "President Obama just granted clemency to 58 men and women who've earned a second chance: https://t.co/TRIAGYd9Pk #FixTheSystem"}, {"text": "The economy added 160,000 jobs in April—a record-breaking 74 months of private-sector job growth."}, {"text": "LIVE: President Obama is speaking about the economy and new steps to strengthen financial transparency. https://t.co/Qem7LCIZVz"}, {"text": "74 consecutive months—more than six years—of private-sector job growth. Let's keep up the progress. https://t.co/igXXN83jCy"}, {"text": "Add your name if you think Senate leaders need to stop obstructing our Supreme Court: https://t.co/7vSk8oDw6i #DoYourJob"}, {"text": "\"This Mother’s Day, say thank you. Say, 'I love you.'\" —President Obama https://t.co/LE1oaV5dr4"}, {"text": "President Obama has a message for @OFA supporters on the work ahead: https://t.co/2lW82lhIk3"}, {"text": "Partisan obstructionism shouldn't hold back our Supreme Court. #DoYourJob https://t.co/Q7rRKyWlZc"}, {"text": "Add your name if you agree: We need a full Supreme Court bench for a functioning democracy. https://t.co/CApiDJ5Wgh #DoYourJob"}, {"text": "Judge Garland has impeccable credentials—he deserves a fair hearing from the Senate. #DoYourJob https://t.co/vqtTB1J4hL"}, {"text": "Join the hundreds of thousands of people calling on Senate leaders to give Judge Garland a fair hearing: https://t.co/5nEoT9T8KV"}, {"text": "Senate leaders: #DoYourJob and give Judge Garland the fair hearing he deserves. https://t.co/sg3Zx4vzIM"}, {"text": "Here's where editorial boards across the country stand when it comes to the #SCOTUS vacancy: https://t.co/0LqnmDbFBa #DoYourJob"}, {"text": "Add your voice to the push for a fair Supreme Court nomination process: https://t.co/R3ZglOxc2k #DoYourJob https://t.co/0IEpNmu3X0"}, {"text": "The Senate should give President Obama's Supreme Court nominee a fair hearing and an up-or-down vote. #DoYourJob https://t.co/eMAirFy0KU"}, {"text": "We can't afford to have a key part of our democracy understaffed. We need nine justices. #DoYourJob https://t.co/UYkYFLoNr7"}, {"text": "The Obama administration just finalized standards to cut methane pollution and improve public health. #ActOnClimate https://t.co/nR2x8UqDM8"}, {"text": "Add your name if you support big steps forward in the fight to tackle climate change: https://t.co/pP1RZtBKnT #ActOnClimate"}, {"text": "Editorial boards are speaking up on the #SCOTUS vacancy. Here's what they're saying: https://t.co/HfS2ldyCCh #DoYourJob"}, {"text": "Find out what Judge Merrick Garland's former clerks have to say about his record as a public servant: https://t.co/wT6t9YmV0S"}, {"text": "Say you support a fair #SCOTUS nomination process—speak up now: https://t.co/L6HonojsCg"}, {"text": "Senate leaders should listen to the American people. #DoYourJob https://t.co/vArMxcZh5W"}, {"text": "Read more about the historic new standards in place to reduce methane pollution: https://t.co/8lq704upzr"}, {"text": "Show your support for continued efforts to tackle climate change: https://t.co/q28Wp3Akb6 #ActOnClimate"}, {"text": "Change happens because people like you fight to make it happen. https://t.co/Y70kJkcrYH"}, {"text": "We need to lead this fight. #ActOnClimate https://t.co/ArdxyYdCiN"}, {"text": "LIVE: President Obama is speaking with @BuzzFeed about his #SCOTUS nominee, Judge Merrick Garland. https://t.co/suytYAcF63"}, {"text": "Think Senate leaders should do their jobs and give Judge Garland a fair hearing? Add your name: https://t.co/lDJoAIBe13 #DoYourJob"}, {"text": "April was the seventh consecutive month of record-high temperatures. We need to #ActOnClimate. https://t.co/C4ca2VOA0a"}, {"text": "It's time for Senate leaders to put politics aside and fill the Supreme Court vacancy. #DoYourJob https://t.co/UAhLXYqgTN"}, {"text": "Senate leaders are continuing to obstruct a fair hearing for Judge Garland—help put the pressure on: https://t.co/oCAPRllPZX #DoYourJob"}, {"text": "Judge Garland's former clerks have a lot to say about his record, work-life balance, and more—take a look: https://t.co/eHIgwaid6N"}, {"text": "Here's your chance: Tell President Obama what you're most thankful for—in person. https://t.co/EoeZNhKrdS https://t.co/lxFIDqbclW"}, {"text": "LIVE: Senate Judiciary Democrats are holding a forum on Judge Merrick Garland. https://t.co/tT8pTk5Y54"}, {"text": "This is a big day for millions of middle-class workers. https://t.co/CCzAOOjxda"}, {"text": "LIVE: @VP Biden is speaking about the economy at @jenisicecreams headquarters in Ohio. https://t.co/JwIfgPAXfJ"}, {"text": "Add your name if you support the Obama administration's new #overtime rule that expands protections for millions: https://t.co/9I8WHPmHlT"}, {"text": "Marriage equality? Affordable health care? Or economic progress? Tell him in person: https://t.co/5SqHi0htRp https://t.co/F83AdfUC8H"}, {"text": "Stand up for middle-class workers—add your name to support the Obama administration's new #overtime rule: https://t.co/SCLjZFP6aX"}, {"text": "Thanks to the new #overtime rule, millions of hard-working Americans will have more economic security. https://t.co/JHQRJEcsv9"}, {"text": "Don't miss this: https://t.co/NqqvCBukwi https://t.co/0Ud7rIqPa0"}, {"text": "The uninsured rate just hit 9.1 percent—the lowest ever recorded. https://t.co/Ew8ARCuDL2"}, {"text": "Despite Judge Garland's qualifications, some Senate leaders still refuse to give him a hearing—speak out: https://t.co/gls53URSMx"}, {"text": "Editorial boards across the country are telling Senate leaders: #DoYourJob. https://t.co/WUkeoDslbp"}, {"text": "Check out editorials from across the country calling on senators to fill the Supreme Court vacancy: https://t.co/4AGEWeXSIM #DoYourJob"}, {"text": "This summer, you and a friend could meet President Obama. Here's how: https://t.co/OZslVlHMI1"}, {"text": "In the weekly address, President Obama discusses expanding #overtime for millions of American workers: https://t.co/w7ytjIKedL"}, {"text": "\"This week my administration took a step to help more workers get the overtime pay they’ve earned.\" —President Obama https://t.co/w7ytjIKedL"}, {"text": "On average, it's taken 67 days to confirm Supreme Court nominees since 1975. #DoYourJob https://t.co/ZqE3OngoFy"}, {"text": "President Obama did his job, now it's time for the Senate to fulfill its duties—say you agree: https://t.co/JIdKOhTXci #DoYourJob"}, {"text": "Editorial boards to senators: #DoYourJob and fill the Supreme Court vacancy. https://t.co/rJi8Fy57Ii"}, {"text": "You don't want to miss out on this chance. Enter today: https://t.co/rED8cKIqv4 https://t.co/PJoHc0lIGF"}, {"text": "Judge Garland has one of the most impressive resumes of any Supreme Court nominee in recent history. https://t.co/r2egTausVA"}, {"text": "Ever wished you could meet President Obama? Here's your chance. https://t.co/XCeXSFtCYg https://t.co/AeFMTtBdf9"}, {"text": "\"People want Senate to act on Supreme Court vacancy.\" See what editorial boards are saying: https://t.co/qzMRbnjD0N #DoYourJob"}, {"text": "Don't pass this up—enter now: https://t.co/aIOZd4OfIH https://t.co/OgOyee6i4i"}, {"text": "If you think Senate leaders should do their jobs and fill the #SCOTUS vacancy, add your name now: https://t.co/nNHxp6SyII"}, {"text": "Get some face time with President Obama. Enter now for your chance to meet him: https://t.co/rLstH6U5tU https://t.co/wqfAHCk5tN"}, {"text": "Judge Garland was confirmed with bipartisan support in the past. He deserves a fair hearing. #DoYourJob https://t.co/TTcIByTScg"}, {"text": "Senate leaders need to stop obstructing our Supreme Court—add your name if you agree: https://t.co/sFaoUFD3eP #DoYourJob"}, {"text": "Senate leaders' obstruction of our Supreme Court is completely unprecedented. #DoYourJob https://t.co/PvubG4dFnd"}, {"text": "Tell your friends you fist bumped President Obama—enter now for your chance. https://t.co/s86eJjBJ0U https://t.co/zJEelmeIe6"}, {"text": "Judge Garland:\n\nIndependent mind ✓\nHighly qualified ✓\nHas had bipartisan support ✓\n\nSenate leaders: #DoYourJob https://t.co/r2egTausVA"}, {"text": "Stand up for a fair hearing and timely up-or-down vote for Judge Merrick Garland: https://t.co/DpeBdTFt8j"}, {"text": "Enter now for the chance to get some pointers from the Commander-in-Chief. https://t.co/lGn4BecCBl https://t.co/XODRtQS0UI"}, {"text": "Join the @OFA Truth Team and help set the record straight on issues you care about: https://t.co/FgwDveu3Ef https://t.co/aCEFVLB0ko"}, {"text": "A new survey shows that the overwhelming majority of #Obamacare customers are satisfied with their plans: https://t.co/75eFrBUV0e"}, {"text": "\"This Memorial weekend, I hope you’ll join me in acts of remembrance.\" —President Obama https://t.co/UxDZMDjMdu"}, {"text": "\"Today, and every day, let us remember the servicemen and women we have lost.\" —President Obama https://t.co/x1lQbyFr2M"}, {"text": "Share a laugh with President Obama—enter now for your chance. https://t.co/pZ4bvOtFVx https://t.co/JkBo1fVrJ0"}, {"text": "Because some Senate leaders won't do their jobs, the Supreme Court can't fully do its job. #DoYourJob https://t.co/gxXi7wCfg0"}, {"text": "The Supreme Court shouldn't be part of partisan political games. Add your name if you agree: https://t.co/uqAYi3uxrI"}, {"text": "Suit up—enter for a chance to meet President Obama before the deadline. https://t.co/5WQWYBGrAJ https://t.co/I79QxFVYGF"}, {"text": "You don't want to miss out on this opportunity—enter now before tonight's deadline. https://t.co/ZgquwBCiow https://t.co/VpuEcqR86Z"}, {"text": "\"Make the choice to do some good in the world.\" Watch Judge Garland speak to high school seniors at his alma mater: https://t.co/lkiWqSFra7"}, {"text": "Tune in at 3:25 p.m. ET to watch President Obama speak in Elkhart, Indiana—seven years after his first visit. https://t.co/ams2ipvolb"}, {"text": "LIVE: President Obama is speaking in Elkhart, Indiana, highlighting America's economic progress. https://t.co/x8XPvevF8e"}, {"text": "This is progress—but there's still more work to do to make sure our economy works for everybody. https://t.co/Gm8wvx0Gan"}, {"text": "Don't miss your chance to meet President Obama this summer. Enter before tonight's deadline: https://t.co/GLFCABWEuq"}, {"text": "Speak out against gun violence—#WearOrange tomorrow. https://t.co/IUguOJg2Zk"}, {"text": "LAST CHANCE: Keep calm and enter before the midnight deadline. https://t.co/GRHmsl26Hd https://t.co/RJxiN938k8"}, {"text": "Gun violence takes far too many lives in America. Congress needs to act. #WearOrange https://t.co/TYqb1fklcu"}, {"text": "Join the thousands of people calling on Congress to do something about gun violence—add your name: https://t.co/M0QQvNiYdj #WearOrange"}, {"text": "The noise around gun violence is loud.\nBut we can be louder.\n#WearOrange https://t.co/lYA8JEFhvg"}, {"text": "This National Gun Violence Awareness Day, keep the pressure on Congress to act. #WearOrange https://t.co/VplJtSGMaU"}, {"text": "Gun violence takes too many lives in our country. Congress must do something about it—add your name if you agree: https://t.co/H8Yh77Somm"}, {"text": "Watch: This is why people across the country have decided to #WearOrange today. https://t.co/IUguOJg2Zk"}, {"text": "This is the largest annual global increase in renewable power capacity—ever: https://t.co/9Eha0d5gbb #ActOnClimate"}, {"text": "Make sure you have all the facts—sign up to be part of the @OFA Truth Team. https://t.co/WozNFfFzW2 https://t.co/FrHVjmzd62"}, {"text": "It's time for Senate leaders to end the obstruction of our Supreme Court. #DoYourJob https://t.co/oKSLU2ADQi"}, {"text": "The Supreme Court shouldn't be part of partisan political games. Add your name if you agree: https://t.co/j8T9Vqlffe"}, {"text": "\"We pray that the greatest fighter of them all finally rests in peace.\" —President Obama #RIPMuhammadAli"}, {"text": "Former Energy Secretary @GovRichardson: Why the #TPP will make a difference in fighting climate change. https://t.co/AuWKEGJIGW"}, {"text": "Watch as President Obama tackles four common myths about our economy. https://t.co/9DdBoFj9y2"}, {"text": "Unemployment rate ⬇\nFederal deficit ⬇\nUninsured rate ⬇ https://t.co/SGZTb0ZBf3"}, {"text": "This month and every month. #LoveIsLove https://t.co/L3kRhhRxA4"}, {"text": "Love looks good on you. Wear it with pride: https://t.co/LlWSvS4uBE #LoveIsLove https://t.co/g5WjqYQvHq"}, {"text": "Senate leaders' politicization of the Supreme Court is \"unconscionable.\" https://t.co/f92L5TbGSR #DoYourJob"}, {"text": "Your support for a fair hearing and timely up-or-down vote to fill the vacancy on the Supreme Court matters: https://t.co/qfpOoUefet"}, {"text": "Senate leaders' refusal to give Judge Garland a fair hearing is pure politics. #DoYourJob https://t.co/8rzLIBigzM"}, {"text": "Be proud of how far we've come—and continue to push for progress. #LoveIsLove https://t.co/ApzHdiiO14"}, {"text": "Watch President Obama Slow Jam the News on @FallonTonight at 11:35 p.m. ET. #POTUSonFallon https://t.co/RuwpGwbTSA"}, {"text": "This is how you Slow Jam the News: https://t.co/bToPKW4UCM #POTUSonFallon"}, {"text": "Today, #LoveIsLove in all 50 states. But millions of Americans are still fighting to end discrimination—join them: https://t.co/07hwYLJOy8"}, {"text": "\"Minds open. Hearts change. America shifts.\" —President Obama #Pride2016 \nhttps://t.co/JJSBJW5UEb"}, {"text": "#OrlandoUnited https://t.co/ixCxMZzGH2"}, {"text": "This week, people all over the world came together to stand with the LGBT community—take a look: https://t.co/YyZsmZOpUZ"}, {"text": "President Obama has taken unprecedented steps to protect our land and water for future generations. https://t.co/D5PNr4itC5"}, {"text": "In the weekly address, the President talks about setting examples for children in light of tragedies like Orlando. https://t.co/B1k1FHYR76"}, {"text": "Happy Father's Day to all the dads out there. https://t.co/okqSRnQk6n"}, {"text": "\"To me, fatherhood means being there.\" —President Obama https://t.co/rL6RROGvQg"}, {"text": "Take a look at President Obama's interview with @NatGeo on national parks, climate change and more. https://t.co/xtbFt2XMHI"}, {"text": "Join @vj44 on a conference call to discuss efforts we can take to help reduce gun violence. https://t.co/AzL9CkYA7z"}, {"text": "Staying informed is too important leave to chance. Join the @OFA Truth Team today: https://t.co/ltq6xPBNfI https://t.co/6FQZXGLTHA"}, {"text": "\"There's something sacred about this place.\" —President Obama on Yosemite National Park https://t.co/BOsfJ0C9W7"}, {"text": "Clean energy is here to stay. https://t.co/meQoPVWXtg"}, {"text": "Say you support decisive action to tackle climate change. https://t.co/S9gkxn0wpv #ActOnClimate"}, {"text": "Judge Merrick Garland just received the American Bar Association's highest rating: https://t.co/9ew2WSpFqd"}, {"text": "If you're one of the millions of Americans who believes Judge Garland should get a fair hearing, add your voice: https://t.co/51SBeDdTKl"}, {"text": "The kind of obstruction we're seeing from Senate leaders is unprecedented. #DoYourJob https://t.co/W4TbswBwvS"}, {"text": "We need more than moments of silence. We need action. And that's what's going on in the House now: https://t.co/L9m0dSfipA #NoBillNoBreak"}, {"text": "LIVE: President Obama is speaking about today's Supreme Court immigration ruling. https://t.co/65QpzfLGS3 #ImmigrationAction"}, {"text": "Our immigration system is broken, and we need Congress for a long-term solution—speak up for #ImmigrationAction: https://t.co/apx4e9xPmN"}, {"text": "Congress: Listen to the millions of voices demanding a vote on efforts to reduce gun violence. #DisarmHate https://t.co/X2uYxbJSs0"}, {"text": "Speak up and demand that Congress act on gun violence prevention: https://t.co/Mo8ulIwRZg #DisarmHate"}, {"text": "Because Senate leaders refuse to do their jobs, the Supreme Court cannot properly do its job. #DoYourJob https://t.co/DvqUdLN2pA"}, {"text": "Think the Senate should give Judge Garland a fair hearing? Add your voice: https://t.co/iFQlY95TGt #DoYourJob"}, {"text": "A few words used by leading legal minds to describe Judge Garland:\nPhenomenal\nExceptionally bright\nFair-minded https://t.co/BqmzlabZlZ"}, {"text": "\"Stonewall will be our first national monument to tell the story of the struggle for LGBT rights.\" —President Obama https://t.co/PhswSyKsub"}, {"text": "From gun violence prevention to LGBT rights, this grassroots movement is fighting for progress. Show your support: https://t.co/wc9gPY0h3G"}, {"text": "Take a look: @VP Biden discusses what 4-4 decisions—like yesterday's on immigration—mean for our country. https://t.co/y6FXMAEzzd"}, {"text": "In the weekly address, President Obama discusses the Stonewall Inn's significance and the ongoing push for progress: https://t.co/FVKkSnnuCt"}, {"text": "We've made enormous progress toward full equality for LGBT Americans. Let's keep it going. #LoveIsLove https://t.co/x4mTOKQSiP"}, {"text": "Stand in solidarity with LGBT Americans—add your name. https://t.co/1gGugHitl1 #LoveIsLove"}, {"text": "Marriage equality is one year old. But we still have a long way to go for full equality. #LoveIsLove https://t.co/nwM1XFHKzG"}, {"text": "\"We can’t rest. We’ve got to keep pushing for equality and acceptance and tolerance.\" —President Obama https://t.co/qJOqlrn0HP"}, {"text": "Wear your love with pride. https://t.co/6863wUsjbn #LoveIsLove https://t.co/efRPdSb0dk"}, {"text": "President Obama designates the first national monument honoring the LGBT rights movement. https://t.co/vpPSEnyXV6 #LoveIsLove"}, {"text": "We must keep working toward an America free from discrimination against LGBT individuals. #LoveIsLove https://t.co/YxdiL21fIl"}, {"text": "Love only wins when people like you stand up and fight for it. Are you in? https://t.co/bHtizDnaTY #LoveIsLove"}, {"text": "The Supreme Court just struck down Texas' overly restrictive abortion laws—a win for women's reproductive rights. https://t.co/DMDwVnq6Vt"}, {"text": "Say you'll keep fighting to protect a woman's right to make her own reproductive choices. https://t.co/pkbjaxm9wO"}, {"text": "Today's #SCOTUS ruling reaffirms that every woman has a right to make her own reproductive choices. https://t.co/uvgc9MgX3e"}, {"text": "You don't need super powers to help push progress forward. Chip in today: https://t.co/yCxp5APr5E https://t.co/iHbjSMt3Ug"}, {"text": "\"She outworked her rivals ... and became a role model to millions of Americans—including our two daughters.\" —President Obama on Pat Summitt"}, {"text": "Congratulations to D.C., and thanks to Mayor Bowser and the D.C. Council for fighting to #RaiseTheWage. https://t.co/7cXBVUFCmn"}, {"text": "Enough has been enough for a long time. Congress needs to vote on sensible gun legislation now. #DisarmHate https://t.co/twRQQnTBvK"}, {"text": "Speak up and demand that Congress act on gun violence prevention: https://t.co/pA6IzzIE5A #DisarmHate"}, {"text": "A new historic goal in the fight to #ActOnClimate. https://t.co/sAu2fHdxAb"}, {"text": "Add your name if you agree: Climate change is real and it's going to take global action to tackle it. https://t.co/HC4QGNDFWC #ActOnClimate"}, {"text": "After Monday's #SCOTUS ruling, more unconstitutional restrictions on women's reproductive rights are falling. https://t.co/q6D3sbHEpq"}, {"text": "Reach out and help build this movement—pitch in: https://t.co/71qtnqx0Xj https://t.co/k6jketWz1r"}, {"text": "An overwhelming majority of Americans agree—Congress needs to act. #DisarmHate https://t.co/JuVv8MrEaO"}, {"text": "Stretch it out and get ready—the fundraising deadline is tonight. https://t.co/Ke22u7JHCa https://t.co/rwNuTtdgKA"}, {"text": "We can do more than thoughts, prayers, and moments of silence. Add your voice to call on Congress to #DisarmHate. https://t.co/6CiFxUwwD7"}, {"text": "Quick—you're running out of time to chip in before the fundraising deadline. https://t.co/1c3ejYu2WB https://t.co/JM9WbRIBFZ"}, {"text": "Since #Obamacare passed, health care spending has been slowing—and the uninsured rate is down to an all-time low. https://t.co/DV3FT10f7M"}, {"text": "Don't let the facts get drowned out. Join the OFA Truth Team today: https://t.co/RgBRNLYdYl https://t.co/SN8HUXw2H4"}, {"text": "Congrats to Chicago and all those who fought to #RaiseTheWage. Boosting paychecks for hard-working Americans is the right thing to do."}, {"text": "Chicago raising its minimum wage is another reminder: Congress needs to keep up and #RaiseTheWage for hard-working Americans nationwide."}, {"text": "Nationwide, editorial boards agree that Senate leaders should get to work and hold a fair hearing for Judge Garland. https://t.co/y7tYvcyILv"}, {"text": "Millions of Americans believe the Senate should hold a fair hearing for Judge Garland. Are you one of them? https://t.co/y5zGBXLvZZ"}, {"text": "Watch President Obama share a #FourthOfJuly message in the weekly address. https://t.co/7S5VzgA4OM"}, {"text": "\"Just imagine the peace and justice that would be possible in our world if we all lived a little more like Elie Wiesel.\" —President Obama"}, {"text": "Happy Fourth of July. https://t.co/AQHiti7Yye"}, {"text": "At 1:40 p.m. ET, President Obama will be speaking at a memorial service for the fallen police officers in Dallas. https://t.co/mSqpIVvZzZ"}, {"text": "President Obama is delivering remarks at an interfaith memorial service for the fallen police officers in Dallas. https://t.co/10WxYmaIke"}, {"text": "Watch President Obama deliver remarks at the #DallasMemorial service yesterday. https://t.co/BHIQTdnIDr"}, {"text": "Check out @VP Biden on the Supreme Court vacancy and Senate Republicans’ continued obstruction. https://t.co/HY8W77Ky1J #DoYourJob"}, {"text": "Stay in touch with the latest news—join the @OFA Truth Team: https://t.co/7KhfzVgngW https://t.co/4JlimjSOUx"}, {"text": "Tonight: President Obama joins a town hall discussion on communities and policing. Watch at 8 p.m. ET on @ABC: https://t.co/TeFybh04PX"}, {"text": "Happening now: President Obama is delivering remarks at the Diplomatic Corps Reception. https://t.co/0UeX55Gijc"}, {"text": "Happening now: President Obama is delivering a statement on the shooting in Baton Rouge. https://t.co/51KA2cvfHk"}, {"text": "Read President Obama's op-ed in the @WSJ on the need for Senate leaders to fill the #SCOTUS vacancy: https://t.co/CdCsAdSJlB #DoYourJob"}, {"text": "The majority of Americans believe Judge Garland should get a fair hearing—add your name if you agree. https://t.co/mkmVF9JsZW #DoYourJob"}, {"text": "Editorial boards across the country are calling on Senate leaders to fill the Supreme Court vacancy. Read more: https://t.co/IArYejb7bN"}, {"text": "Today marks 125 days since Judge Garland's nomination—the longest time in history from nomination to confirmation. https://t.co/9qff6NdrmR"}, {"text": "Make your voice heard: The Senate must fill the vacancy on the Supreme Court. https://t.co/GguLMpuUkq #DoYourJob"}, {"text": "For three years in a row, heat records have been broken across the globe. We have to #ActOnClimate now. https://t.co/Ps1Dk0Asqx"}, {"text": "America’s businesses have created more than 14 million new private-sector jobs over 76 straight months. https://t.co/e4a5X2bv0j"}, {"text": "By almost every economic measure, our economy is better off than it was eight years ago. https://t.co/iWSkzgSIkG"}, {"text": "Our economy is making real progress. https://t.co/xBgqyYEoG0"}, {"text": "Ida is one of the millions of people getting new opportunities to go solar and save money. Find out more: https://t.co/GTDwZu2lNT"}, {"text": "A reminder for Senate leaders: Judge Garland has had strong bipartisan support in the past. #DoYourJob https://t.co/dFjboU0TYX"}, {"text": "Add your name if you believe Senate leaders need to put aside partisan politics and fill the Supreme Court vacancy: https://t.co/aYkFs9IzS7"}, {"text": "In the weekly address, @SenWarren joins President Obama to discuss economic progress and Wall Street reform. https://t.co/u441ol4m3B"}, {"text": "\"Our economy is stronger today than it was before the crisis.\" —President Obama https://t.co/u441ol4m3B"}, {"text": "The federal minimum wage hasn't been raised since 2009. $7.25 isn't enough to make ends meet—we need to #RaiseTheWage."}, {"text": "Restoring the Supreme Court to full strength must remain above Senate leaders' petty politics. #DoYourJob https://t.co/H5EWm5gQug"}, {"text": "Add your name if you believe Senate leaders need to put aside partisan politics and fill the Supreme Court vacancy. https://t.co/tnioCrRvkC"}, {"text": "Actively ignoring this epidemic is unacceptable. Congress has to act. #DisarmHate https://t.co/n46r7RDnQI"}, {"text": "Add your name if you think we need common-sense legislation to prevent gun violence. https://t.co/u5ACT4qt8v #DisarmHate"}, {"text": "It's easy to be cynical, but there's no challenge we can't overcome. #ActOnClimate https://t.co/OeUW6YqvLc"}, {"text": "97 percent of climate scientists agree—climate change is real and man-made. Stand up for bold action: https://t.co/F0IC4JUfn1 #ActOnClimate"}, {"text": "Let's be clear: #Obamacare is working and helping millions of Americans. https://t.co/OVZqdsjkOn"}, {"text": "Judge Garland is a well qualified nominee. Senate leaders' refusal to even give him a hearing is unacceptable. https://t.co/So0px3M6pr"}, {"text": "It's the mark of the movement—wear it proud. Get yours today: https://t.co/9EWLm1eEOB https://t.co/WkXpfoMdMm"}, {"text": "Six years later, and Republican leaders still have no credible #Obamacare alternative. https://t.co/Y6yMqo4bEe"}, {"text": "Thanks to #Obamacare, millions of Americans have gained the coverage they need. Say you're proud. https://t.co/cDHxzoPFFk"}, {"text": "We've made a lot of progress, but there's still more work to do. https://t.co/CjniZ7ZTTn"}, {"text": "It's time to offer serious solutions on how to build on #Obamacare's progress—not take it away. https://t.co/rw69A5Jybh"}, {"text": "Fighting for progress never goes out of style. Get your @OFA Classic Tee: https://t.co/BeG8Ro7HAH https://t.co/UsSmzlKW4z"}, {"text": "Wildfire seasons are getting longer, more dangerous, and more expensive. We need to do more to #ActOnClimate. https://t.co/hpHjwknx3v"}, {"text": "Our children's health and prosperity is too important to ignore the consequences of climate change. Speak out now: https://t.co/sDgDkRxb6W"}, {"text": "Help President Obama celebrate his 55th birthday by signing @OFA's card today: https://t.co/nr2aVrgt7C https://t.co/RZuTbsfesr"}, {"text": "It's been a record-breaking 135 days since President Obama nominated Judge Garland. The obstruction must end. https://t.co/0P8jRkYUCq"}, {"text": "Add your name if you think the Supreme Court is no place for partisan political games: https://t.co/sK8BDevFue #DoYourJob"}, {"text": "Before their obstruction of President Obama's nominee, these six senators voted to confirm Judge Garland. https://t.co/xiGIdD2Ask"}, {"text": "In the weekly address, retired Federal Judge Timothy Lewis joins @VP Biden to discuss the #SCOTUS vacancy. https://t.co/QxhI58rAC5"}, {"text": "🎶 Sign the card and wish President Obama a happy birthday. 🎶 https://t.co/NgkIZGXHbc https://t.co/0dkapeIOjR"}, {"text": "\"We all have to do our job. The President has done his. Senate Republicans must do theirs.\" —@VP Biden https://t.co/QxhI589Zdv #DoYourJob"}, {"text": "Keep up with the issues that matter to you. Spread the facts. Join the @OFA Truth Team. https://t.co/bjY7c005w5 https://t.co/SDHeeVPnlR"}, {"text": "55? May be time for some new material. Join @OFA in wishing President Obama happy birthday. https://t.co/oUxjlKyav0 https://t.co/43jKdxP6Ys"}, {"text": "The Supreme Court still needs a ninth justice, but Senate leaders are still refusing to do their jobs. #DoYourJob https://t.co/HmgNHkz7e8"}, {"text": "Judge Garland should get a fair hearing and an up-or-down vote from the Senate. Speak out. https://t.co/7pWxq5J2DO #DoYourJob"}, {"text": "44 is turning 55. Celebrate—sign the card. https://t.co/608nLDOLP4"}, {"text": "Supreme Court seats: 9\nCurrent number of Justices: 8\nNumber of hearings/votes on President Obama's nominee: 0\nhttps://t.co/lpyEEkFhrf"}, {"text": "It has been a record-breaking 139 days since Judge Garland was nominated and still no hearing or vote. #DoYourJob https://t.co/IX6RxQ300I"}, {"text": "Senate leaders are weakening our highest court by refusing to vote on Judge Garland. https://t.co/FPgZJBQKL5 #DoYourJob"}, {"text": "Step 1: Sign President Obama's birthday card. \nStep 2: Celebrate. https://t.co/h7pKIzy7cc https://t.co/9tW6bxDIiT"}, {"text": "Show President Obama some love on his 55th birthday—sign the birthday card. https://t.co/Tzhrrxe07J https://t.co/Bxl1FsOVFd"}, {"text": "The Clean Power Plan will cut carbon pollution from power plants by 32 percent by 2030. #ActOnClimate https://t.co/UDp2Ti5ji1"}, {"text": "Today is the one-year anniversary of the Clean Power Plan—show your support in the fight to #ActOnClimate. https://t.co/0knkqAe3oE"}, {"text": "Don't sleep on this—the President's birthday is tomorrow. Sign the card now: https://t.co/3WFStgOrZs https://t.co/gnVYxrg3Xx"}, {"text": "From the Clean Power Plan to the Paris Climate Agreement, the U.S. is leading the way in the fight to #ActOnClimate. https://t.co/aBMaZdrgGB"}, {"text": "Birthday game: stronger. \nWish President Obama a happy 55th. https://t.co/SXUywd7WiG https://t.co/fs6mKxiGAf"}, {"text": "One last birthday as Organizer-in-Chief. Help make it a good one—sign the card now: https://t.co/B5SHzEgogW https://t.co/5CDfypnatQ"}, {"text": "The Clean Power Plan is one of the biggest steps forward in the fight to #ActOnClimate. https://t.co/UBXPe98NUF"}, {"text": "Make President Obama's last birthday in office extra special. Sign the card: https://t.co/DgxEf3bhxa #TBT https://t.co/eEqqEJ114i"}, {"text": "Keep that smile going strong. Wish President Obama a happy 55th birthday today: https://t.co/tSHQHvncPX https://t.co/G2qXz14MS1"}, {"text": "It’s President Obama’s last birthday in office—​d​on’t forget to sign ​the card. https://t.co/CLi4FB4WKp"}, {"text": "The economy added 255,000 jobs in July—a record-breaking 77 months of private-sector job growth."}, {"text": "Our economy is continuing its comeback. Let's keep up the progress. https://t.co/qUPGBzkqQ5"}, {"text": "This is a good thing for American workers and businesses—but there's more work to do. https://t.co/QGb6k0pwPr"}, {"text": "Today's jobs report underscores what we know to be true: America's economy is the strongest in the world. https://t.co/iXJjuWeOB6"}, {"text": "President Obama reflects on his experience as a feminist—and his hopes to continue building toward gender equality. https://t.co/77Sy5Fi0kr"}, {"text": "\"Team USA reminds the world why America always sets the gold standard.\" —President Obama https://t.co/N0gNxp5fEg"}, {"text": "These extreme records aren't a fluke—climate change is largely caused by human activity. https://t.co/vENHkR9Exl #ActOnClimate"}, {"text": "Americans across the country agree that we need bold action in the fight against climate change. #ActOnClimate https://t.co/znuajZ6CmE"}, {"text": "Show your support for bold action to fight climate change. https://t.co/DnEYpzMPrY #ActOnClimate"}, {"text": "Adding clean energy jobs is another way the U.S. is continuing to #ActOnClimate. https://t.co/EbM6XUrDRW"}, {"text": "President Obama has done more to improve energy efficiency than any previous U.S. leader. https://t.co/RnYnwaopaG #ActOnClimate"}, {"text": "Editorial boards from across the country have called on Senate leaders to fill the Supreme Court vacancy. https://t.co/oEPoijSThE"}, {"text": "Senate leaders are hamstringing our Supreme Court. This obstruction is unprecedented—and unacceptable: https://t.co/G3HWlzCJx6 #DoYourJob"}, {"text": "Judge Garland has now waited 146 days. That's shameful—and irresponsible. #DoYourJob https://t.co/JaP7YUQyOV"}, {"text": "We've accomplished so much as a movement—and it's thanks to the power of organizing. https://t.co/9VIhARMNvL"}, {"text": "Don't let the cynics win. Keep pushing for change with @OFA. https://t.co/uNYCHVCDWH"}, {"text": "Grab one of these for all your progressive organizing travels. https://t.co/1sNkW0iJwY https://t.co/UlT5Wszne5"}, {"text": "Being cynical is easy. It's having hope in the face of adversity that's hard—but essential. https://t.co/60rtFlFjWp"}, {"text": "Don't let misinformation go unchallenged. Join the @OFA Truth Team and get the facts to fight back: https://t.co/Vs5CT07FZm"}, {"text": "20 million more insured ✔️ \n15 million new jobs ✔️ \nA global climate agreement ✔️ \n\nLet's keep it going: https://t.co/bs3lO6xPr8"}, {"text": "Read what major news outlets are saying about the critical need for a fully functioning Supreme Court: https://t.co/phINUVx7gh"}, {"text": "Senate leaders continue to obstruct a full Supreme Court and it must stop—add your name if you agree: https://t.co/UWY4jtePG2 #DoYourJob"}, {"text": "Five months is long enough. It's time for a fair hearing and an up-or-down vote. https://t.co/PyMjLh8UJ8"}, {"text": "Equality isn't a zero-sum game. https://t.co/Gj2V95WzPO"}, {"text": "Not long ago, women could be charged more for health insurance—for being women. There's more to do: https://t.co/YQE99FTIoH #StandWithWomen"}, {"text": "The Clean Power Plan will improve the future health and well-being of our children and families. #ActOnClimate https://t.co/Kw09SczeRv"}, {"text": "Let's be clear: Senate leaders are playing political games with the Supreme Court. #DoYourJob https://t.co/EpPURJ3Dwa"}, {"text": "In the weekly address, President Obama discusses progress made in combating climate change—and what's left to do. https://t.co/nuI6cbADqm"}, {"text": "\"There's no doubt that America has become a global leader in the fight against climate change.\" —President Obama https://t.co/nuI6cbADqm"}, {"text": "Editorial boards around the country agree: Our judicial system is too important to be used as a political football. https://t.co/f1INOTKcmL"}, {"text": "It’s not too late. Senate leaders can still make this right and give Judge Garland an up-or-down vote. https://t.co/ysc4UvluR0"}, {"text": "Judge Garland deserves a fair hearing and an up-or-down vote. Add your voice and show your support: https://t.co/OVDjQVdx3v #DoYourJob"}, {"text": "Today, thousands of young DREAMers are able to fully contribute to our communities and our economy. https://t.co/szjWDVYm9X"}, {"text": "Reminder: It's the Senate's job to fairly consider Supreme Court nominees. #DoYourJob https://t.co/xrkYcRsLNw"}, {"text": "Senate leaders must stop obstructing our Supreme Court. Take a stand and show your support. https://t.co/1AaykUkmvn #DoYourJob"}, {"text": "We’re taking important steps to help guarantee the basic security of paid family leave. https://t.co/yvRhINmIGA #LeadOnLeave"}, {"text": "Doing nothing won't stop our country's gun violence epidemic. Congress must act to #DisarmHate. https://t.co/0kbF22nnm4"}, {"text": "We shouldn't accept this as normal. #DisarmHate https://t.co/tqmaTawXXX"}, {"text": "Call on Congress to #DisarmHate. Add your name to support common-sense gun legislation: https://t.co/YvBX3rPILx"}, {"text": "New standards for heavy-duty trucks will cut 1.1 billion metric tons of carbon pollution through 2027. https://t.co/1BncKu28M3"}, {"text": "Carry what you need while organizing for change. https://t.co/PcxJtQcx2I https://t.co/cVvj9b3Mnq"}, {"text": "Get the facts, not the fluff—join the OFA Truth Team: https://t.co/ssz4MCTj7s"}, {"text": "Fifteen months in a row of record-breaking heat is a signal that can't be denied: We need to #ActOnClimate. https://t.co/pXnbiNYFP9"}, {"text": "“Each month just gives another data point that makes the evidence stronger that we’re changing the climate.” https://t.co/QbFZXySQ86"}, {"text": "Climate change is not too big of a challenge to solve. We're making good headway. #ActOnClimate https://t.co/s2yzyDqvNR"}, {"text": "Our children's health and prosperity is too important to ignore the consequences of climate change. Speak out now: https://t.co/rNIKnWI2K2"}, {"text": "Another record broken. https://t.co/sw9XGUXWqX #ActOnClimate"}, {"text": "In the weekly address, President Obama commemorates the 100th anniversary of the @NatlParkService. https://t.co/TyJS4eBFr5"}, {"text": "\"We’ve protected more than 265 million acres of public lands and waters.\" —President Obama https://t.co/TyJS4eBFr5"}, {"text": "Get the facts. Cut through the noise with the @OFA Truth Team: https://t.co/4YNdcmVTED https://t.co/OlBqKSgLUZ"}, {"text": "Read why the Supreme Court needs nine justices, not shameless partisanship. https://t.co/8p9l6bSPcq"}, {"text": "The Supreme Court isn't some partisan football to be kicked around. Senate leaders should stop treating it like one. https://t.co/akIkPCcxUM"}, {"text": "We can't wait any longer to restore our Supreme Court to full capacity. Tell Senate leaders: It's time for a vote. https://t.co/INKhdtm2rn"}, {"text": "America's leadership in the fight against climate change pays off in more ways than one. #ActOnClimate https://t.co/tGK9Uu5l0C"}, {"text": "Rhode Island just built America's first offshore wind farm, which will create clean energy and fight climate change. https://t.co/76pwc0JM3m"}, {"text": "Get important news delivered straight to your inbox—join the @OFA Truth Team: https://t.co/CQa3WGnBcB"}, {"text": "This is nothing more than shameless partisanship. The Supreme Court should be held in higher regard. #DoYourJob https://t.co/I0TN3csv0O"}, {"text": "We need nine Supreme Court justices. The Senate needs to do its job and vote on Judge Garland: https://t.co/VbPUcviyZ2 #DoYourJob"}, {"text": "Happy 100th birthday, @NatlParkService. Here's to the next 100. #NPS100 https://t.co/LGShTB9l4x"}, {"text": "\"These are our American cathedrals, and they belong to you.\" —Jonathan B. Jarvis, director of the @NatlParkService https://t.co/NbAXewqVsA"}, {"text": "Organize for change in your community, and look good doing it. https://t.co/1Flbtn2PQQ https://t.co/e5TkkUQI1A"}, {"text": "We've come a long way, but there's still more to do to make sure women are truly treated equally. #WomensEqualityDay https://t.co/B7C0Nk27T5"}, {"text": "Say you'll continue the fight to make gender equality a reality in America: https://t.co/XusbC9I8l3 #WomensEqualityDay"}, {"text": "Speaking up is the first step. Let's build on our progress one conversation at a time. #WomensEqualityDay https://t.co/a0poSyIiqP"}, {"text": "President Obama continues his track record of protecting millions of acres of federal land and water. Take a look: https://t.co/J2GXikEUvR"}, {"text": "Obstruction—especially when it comes to the Supreme Court—is nothing to be proud of, @SenateMajLdr. #DoYourJob https://t.co/FwsAnwqNH2"}, {"text": "It's not too late for Senate leaders to give Judge Garland a fair hearing and up-or-down vote. Say you agree. https://t.co/p48z2I8Mvr"}, {"text": "Senate leaders must put country before party politics. Read why it's time to give Judge Garland a vote. https://t.co/zipWl7JgU2"}, {"text": "Show off your pride in this movement—grab your Organizing&amp; tee: https://t.co/lFFWUSZljm. https://t.co/htUFnTNn28"}, {"text": "Have meaningful, fact-based conversations. Join OFA's Truth Team: https://t.co/R0cSASIGew. https://t.co/Fs4esnNcdD"}, {"text": "Summer's almost over, Senate leaders. #DoYourJob https://t.co/JOEchACJ6i"}, {"text": "Senate leaders have a job to do—join the thousands reminding them when they reconvene next week. https://t.co/FWsdVnejYH #DoYourJob"}, {"text": "The American people need their legislators to be dedicated to solutions, not obstruction. #DoYourJob https://t.co/mrTXe8sti6"}, {"text": "We can't afford to have a Supreme Court that's short-handed. Here's why: https://t.co/XcIRdewObs"}, {"text": "Senate leaders need to hear you expect a vote on Judge Garland when recess ends—say you'll let them know: https://t.co/ETmcpsRRY6 #DoYourJob"}, {"text": "Stay in the loop with important facts, brought to you weekly. Join @OFA's Truth Team: https://t.co/YNdzkLi9cb"}, {"text": "Recess is almost over, and editorial boards across the country are calling for Senate leaders to do their jobs. https://t.co/ScbkMVcovu"}, {"text": "Senate leaders return from recess next week. They need to get to work on a vote for Judge Garland—say so. https://t.co/pdRYkz7kFV #DoYourJob"}, {"text": "The economy added 151,000 jobs in August—extending the longest streak of total job growth on record."}, {"text": "It's been a long road, but we're far better off than we were eight years ago. https://t.co/o8UdtCezYE"}, {"text": "Unemployment: ⬇\nDeficits: ⬇\nUninsured rate: ⬇\nJobs: +15.1 million https://t.co/mWcAgfM8zn"}, {"text": "When Americans stand together, there's no challenge too great to solve—not even climate change. #ActOnClimate today: https://t.co/5mqlv3ZXas"}, {"text": "Recess is almost over, and editorial boards across the country are calling for Senate leaders to do their jobs. https://t.co/Pr78WaT0V2"}, {"text": "In the weekly address, President Obama commemorates the labor movement that helped build this country. https://t.co/JsZvcpTyee"}, {"text": "President Obama has a message for America's workers today—check it out: https://t.co/KlPj1YGeQ4 #LaborDay https://t.co/qzbHAfRXNs"}, {"text": "\"When we protect our lands, it helps us protect the climate for the future.\" —President Obama #ActOnClimate https://t.co/qdoCgYPQom"}, {"text": "Conservation not only protects diverse lands and species, it's also an important part of battling climate change. https://t.co/gjvhHNPFKL"}, {"text": "The United States is leading the way in the fight to #ActOnClimate. https://t.co/vkUMjg6XKc"}, {"text": "The Paris Climate Agreement is a big deal in the fight against climate change—and now, a big step closer to reality. https://t.co/5vd6n0BFgG"}, {"text": "Senate leaders have 32 days before their next recess to give Judge Garland a hearing and a vote. Call them out now: https://t.co/IV1AGOEDag"}, {"text": "The process is clear. The Supreme Court and American people are waiting for Senate leaders to get to work. https://t.co/1YzeZLIcAT"}, {"text": "Congress is back from recess. Help put the pressure on Senate leaders to give Judge Garland a hearing: https://t.co/F4eATpElMT #DoYourJob"}, {"text": "Fewer Americans are uninsured than ever before, thanks to #Obamacare. https://t.co/tFbGtiPzWL"}, {"text": "Rising sea levels are already flooding homes and roads along America's coasts. The time to #ActOnClimate is now. https://t.co/OplSsyTHEX"}, {"text": "Stay in the loop with important facts. Join @OFA's Truth Team: https://t.co/2KkNrPgHPL https://t.co/FDOocrpQvU"}, {"text": "Congress is back, and they have important work to do before their next recess. Make sure you say where you stand: https://t.co/Ll1Croa3Ui"}, {"text": "We must take bold steps now—climate change is already impacting millions of people. https://t.co/ZWBgt0XEWt #ActOnClimate"}, {"text": "There's no need to overcomplicate the process. #DoYourJob https://t.co/QgaNgKNBzJ"}, {"text": "Senate leaders are back in session. Keep the pressure high—call out their obstructionism. https://t.co/eThTUbIMH0 #DoYourJob"}, {"text": "We need to keep up efforts to fight climate change at every level—locally, nationally, globally. #ActOnClimate https://t.co/L10qdkgPDg"}, {"text": "Meaningful action on climate change can't wait. President Obama explains why in this @nytimes interview. https://t.co/zbaDcpztIW"}, {"text": "These are records we can't keep breaking. We must work together to #ActOnClimate. https://t.co/sTxNR10sjK"}, {"text": "Vice President Biden speaks on the \"dangerous precedent\" Senate leaders are setting by refusing to do their jobs. https://t.co/W1A7Oyb4gB"}, {"text": "ICYMI: This is a really big deal. https://t.co/raNeUV5fRd"}, {"text": "The Supreme Court must remain above partisanship. Senate leaders: The time to fill the vacant seat is now. https://t.co/7mmbuXjsPO"}, {"text": "In 2015, we saw the fastest household income growth on record and the largest drop in the poverty rate since 1968. https://t.co/Kyw1vuhont"}, {"text": "Median household income: ⬆\nPoverty rate: ⬇\nUninsured rate: ⬇\n\nMiddle-class economics works. https://t.co/ThPXBSux09"}, {"text": "Time is almost up for Senate leaders to do the right thing and fill the #SCOTUS vacancy. https://t.co/rPbzUkZAUE #DoYourJob"}, {"text": "The U.S. is on track to hit two million solar installations within the next two years. Momentum is building: https://t.co/dTb4M3J4MY"}, {"text": "Stay informed. Stay engaged. Speak up. Join the @OFA Truth Team: https://t.co/b0eae4PXDX"}, {"text": "We can't let Senate leaders ignore their constitutional responsibilities. https://t.co/ExY5wZcWi6 #DoYourJob https://t.co/IwO7CAoVm2"}, {"text": "We need nine justices for a fully functioning Supreme Court—and editorial boards across the country agree. https://t.co/WD42qmgXpO"}, {"text": "LIVE: President Obama is speaking at the 2016 Our Ocean Conference. https://t.co/ALK46jhUpw #OurOcean"}, {"text": "President Obama just made history by protecting nearly 5,000 square miles off the New England coast. https://t.co/i8MAFYU60k #OurOcean"}, {"text": "\"There is no 'election year' exception in Article II.\" Sen. Leahy calls on senators to give Judge Garland a hearing: https://t.co/VjxClMdqUg"}, {"text": "When we protect our lands and waters, it helps us protect our climate for future generations. #ActOnClimate https://t.co/8tygZI0TDR"}, {"text": "Progress starts with a conversation. Make sure you have the facts to get yours started: https://t.co/MxWdiJxz4o https://t.co/Q3iP0Jwg1t"}, {"text": "The Supreme Court should remain above partisan politics, Senator. https://t.co/DlWud7Rh3K #DoYourJob https://t.co/Wjd96qn9Hf"}, {"text": "Six months is long enough, senators. It's time to #DoYourJob and give Judge Garland a hearing. https://t.co/A2Yedmhuw6"}, {"text": "Senate leaders are putting politics above their basic responsibility to hold a hearing for Judge Garland. #DoYourJob https://t.co/N7vH2ncwmb"}, {"text": "President Obama commemorates #HispanicHeritageMonth in an address to @CHCI. https://t.co/oTVX7zOyFD"}, {"text": "LIVE: President Obama is delivering a statement in New York. https://t.co/MJUr8C84Wd"}, {"text": "LIVE: President Obama is speaking at the 71st Session of the United Nations General Assembly. https://t.co/J8cm9QquER #UNGA"}, {"text": "As the #UNGA meets, take a look at the progress we've made thanks to American leadership in the world. https://t.co/b4T0zGccLH"}, {"text": "Communities are already experiencing the effects of climate change—we can't afford not to act. Take a look: https://t.co/WnBmiZDMr3 https://t.co/3BFbRDUXBv"}, {"text": "\"Their right to inherit a healthy planet is a sacred responsibility.\" —President Obama #ActOnClimate https://t.co/MYumi6xiIW"}, {"text": "The American Bar Association gave Judge Garland its highest possible rating. He deserves a hearing and a vote. #MerricksMerits https://t.co/ItMNKx4RJx"}, {"text": "Help keep the pressure on Senate leaders to give Judge Garland a fair hearing before their next recess. https://t.co/lkLz4yidaw #DoYourJob"}, {"text": "Enough of the shameless partisanship, Senators. #DoYourJob and fill the Supreme Court vacancy. https://t.co/vIQY0bivo4"}, {"text": "Senate leaders' blind obstruction of Judge Garland's nomination sets a dangerous precedent. We can't stand idly by. https://t.co/k76I6DCDRI"}, {"text": "Judge Garland is highly qualified for the bench—even some Senate leaders who are now blocking his hearing have agreed. #MerricksMerits https://t.co/zxaqdzLVRj"}, {"text": "We can't sit idly by. Climate change is likely to threaten our national security—we must act now. https://t.co/HwnK53B8Zi #ActOnClimate https://t.co/CCFZdEYc8T"}, {"text": "Happy #FirstDayofFall. https://t.co/ix02MNuOud"}, {"text": "Another record broken: 16 months in a row of undeniable, record-breaking heat.\nhttps://t.co/qMAH7nFf5I #ActOnClimate"}, {"text": "Stay informed. Stay engaged. Speak up. Join the @OFA Truth Team: https://t.co/GVTL4HrTXw"}, {"text": "Here are 16 broken records we shouldn't be proud of. https://t.co/x98dGgEloW"}, {"text": "Watch President Obama and @CEAChair Jason Furman discuss the positive gains the American economy has made. https://t.co/J28Crn3WAP"}, {"text": "Senate leaders need to work for the good of the American people, not seek out political points. https://t.co/Tdx3xk6gYi"}, {"text": "Senate leaders have blocked Judge Garland's hearing for over six months now. Keep pushing: https://t.co/peV6aCYswa #DoYourJob"}, {"text": "The American people are waiting for Senate leaders to do their jobs. https://t.co/LNqAQpxMle"}, {"text": "Senate leaders' unprecedented obstruction of the Supreme Court nomination must end. Your voice matters: https://t.co/yhy8al1FK7 #DoYourJob"}, {"text": "These are high praises from the American Bar Association—and yet, Senate leaders refuse to even consider Judge Garland. #MerricksMerits https://t.co/tXakoNmYFu"}, {"text": "Important, tough conversations require solid facts. Get them from the @OFA Truth Team: https://t.co/5YH9zVeayn https://t.co/dD1EPgaA9W"}, {"text": "Senate leaders have blocked Judge Garland's hearing for over six months now. Keep pushing: https://t.co/AGrUjJTnST #DoYourJob"}, {"text": "As long as Senate leaders keep refusing to do their jobs, @OFA supporters will continue speaking out against their obstruction. #DoYourJob https://t.co/xrz67jh1HV"}, {"text": "Household incomes are up, and the poverty rate is down across all demographics. https://t.co/cEIdPJuuvR"}, {"text": "We're better off than we were eight years ago. https://t.co/OwrTM3V78t"}, {"text": "This is no accident—we're making a comeback because together, we've fought hard to support American families. https://t.co/LTk7SiTexP"}, {"text": "The @OFA Truth Team makes it easy to stay informed. Join today: https://t.co/Q0axQYyJY1"}, {"text": "Never underestimate the strength and resilience of the American economy. https://t.co/OFTN2FlRtq"}, {"text": "\"Everybody gets sick.\" Check out what President Obama is doing to extend access to paid sick leave: https://t.co/gOAc2HAkQg #LeadOnLeave"}, {"text": "It's the Senate's job to fairly consider Supreme Court nominees. Their refusal to do so is unacceptable: https://t.co/s8FdCa0tq6 #DoYourJob"}, {"text": "There has never been a more qualified nominee, Senate leaders. He deserves a fair hearing and a vote. #DoYourJob https://t.co/qtzcY3iwyl"}, {"text": "We need a fully functioning Supreme Court. Speak up if you agree it's time for a hearing and a vote: https://t.co/d6nmum1Ut7 #DoYourJob"}, {"text": "After thirty years in Congress, Senator, this should not be your proudest accomplishment. https://t.co/FwGAJsBCoo #DoYourJob https://t.co/TIL8ISwdKd"}, {"text": "Parents shouldn't have to choose between a paycheck and taking care of a sick child at home. #LeadOnLeave https://t.co/FF4hTkgOZy"}, {"text": "In the weekly address, President Obama discusses why access to paid leave is so important. https://t.co/q9kDEqYs5u #LeadOnLeave"}, {"text": "Facts matter. Stay informed with the @OFA Truth Team: https://t.co/O8PhOX5jJ3"}, {"text": "Side-by-side for 24 years. Here's to many more. #HappyAnniversary https://t.co/nh8Xfc7IWU"}, {"text": "We've come a long way, but the fight for fairness and an economy that works for everyone continues. https://t.co/WWRhZHwYWE"}, {"text": "Take what matters with you. https://t.co/E0hXWSu1q3 https://t.co/KJJdkE8DML"}, {"text": "\"Everybody cares about their kids, their grandkids, and the kind of world we pass on to them.\" —President Obama https://t.co/cfxpSBNWIU"}, {"text": "Enough is enough. Say it's time for Senate leaders to get to work: https://t.co/2M789YIcBk #DoYourJob"}, {"text": "Read from @NYTopinion about why filling the Supreme Court vacancy is crucial for our democracy: https://t.co/zuSWzxSaqW #DoYourJob"}, {"text": "LIVE: President Obama is delivering a statement on the Paris Climate Agreement. https://t.co/mNpQ6QyA91"}, {"text": "\"Today is a historic day in the fight to protect our planet for future generations.\" —President Obama #ActOnClimate https://t.co/x3dJSCYUcj"}, {"text": "This historic step in the fight to #ActOnClimate came faster than anyone predicted. https://t.co/W2rtcNXkI7"}, {"text": "The cost of clean energy technology dropped significantly over the last eight years. Get the chart: https://t.co/fuGQMXeRYb #ActOnClimate"}, {"text": "ICYMI: Read about the historic #ParisAgreement and what it means for the fight to #ActOnClimate. https://t.co/eMefgFZk53"}, {"text": "The economy added 156,000 jobs in September—extending the longest streak of total job growth on record."}, {"text": "Check out President Obama's essay in @TheEconomist on the unique challenges the American economy faces. https://t.co/jKJNCrQALL"}, {"text": "The economic progress we've made is undeniable—let's keep it up. https://t.co/gAlfaC1hkI"}, {"text": "Our economy is on a better, stronger course. https://t.co/yzB6x7CExJ"}, {"text": "The Obama administration and @CFPB are working to protect consumers and #StopTheDebtTrap. https://t.co/UMO01OUkdh"}, {"text": "Deadline tonight—help rein in payday lenders that succeed by targeting vulnerable Americans: https://t.co/7OlpH6OFek #StopTheDebtTrap"}, {"text": "The uninsured rate is the lowest it's been in decades, thanks to #Obamacare. Spread the word. https://t.co/cxdbkiOqbq https://t.co/zH364SozNu"}, {"text": "Dispel misinformation with facts from the @OFA Truth Team. https://t.co/zjexLUJXAC"}, {"text": "Judge Garland is just as qualified now as he was in 1997, Senate leaders. It's time to #DoYourJob. https://t.co/j1lEkdMYV6"}, {"text": "Don't stand idly by while Senate leaders continue to block Judge Garland from a fair hearing and vote: https://t.co/TSavHP3mHg #DoYourJob"}, {"text": "The Supreme Court must remain above politics. Judge Garland needs a hearing and a vote. #DoYourJob https://t.co/eVSPSIFNpB"}, {"text": "\"LGBT individuals deserve to know their country stands beside them.\" —President Obama #NationalComingOutDay https://t.co/op7nBzbaod"}, {"text": "\"On behalf of Michelle and our family, G’mar Chatimah Tovah.\" —President Obama #YomKippur"}, {"text": "Climate change's effects are devastating. Denying the science behind it does nothing to help. https://t.co/Rww40wwgD9 #ActOnClimate"}, {"text": "Let's leave our children and grandchildren a planet that's healthier than the one we have today. #ActOnClimate https://t.co/mP29bpRdU9"}, {"text": "Last week, more than 190 countries reached a landmark deal to reduce carbon pollution from aviation. https://t.co/LRYkXVw3rO #ActOnClimate"}, {"text": "Support the bold steps we're taking against climate change. Say you're ready to #ActOnClimate: https://t.co/EtwjaKgYFW"}, {"text": "LIVE: President Obama is speaking at a reception celebrating #HispanicHeritageMonth. https://t.co/FK0ytbKw1q"}, {"text": "Senate leaders' political games are handicapping the Supreme Court—and judgeships across the country. https://t.co/PhKOBKXLmS #DoYourJob"}, {"text": "Senate leaders have undercut the functionality of the Supreme Court, and that's unacceptable. #DoYourJob https://t.co/5HFXhgTMoP"}, {"text": "Check out the most recent editorial boards calling on Senate leaders to vote on Judge Garland: https://t.co/hzuhZYevfo #DoYourJob"}, {"text": "\"That’s how we will overcome the challenges we face: by unleashing the power of all of us for all of us.\" Read more: https://t.co/VxpwLIR4uF"}, {"text": "Cynics, take note: When we #ActOnClimate, we build a stronger future. https://t.co/wHHMdo2ro6"}, {"text": "Denying climate change is dangerous. Join @OFA supporters in standing up for bold action now: https://t.co/7MDQGYgX2u #ActOnClimate"}, {"text": "The American Bar Association gave Judge Garland its highest rating. Senate leaders: #DoYourJob and fill the #SCOTUS vacancy. https://t.co/4yseqnOBX4"}, {"text": "We need a fully functional Supreme Court. Editorial boards across the country agree: https://t.co/BkLrNaTtzN #DoYourJob"}, {"text": "Senate leaders have recognized Judge Garland's impeccable credentials in the past. He deserves a fair hearing and an up-or-down vote. https://t.co/oduFmNGDgO"}, {"text": "Senate leaders are blocking the Supreme Court nomination for their own political gain—don't be silent: https://t.co/OMdTVim0TC #DoYourJob"}, {"text": "Wildfires in the next few decades could be \"unrecognizable\" to previous generations—because of climate change: https://t.co/vM3xM6mCf3"}, {"text": "Read why @FLOTUS is fighting to ensure that girls everywhere have access to quality education. https://t.co/xleq3HHSZt #LetGirlsLearn"}, {"text": "This is just the latest step forward in the push to #ActOnClimate. https://t.co/UDInkidKkP"}, {"text": "Climate change is real, but so is the progress we're making to #ActOnClimate. Let's keep it up. https://t.co/GOFKXQblGJ"}, {"text": "Denying climate change is dangerous. Join @OFA supporters in standing up for bold action now: https://t.co/JZnvlb080l #ActOnClimate"}, {"text": "We can't afford to let this be the new normal. https://t.co/nJzyfz2Zlw #ActOnClimate"}, {"text": "The need for a ninth justice is undeniably clear. #DoYourJob https://t.co/L1EBgNbh3Q"}, {"text": "Our Supreme Court has been short a justice for far too long. #DoYourJob, Senate leaders. https://t.co/yJlejtHjr0"}, {"text": "From coast to coast, editorial boards are denouncing Senate obstructionism. Take a look: https://t.co/vqDr2bBiVr #DoYourJob"}, {"text": "There's a lot of misinformation floating around. Make sure you've got the facts—join the @OFA Truth Team: https://t.co/WKXMJCZtF0 https://t.co/TJRao05cIe"}, {"text": "Tune in at 1:55 p.m. ET to watch President Obama speak about the successes of the Affordable Care Act. https://t.co/7FsQXut07O"}, {"text": "LIVE: President Obama is in Miami talking about the progress made possible by the Affordable Care Act. https://t.co/7FsQXut07O"}, {"text": "There's still more work to do, but let's celebrate how far we've come. https://t.co/kUVWn68kJw"}, {"text": "Stand up for the law that's helped 20 million more Americans gain health coverage. Join Team @Obamacare today: https://t.co/XiNXrgnPoF"}, {"text": "\"Because of Obamacare, another 20 million Americans now know the financial security of health insurance.\" https://t.co/eNd6J8bMxm"}, {"text": "Being able to stay on a parent's plan enables millions of young adults to make choices about their future with the security of health care. https://t.co/s87tsEpUv1"}, {"text": "Don't get tripped up by misinformation. Join the @OFA Truth Team today: https://t.co/09BpA6F9Ne https://t.co/Nxgp87o4iq"}, {"text": "Health care is a right, not a privilege—and #Obamacare works to protect that right for millions of Americans. https://t.co/B7fO8rhggW"}, {"text": "Since 2010, America's uninsured rate has been cut in half. Help build on that progress—join Team #Obamacare today: https://t.co/MhIICuE17A"}, {"text": "The four-week average of jobless claims fell to the lowest level since 1973—a sign of a healthy labor market. https://t.co/Lv7DnRM2DY"}, {"text": "Strong policies that help working families get ahead are good for our economy. https://t.co/QRRhibjZCl"}, {"text": "Be proud of the progress we've made together—wear the mark of this movement. https://t.co/fYf2O9WAwG https://t.co/1Z4yJmYh4E"}, {"text": "Don't get tripped up by misinformation. Join the @OFA Truth Team today: https://t.co/wJZj1QCxXm https://t.co/vwwDgFHq6A"}, {"text": "Women, the sick, survivors—they all deserve fair treatment in our health care system. #Obamacare https://t.co/G948HN7pzV"}, {"text": "DYK: Most people can find a plan for less than $75 per month. Open enrollment starts on November 1. #GetCovered https://t.co/9RGG5Pr4mb"}, {"text": "Help protect the progress we've made in helping millions of Americans get covered. Add your name now: https://t.co/HQSZKPl1eH"}, {"text": "No one's too wrapped up in pre-existing conditions to #GetCovered. \nThanks to Obamacare, you can find a plan that meets your needs. https://t.co/ZLKWSvHNk8"}, {"text": "This is what happens when we focus on building an economy that works for everyone, not just those at the top. https://t.co/op3Z74rPeI"}, {"text": "Obamacare has helped millions of Americans gain the peace of mind that comes with coverage. Show your support: https://t.co/NfrG7DHL5C"}, {"text": "New report: Renewable energy installations are beating fossil fuel installations for the first time. https://t.co/MMhIdu4jzt #ActOnClimate"}, {"text": "President Obama lays out just a few of the ways in which #Obamacare has helped millions of Americans. https://t.co/qeqHRLz0ID"}, {"text": "If you're willing to work hard and play by the rules, you should be able to get ahead. https://t.co/394hdJttgO"}, {"text": "Climate change is happening now. Denial is dangerous. https://t.co/0Nlf8Fst4u"}, {"text": "Don't ghost on your health and well-being—your chance to #GetCovered is coming up. Open enrollment starts November 1. https://t.co/J86AESUreZ"}, {"text": "Senate leaders should put the common good above politics—the integrity of our nation's highest court depends on it. #DoYourJob https://t.co/Ie5vbg4f5D"}, {"text": "Senate leaders' obstruction of our Supreme Court nomination process is unacceptable. Say so: https://t.co/t3pYMO8Fp0 #DoYourJob"}, {"text": "Open enrollment begins tomorrow—make sure you and your loved ones #GetCovered. https://t.co/2aak7Bt0s3"}, {"text": "There's nothing to be scared of when searching for health insurance. Three in four people can #GetCovered for less than $75 a month. https://t.co/YixI8RXOdq"}, {"text": "Speak up in support of quality, affordable health care for all. https://t.co/rGsSguMxvj"}, {"text": "Usted y su familia merecen la tranquilidad de saber que están cubiertos. El mercado de seguros abre mañana. https://t.co/9iRCkLRGZD"}, {"text": "Lions and Tiggers and bears! Oh my! #HappyHalloween https://t.co/iU4fjBhi0Y"}, {"text": "The Obamacare marketplace is now open. If you're uninsured, now is the time to shop for a plan and #GetCovered. https://t.co/7mJYFEz4QS https://t.co/uiA1EGZylU"}, {"text": "With #Obamacare, people can focus on treatment for pre-existing conditions without the fear of coverage being capped or denied. #GetCovered https://t.co/QqCs6K3y2v"}, {"text": "Community organizing never goes out of style. Shop now: https://t.co/LXEbQdKLLT https://t.co/E56ofoU36i"}, {"text": "Thanks to #Obamacare, quality health care is available to everyone. The marketplace is now open—make sure you and your family #GetCovered. https://t.co/0DDAhckcDW"}, {"text": "Tens of millions of Americans have benefited from #Obamacare. Make sure you're one of them. #GetCovered https://t.co/e1KoXcPtpU"}, {"text": "The positive impact of #Obamacare is undeniable, but there's one big factor holding many states back: https://t.co/7XebIdRX34"}, {"text": "There are a lot of plans out there. Check your options and lock in the one that's best for you: https://t.co/buFY9ozDz4 #GetCovered"}, {"text": "The economy added 161,000 jobs in October, and wages are up 2.8 percent over the past year. https://t.co/pJxjgLnjCt #JobsReport"}, {"text": "The landmark #ParisAgreement enters into force today—we must keep up the momentum to #ActOnClimate. https://t.co/Cyw5Udaoro"}, {"text": "Let's keep working to keep our economy on a better, stronger course. https://t.co/bV2BVjyj7a"}, {"text": "In the weekly address, President Obama discusses what #Obamacare has done to improve health care. https://t.co/VdQlyrSZhx"}, {"text": "Tonight, President Obama reflects on eight years of progress. Watch the #FarewellAddress at 9 pm ET: https://t.co/ZnwTsg155B #ObamaFarewell"}, {"text": "Hi everybody! Back to the original handle. Is this thing still on? Michelle and I are off on a quick vacation, then we’ll get back to work."}, {"text": "In the meantime, I want to hear what you're thinking about the road ahead. So share your ideas with me here: https://t.co/GYkEOK8EuT"}, {"text": "I read letters like these every single day. It was one of the best parts of the job – hearing from you. https://t.co/so1luBcszV"}, {"text": "Happy Valentine’s Day, @michelleobama! Almost 28 years with you, but it always feels new. https://t.co/O0UhJWoqGN"}, {"text": "We asked. You answered. https://t.co/mAJvko6VqR"}, {"text": "Humbled to be recognized by a family with a legacy of service. Who's your #ProfileInCourage? Tell me about them: https://t.co/euYRxWcost https://t.co/HBgFiRcq9J"}, {"text": "On International Women’s Day, @MichelleObama and I are inspired by all of you who embrace your power to drive change. https://t.co/RJ0ZH2htU8"}, {"text": "Chuck Berry rolled over everyone who came before him – and turned up everyone who came after.  We'll miss you, Chuck.  Be good."}, {"text": "My heart goes out to the victims and their families in London. No act of terror can shake the strength and resilience of our British ally."}, {"text": "Well said, Jimmy. That's exactly why we fought so hard for the ACA, and why we need to protect it for kids like Billy. And congratulations! https://t.co/77F8rZrD3P"}, {"text": "We're rolling up our sleeves again, back where it all started. Join us at https://t.co/GYkEOK8EuT. https://t.co/UlyvNrQvZR"}, {"text": "Happy Mother's Day to my love and partner on this journey @MichelleObama, and to all the wonderful, hardworking mothers out there."}, {"text": "Excited to hear from Sierra, Imani, Filiz, and Benedikt who are making a difference at home and abroad. See you in Berlin! https://t.co/SSqTgPKTzu"}, {"text": "Our hearts go out to those killed and wounded in Manchester. Americans will always stand shoulder to shoulder with the people of the UK."}, {"text": "Through faith, love, and resolve the character of the people of Manchester has shown itself.  Our thoughts &amp; prayers are with you. https://t.co/rZyZaQVWT2"}, {"text": "Good to see my friend Prince Harry in London to discuss the work of our foundations &amp; offer condolences to victims of the Manchester attack. https://t.co/7azv4BV2Nt"}, {"text": "Forever grateful for the service and sacrifice of all who fought to protect our freedoms and defend this country we love. https://t.co/y7IQltbEz9"}, {"text": "On this National Gun Violence Awareness Day, let your voice be heard and show your commitment to reducing gun violence. https://t.co/eXkV4WmkqA"}, {"text": "Of all that I've done in my life, I'm most proud to be Sasha and Malia's dad. To all those lucky enough to be a dad, Happy Father's Day! https://t.co/ya1YAJignC"}, {"text": "Health care has always been about something bigger than politics: it's about the character of our country. https://t.co/UqLO14Hef7"}, {"text": "John McCain is an American hero &amp; one of the bravest fighters I've ever known. Cancer doesn't know what it's up against. Give it hell, John."}, {"text": "\"No one is born hating another person because of the color of his skin or his background or his religion...\" https://t.co/InZ58zkoAm"}, {"text": "\"People must learn to hate, and if they can learn to hate, they can be taught to love...\""}, {"text": "\"...For love comes more naturally to the human heart than its opposite.\" - Nelson Mandela"}, {"text": "Michelle and I are thinking of the victims and their families in Barcelona. Americans will always stand with our Spanish friends. Un abrazo."}, {"text": "Thank you to all the first responders and people helping each other out. That's what we do as Americans. Here's one way you can help now. https://t.co/iGfE8rAoAu"}, {"text": "To target hopeful young strivers who grew up here is wrong, because they’ve done nothing wrong. My statement: https://t.co/TCxZdld7L4"}, {"text": "Americans always answer the call. https://t.co/SV1jixOExu https://t.co/ktEvL6s89d"}, {"text": "Proud of these McKinley Tech students—inspiring young minds that make me hopeful about our future. https://t.co/nqYC1mjjTB"}, {"text": "We remember everyone we lost on 9/11 and honor all who defend our country and our ideals. No act of terror will ever change who we are."}, {"text": "Michelle and I want the @ObamaFoundation to inspire and empower people to change the world. Here's how we're getting started this fall. https://t.co/Q8a4voDXjV"}, {"text": "Coding is important – and fun. @CSforAll, thanks for your work to make sure every kid can compete in a high-tech, global economy. https://t.co/QDZqcoEQiM"}, {"text": "Thinking about our neighbors in Mexico and all our Mexican-American friends tonight. Cuidense mucho y un fuerte abrazo para todos."}, {"text": "Prosecutor, soldier, family man, citizen. Beau made us want to be better. What a legacy to leave. What a testament to @JoeBiden. https://t.co/078Pt7evMZ"}, {"text": "We're expanding our efforts to help Puerto Rico &amp; the USVI, where our fellow Americans need us right now. Join us at https://t.co/o5oCWOtiJS https://t.co/L2xArjc9N7"}, {"text": "Proud to cheer on Team USA at the Invictus Games today with my friend Joe. You represent the best of our country. https://t.co/WBzcltmgqj"}, {"text": "Michelle &amp; I are praying for the victims in Las Vegas. Our thoughts are with their families &amp; everyone enduring another senseless tragedy."}, {"text": "I'm grateful to @SenJohnMcCain for his lifetime of service to our country. Congratulations, John, on receiving this year's Liberty Medal."}, {"text": "Tonight the ex-Presidents are getting together in Texas to support all our fellow Americans rebuilding from this year’s hurricanes. Join us. https://t.co/RShkuueyoj"}, {"text": "I’ll let you and @ladygaga handle the singing, and we’ll handle the donations. There’s still time to give: https://t.co/o5oCWOtiJS. https://t.co/uKCBwAL2hs"}, {"text": "Hello, #ObamaSummit! Thrilled to host civic leaders in Chicago from all over the world. Follow along at @ObamaFoundation."}, {"text": "Michelle and I are thinking of the victims of today's attack in NYC and everyone who keeps us safe. New Yorkers are as tough as they come."}, {"text": "Starting today, you can sign up for 2018 health coverage. Head on over to https://t.co/ob1Ynoesod and find a plan that meets your needs. https://t.co/6vYt83w74T"}, {"text": "We grieve with all the families in Sutherland Springs harmed by this act of hatred, and we’ll stand with the survivors as they recover..."}, {"text": "May God also grant all of us the wisdom to ask what concrete steps we can take to reduce the violence and weaponry in our midst."}, {"text": "Every election matters - those who show up determine our future. Go vote tomorrow! https://t.co/j1wh8hLamw"}, {"text": "This is what happens when the people vote. Congrats @RalphNortham and @PhilMurphyNJ . And congratulations to all the victors in state legislative, county and mayors' races. Every office in a democracy counts!"}, {"text": "ME:  Joe, about halfway through the speech, I’m gonna wish you a happy birth--\nBIDEN:  IT’S MY BIRTHDAY!\nME:  Joe.\n \nHappy birthday to @JoeBiden, my brother and the best vice president anybody could have. https://t.co/sKbXjNiEjH"}, {"text": "From the Obama family to yours, we wish you a Happy Thanksgiving full of joy and gratitude. https://t.co/xAvSQwjQkz"}, {"text": "Michelle and I are delighted to congratulate Prince Harry and Meghan Markle on their engagement. We wish you a lifetime of joy and happiness together."}, {"text": "Just got off a call to thank folks who are working hard to help more Americans across the country sign up for health coverage. But it's up to all of us to help spread the word: Sign up through this Friday at https://t.co/ob1Ynoesod. https://t.co/8TYpLCestp"}, {"text": "Happy Hanukkah, everybody, from the Obama family to yours. Chag Sameach!"}, {"text": "There's no better time than the holiday season to reach out and give back to our communities. Great to hear from young people at the Boys &amp; Girls Club in DC today. https://t.co/FSJkj1qwg9"}, {"text": "On behalf of the Obama family, Merry Christmas! We wish you joy and peace this holiday season. https://t.co/CNFUZrhrBj"}, {"text": "As we count down to the new year, we get to reflect and prepare for what’s ahead. For all the bad news that seemed to dominate our collective consciousness, there are countless stories from this year that remind us what's best about America."}, {"text": "Kat Creech, a wedding planner in Houston, turned a postponed wedding into a volunteer opportunity for Hurricane Harvey victims. Thirty wedding guests became an organization of hundreds of volunteers. That’s a story from 2017. https://t.co/yxhjwkr5Se"}, {"text": "Chris Long gave his paychecks from the first six games of the NFL season to fund scholarships in Charlottesville, VA. He wanted to do more, so he decided to give away an entire season’s salary. That’s a story from 2017. https://t.co/NL0RoARkan"}, {"text": "Ten-year-old Jahkil Jackson is on a mission to help homeless people in Chicago. He created kits full of socks, toiletries, and food for those in need. Just this week, Jahkil reached his goal to give away 5,000 “blessing bags.” That’s a story from 2017. https://t.co/muxPZnEGkd"}, {"text": "All across America people chose to get involved, get engaged and stand up. Each of us can make a difference, and all of us ought to try. So go keep changing the world in 2018."}, {"text": "Dr. King was 26 when the Montgomery bus boycott began. He started small, rallying others who believed their efforts mattered, pressing on through challenges and doubts to change our world for the better. A permanent inspiration for the rest of us to keep pushing towards justice."}, {"text": "Happy Valentine’s Day, @MichelleObama. You make every day and every place better. https://t.co/aWvyytR7Mm"}, {"text": "We are grieving with Parkland. But we are not powerless. Caring for our kids is our first job. And until we can honestly say that we're doing enough to keep them safe from harm, including long overdue, common-sense gun safety laws that most Americans want, then we have to change."}, {"text": "Billy Graham was a humble servant who prayed for so many - and who, with wisdom and grace, gave hope and guidance to generations of Americans."}, {"text": "Young people have helped lead all our great movements. How inspiring to see it again in so many smart, fearless students standing up for their right to be safe; marching and organizing to remake the world as it should be. We've been waiting for you. And we've got your backs."}, {"text": "I got my start holding community meetings in Chicago, so it was fun to be home for one tonight. Michelle and I want the world to come together on the South Side at a place built with local ideas, values, and hopes. That’s the @ObamaFoundation and Presidential Center. https://t.co/ccwkqAY7P5"}, {"text": "Four years ago, @MichelleObama and I had the privilege to host Lt. Cmdr. Dan Cnossen and his fellow Paralympians and Olympians at the White House. Today, we’re so proud of him for winning gold and silver - while still representing the red, white, and blue. https://t.co/evDCV7zehM"}, {"text": "Have fun out there among the stars. https://t.co/S285MTwGtp"}, {"text": "Just because I have more time to watch games doesn’t mean my picks will be better, but here are my brackets this year: https://t.co/ETRchPcZxF https://t.co/gnNXw0Ysxr"}, {"text": "Congrats to @LoyolaChicago and Sister Jean for a last-second upset - I had faith in my pick!"}, {"text": "41: I like the competition. And the loyalty to the home team. - 44 https://t.co/XG3ChMtW0M"}, {"text": "In Singapore with young people who are advocating for education, empowering young women, and getting involved all over Southeast Asia with a profoundly optimistic commitment to building the world they want to see. https://t.co/so4Uqouu8M"}, {"text": "Our most important task as a nation is to make sure all our young people can achieve their dreams. We’ve started this work with @MBK_Alliance, but there’s so much more all of us have to do—government, private sector, academia &amp; community leaders—to change the odds for our kids. https://t.co/7f7A0HmK50"}, {"text": "Michelle and I are so inspired by all the young people who made today’s marches happen. Keep at it. You’re leading us forward. Nothing can stand in the way of millions of voices calling for change."}, {"text": "Incredible to have a Chicago team in the Final Four. I’ll take that over an intact bracket any day! Congratulations to everybody @LoyolaChicago - let’s keep it going!"}, {"text": "Our statement on the passing of Former First Lady Barbara Bush: https://t.co/MhTVYCL9Nj"}, {"text": "These talented young people will create a better future not just in Africa, but around the world. I can’t wait to spend some time with @ObamaFoundation Leaders and look forward to honoring the Mandela legacy in Johannesburg this summer. https://t.co/b73wGIW4Gj"}, {"text": "There are few issues more important to the security of the US than the potential spread of nuclear weapons or the potential for even more destructive war in the Middle East. Today’s decision to put the JCPOA at risk is a serious mistake. My full statement: https://t.co/4oTdXESbxe"}, {"text": "Happy Mother’s Day to every mom out there, especially the remarkable moms in my life, @MichelleObama and my mother-in-law, Marian Robinson. https://t.co/n65fyWg7O8"}, {"text": "This Center is for the leaders of tomorrow who are ready to step up and build the world as it should be. Michelle and I are grateful to Chicagoans and the Chicago City Council for making it happen. https://t.co/86uiJ55azV"}, {"text": "We can never truly repay the debt we owe our fallen heroes. But we can remember them, honor their sacrifice, and affirm in our own lives those enduring ideals of justice, equality, and opportunity for which generations of Americans have given that last full measure of devotion. https://t.co/pRxwmaMClL"}, {"text": "This National Gun Violence Awareness Day, show your commitment to keeping our kids safe from gun violence. Then, for everyone we’ve lost, take action to change our leadership and our laws until they reflect that commitment - no matter how long it takes. https://t.co/lraIwlQAgl"}, {"text": "“Low plastic stool, cheap but delicious noodles, cold Hanoi beer.” This is how I’ll remember Tony. He taught us about food — but more importantly, about its ability to bring us together. To make us a little less afraid of the unknown. We’ll miss him. https://t.co/orEXIaEMZM"}, {"text": "Congratulations to the @Capitals! This @NHLBlackhawks fan knows what it’s like to lift that cup – and I’m happy for all the Caps fans who cheer so hard for their team, and for a team that celebrates so hard with its fans."}, {"text": "This week, I’m traveling to Africa for the first time since I left office – a continent of wonderful diversity, thriving culture, and remarkable stories. As I prepare for this trip, I wanted to share a list of books that I’d recommend for summer reading: https://t.co/W4Jc0N23iy"}, {"text": "Mandela Day is about taking action to change the world for the better. In these young people, I see Madiba's example of persistence and hope. They are poised to make this world more peaceful, more prosperous, and more just. https://t.co/GJDuOs1hkH"}, {"text": "Today I’m proud to endorse such a wide and impressive array of Democratic candidates – leaders as diverse, patriotic, and big-hearted as the America they’re running to represent: https://t.co/gWzalQhFas"}, {"text": "I’m confident that, together, they’ll strengthen this country we love by restoring opportunity, repairing our alliances and standing in the world, and upholding our fundamental commitment to justice, fairness, responsibility, and the rule of law. But first, they need our votes."}, {"text": "Bobby Kennedy was one of my heroes. He was someone who showed us the power of acting on our ideals, the idea that any of us can be one of the “million different centers of energy and daring” that ultimately combine to change the world for the better. https://t.co/nAiPiGercs"}, {"text": "Aretha helped define the American experience. In her voice, we could feel our history, all of it and in every shade—our power and our pain, our darkness and our light, our quest for redemption and our hard-won respect. May the Queen of Soul rest in eternal peace. https://t.co/bfASqKlLc5"}, {"text": "Our statement on the passing of Senator John McCain: https://t.co/3GBjNYxoj5"}, {"text": "Congratulations to Hawaii for winning the Little League World Series! You make America very proud. 🤙🏾 https://t.co/8Un7LPXgX1"}, {"text": "Yesterday I met with high school students on Chicago’s Southwest side who spent the summer learning to code some pretty cool apps. Michelle and I are proud to support programs that invest in local youth and we’re proud of these young people. https://t.co/dQnDgswCj5"}, {"text": "Today I’m at the University of Illinois to deliver a simple message to young people all over the country: You need to vote, because our democracy depends on it. I hope you'll tune in at 11am CT: https://t.co/34WjNaVAcU"}, {"text": "We will always remember everyone we lost on 9/11, thank the first responders who keep us safe, and honor all who defend our country and the ideals that bind us together. There's nothing our resilience and resolve can’t overcome, and no act of terror can ever change who we are."}, {"text": "The first class of Obama Fellows is full of leaders like Keith—hardworking, innovative, and dedicated to partnering with their communities to drive transformational change. https://t.co/FN794E7Cqs"}, {"text": "The antidote to government by a powerful few is government by the organized, energized many. This National Voter Registration Day, make sure you're registered, vote early if you can, or show up on November 6. This moment is too important to sit out."}, {"text": "From civil servants to organizers, the young people I met in Amsterdam today are doing the hard work of change. And they keep at it for their communities, their countries, and the collective future of Europe and the world. Keep up the good work. https://t.co/AVtuBPHdr2"}, {"text": "Today, I’m proud to endorse even more Democratic candidates who aren’t just running against something, but for something—to expand opportunity for all of us and to restore dignity, honor, and compassion to public service. They deserve your vote: https://t.co/NO5jnhX3XD"}, {"text": "Happy Anniversary, @MichelleObama. For 26 years, you’ve been an extraordinary partner, someone who can always make me laugh, and my favorite person to see the world with. https://t.co/s8xoZ9j2YR"}, {"text": "Congratulations to Drew Brees on the all time passing record. Always a class act."}, {"text": "I’m so proud of the work @MichelleObama has done over the years to ensure adolescent girls have access to education, and I know that the @GirlsAlliance will be another great chapter in her effort to get girls the opportunities they deserve. https://t.co/Ohv6NAylo4"}, {"text": "America is always at our best when we look out for each other. Please do what you can to help people recover and rebuild from Hurricane Michael. https://t.co/psmPZnmlqY"}, {"text": "The last presidential election turned on fewer than 100,000 votes in three states. More people go to Coachella. There’s no good excuse not to vote. Head over to https://t.co/zTCemnRMYV to check your registration, get your absentee ballot, and find out where to vote on November 6. https://t.co/LIQbltVJtz"}, {"text": "We grieve for the Americans murdered in Pittsburgh. All of us have to fight the rise of anti-Semitism and hateful rhetoric against those who look, love, or pray differently. And we have to stop making it so easy for those who want to harm the innocent to get their hands on a gun."}, {"text": "Your vote can decide the health care of millions. Your voice can determine the character of our country. You have power — use it! In most states, you don't even have to wait until Election Day to cast a ballot. Find out where you can vote before Nov. 6: https://t.co/NKXRGNgbZX https://t.co/hWkFHqi49K"}, {"text": "Not sure who and what you can vote for? Head over to https://t.co/SHxg6ael0O to look up your state, learn who's running to represent you, which measures you can help decide, and more. Read up, and get ready to vote on November 6."}, {"text": "While we're talking about preexisting conditions, the ACA is the law that finally protected your coverage for preexisting conditions.\n\nThose protections and your health care are absolutely at stake on Tuesday. Vote for Democrats who’ll protect them. https://t.co/BDDmY60u8k"}, {"text": "Elections matter. You have the power to protect a family’s health care. Make a plan, grab some friends, and vote: https://t.co/rY8Ip1km9p"}, {"text": "Speaking of preexisting conditions, open enrollment starts today. If you or someone you know needs health care, visit https://t.co/ob1Ynoesod. Thanks to financial help, most people can find plans for $75/month or less, so check out your options and find a plan that works for you. https://t.co/R52X9sgkbP"}, {"text": "Tomorrow’s elections might be the most important of our lifetimes. The health care of millions is on the ballot. Making sure working families get a fair shake is on the ballot. The character of our country is on the ballot."}, {"text": "When we've been at such crossroads before, Americans have made the right choice. Not because we sat back and waited for history to happen -- but because we marched, and mobilized, and voted. We made history happen."}, {"text": "When you vote, you have the power to protect voting rights. To make sure our criminal justice system treats everyone equally under the law. To strengthen laws that protect women in the workplace from harassment – and make sure they’re paid equally."}, {"text": "When you vote, you have the power to make it easier for a student to afford college, and harder for a disturbed person to shoot up a classroom. When you vote, you have the power to make sure a family keeps its health insurance."}, {"text": "If you take that power and vote, something powerful happens. Change happens. Hope happens. And with each new step we take in the direction of fairness, and justice, and equality, and opportunity, hope spreads. Go vote! https://t.co/NKXRGNgbZX"}, {"text": "Today is the day. Today, it’s your turn to raise your voice to change the course of this country for the better. So make it count. Get out there and vote. Go to https://t.co/NKXRGNgbZX or call 833-336-VOTE to confirm where you can vote and check voting hours. https://t.co/6xdMbKhwkr"}, {"text": "Congratulations to everybody who showed up and participated in our democracy in record numbers yesterday. The change we need won’t come from one election alone – but it is a start. Last night, voters across the country started it. https://t.co/gNk4WkeJUn"}, {"text": "To all our veterans and your families: thank you. There's no tribute that can truly match the magnitude of your service and sacrifice. But all of us can do our best to live up to the American values of service, responsibility, generosity, and citizenship that you helped defend."}, {"text": "Michelle and I are heartbroken for everybody who’s lost so much in California, and grateful for the heroism of the firefighters who’ve been risking their lives around the clock to save others. Please do what you can to help our fellow Americans in need: https://t.co/13rm1D6Rwk"}, {"text": "Of course, @MichelleObama’s my wife, so I’m a little biased here. But she also happens to be brilliant, funny, wise – one of a kind. This book tells her quintessentially American story. I love it because it faithfully reflects the woman I have loved for so long. https://t.co/X0i9jja4TE"}, {"text": "Our future depends on all our young people, including our boys and young men of color, being able to achieve their dreams. Today, I’m proud to share @MBK_Alliance’s first investments in communities devoted to this mission. Get inspired: https://t.co/dKLWPvrFPC"}, {"text": "When someone shares their story, we see the world through their eyes. I’m looking forward to hearing a few from leaders around the world and sharing my own at the @ObamaFoundation Summit in Chicago. Tune in at https://t.co/GYkEOK8EuT. https://t.co/sOllDsDA1Z"}, {"text": "Thanks to the Chicago @FoodDepository team for all you do and to the volunteers who are doing great work and let me crash today. Happy Thanksgiving, everybody! https://t.co/r4QeBeCoT1"}, {"text": "I am grateful for the next generation of leaders -- the young people who are tolerant, creative, idealistic and doing the work to create the world as it should be. Who understand that hope requires action. From the Obama family to yours, Happy Thanksgiving. https://t.co/AbjXUwCh6z"}, {"text": "America has lost a patriot and humble servant in George Herbert Walker Bush. While our hearts are heavy today, they are also filled with gratitude. Our thoughts are with the entire Bush family tonight – and all who were inspired by George and Barbara’s example. https://t.co/g9OUPu2pjY"}, {"text": "Happy Hanukkah! Over these eight nights, we draw inspiration from light that can overpower any darkness, and recommit ourselves to building a brighter future for our families, our communities, and our world. Chag Sameach from the Obama family to yours."}, {"text": "No jump shots. No ferns. No memes. Not this time. I’m going to give it to you straight: If you need health insurance for 2019, the deadline to get covered is December 15. Go to https://t.co/ob1Ynoesod today and pass this on — you just might save a life. https://t.co/8mHMsXGY0g"}, {"text": "As Bobby Kennedy taught us, the thing about hope is that it travels through space *and* time, first splashing against the rocks, but eventually breaking down the walls of cruelty and injustice. And if we do our best with the time we’re given, others will take hope in our example. https://t.co/RMJgrWQhP2"}, {"text": "Joe is right. Head to https://t.co/SS87NTsgJt before tomorrow’s deadline. And nice bracelet, by the way. https://t.co/NFy3LxZe3f"}, {"text": "Today is the last day of open enrollment. That means it’s the deadline to make sure you and the people you love have health insurance in 2019. So head over to https://t.co/ob1Ynoesod to get covered! Here’s what else you need to know today about health care: https://t.co/gosn6c6uCa"}, {"text": "Merry Christmas and happy holidays to the extraordinary kids, families, and staff at Children’s National. And thanks for humoring me as your stand-in Santa. https://t.co/mFmYCVk7cr"}, {"text": "There’s no better time than the holidays to give back to your community. Yesterday I got to do just that at @ChildrensHealth. As we celebrate the season and look forward to 2019, let’s recommit to doing our part to build a world that is a little more generous, tolerant, and kind. https://t.co/77rcNoY8jn"}, {"text": "Enjoy the holiday season with the ones you love. Michelle and I wish you a very Merry Christmas! https://t.co/LKLqlYfFUw"}, {"text": "As 2018 draws to a close, I’m continuing the tradition of sharing my year-end lists. It gives me a moment to reflect on the year through the books, movies, and music that I found most thought-provoking, inspiring, or just plain loved. I hope you enjoy it: https://t.co/qz6TCMKnkL"}, {"text": "Leaders like Dejah Powell, who started an organization to bring health and wellness resources to communities on the South Side of Chicago, expanding food access and providing people the space and time to take care of themselves. https://t.co/tPW7NxTGLO"}, {"text": "As the year winds down and we look toward 2019, I’m asking you to make a commitment: find something you want to change in your community and take the first step toward changing it. If you need some inspiration, take a look at some of the young leaders who inspired me this year."}, {"text": "Leaders like Moussa Kondo and Sandor Lederer, who are each doing their part to fight corruption in their native countries of Mali and Hungary. Two people separated by continents but united in their pursuit of a more just, transparent society. https://t.co/YbOxSEyyCd"}, {"text": "I hope you find inspiration in the stories of Dejah, Moussa, Sandor, Hong and Jonny. Their journeys began with a decision to build the better future they wanted to see. The same is true for you. What matters isn’t the size of the step you take; what matters is that you take it."}, {"text": "Leaders like Jonny Boucher, a Chicago native who, after losing too many friends and family to suicide, started a coffee shop to offer emotional support and guidance to those who might be in need of a little more than a strong cup of coffee to get through their day. https://t.co/H6XPceR6d9"}, {"text": "Leaders like Hong Hoang, who mobilized a youth-led movement to create a greener world after becoming the first Vietnamese person to visit Antarctica. https://t.co/K8xPNC1OCQ"}, {"text": "In 2018 people stepped up and showed up like never before. Keep it up in 2019. We’ve got a lot of work to do, and I’ll be right there with you. Happy New Year, everybody!"}, {"text": "I knew it way back then and I’m absolutely convinced of it today — you’re one of a kind, @MichelleObama. Happy Birthday! https://t.co/ejqm0uC9J4"}, {"text": "I’ve always drawn inspiration from what Dr. King called life’s most persistent and urgent question: \"What are you doing for others?\" Let’s honor his legacy by standing up for what is right in our communities and taking steps to make a positive impact on the world."}, {"text": "The @ObamaFoundation is connecting people from around the world so they can form partnerships just like this. I am inspired by Robert and Vanessa and what’s possible when leaders come together to have an even greater impact on the world. https://t.co/hFAMzW7tBq"}, {"text": "As we celebrate Black History Month and Jackie Robinson’s 100th birthday, we celebrate the life of all whose courage opened the gates for everybody, and in the process, made America better. https://t.co/Fl9aDxqcGi"}, {"text": "We lost two great Americans today – Frank Robinson and John Dingell – citizens who inspired me and so many others by leading on the civil rights issues of our time, opening doors to others, and leaving it all on the field."}, {"text": "My statement on the passing of former Congressman John Dingell: https://t.co/gjBYHHImzB"}, {"text": "Happy 85th birthday to @RealBillRussell - the greatest champion in American sports, and a lifelong warrior for justice."}, {"text": "Don’t be sad it’s over, be proud it taught us so much. Congrats to all the men and women of @NASA on a @MarsRovers mission that beat all expectations, inspired a new generation of Americans, and demands we keep investing in science that pushes the boundaries of human knowledge."}, {"text": "In the year since their friends were killed, the students of Parkland refused to settle for the way things are and marched, organized, and pushed for the way things should be - helping pass meaningful new gun violence laws in states across the country. I'm proud of all of them."}, {"text": "Happy Valentine’s Day to the extraordinarily smart, beautiful, funny, one and only @MichelleObama. It’s true; she does get down to Motown. https://t.co/uypbZsEiqB"}, {"text": "I’ve always loved basketball because it’s about building a team that’s equal to more than the sum of its parts. Glad to see this expansion into Africa because for a rising continent, this can be about a lot more than what happens on the court. https://t.co/lghcLaUN9a"}, {"text": "I’m about to join @StephenCurry30 on stage with @MBK_Alliance to answer questions from boys and young men of color about the challenges that confront them and the opportunities within their grasp. Tune in at https://t.co/swMRHuB5Y4."}, {"text": "Zion Williamson seems like an outstanding young man as well as an outstanding basketball player. Wishing him a speedy recovery."}, {"text": "It’s up to all of us as citizens to make sure that the rules of democracy are fair—everywhere—because the next decade of our nation's progress is on the line. Join me and @allontheline in the fight against gerrymandering: https://t.co/d7TYE8u0CD. https://t.co/rKchS3ltLI"}, {"text": "On International Women’s Day, I’m reflecting on the future we all want for our daughters: one where they can live out their aspirations without limits. And I’m celebrating some of the women who are building that future for all of us today."}, {"text": ".@preethiherman is helping women unleash their power to change their societies. As head of the https://t.co/3RwHe5Razz Foundation, she’s leading an initiative that combines online tools with in-person organizing, giving women a voice in her native India—and beyond. https://t.co/TKuAKVL5Y1"}, {"text": ".@BarbeAlice is helping refugees resettle into welcoming communities in France, offering them job training and language immersion, as well as a place to stay. More importantly, she’s fighting a narrative that suggests our differences are more important than our shared humanity. https://t.co/jNIiKIAZaO"}, {"text": "And @SeforaKodjo is helping the next generation of women leaders in Africa rise up. Her organization is training and mentoring young women across the continent to adopt a new model of leadership, one that puts gender equality at the heart of economic development. https://t.co/cRb4EKcrvv"}, {"text": "Preethi, Alice, and Sefora are just three of many @ObamaFoundation leaders who remind us what International Women’s Day is all about: imagining a world free of artificial ceilings for the next generation—and doing the hard work to get us there."}, {"text": "The Crew Dragon’s been on quite a ride since I last saw it—congrats to @NASA and @SpaceX on a successful return! We invested in the @Commercial_Crew program to strengthen the U.S. space program for the long haul, and it’s great to see that happening. https://t.co/Dsu5mZcaCZ"}, {"text": "Michelle and I send our deepest sympathies to all who knew the victims of today’s plane crash in Ethiopia."}, {"text": "What a great moment. Happy 110th, Virginia. https://t.co/FuNZV3RRV4"}, {"text": ".@MichelleObama and I are rooting hard for Team USA as the Special Olympics World Games get underway this week. Our Special Olympians are terrific examples of America’s heart and drive."}, {"text": "Michelle and I send our condolences to the people of New Zealand. We grieve with you and the Muslim community. All of us must stand against hatred in all its forms."}, {"text": "In 2011, I visited the tiny town of Moneygall and got to walk around in the house where my great-great-great grandfather Falmouth Kearney lived his early life. I'll always be grateful for the warmth and generosity of the Irish people. Happy St. Patrick's Day! -Barack O’Bama https://t.co/abDtarFbR5"}, {"text": "The floods in the Midwest and in southern Africa are heartbreaking. Suffering and loss on two sides of the world calls for solidarity and strength from all of us. Ask what you can do to help our fellow Americans and families in need. Here are some ideas: https://t.co/jWJlKABqAb"}, {"text": "And here are some ways to help cyclone victims in Mozambique, Malawi, and Zimbabwe: https://t.co/if8HZBtWBH"}, {"text": "Just in the nick of time: My brackets have never been my one shining moment, but here we go again. You can check out my #MarchMadness picks here: https://t.co/c3bjNrIo4w https://t.co/EcCUdnZjun"}, {"text": "Last night I had the chance to meet with first-term Democrats in Congress—it's a young, diverse class, stocked with a bunch of my campaign and administration alums who’ve taken the torch. This group is going to be driving progress for a long time to come. https://t.co/W5dDlDtNzE"}, {"text": "Valerie is one of my oldest friends and advisors – she was by my side when I first decided to run for office and for every major moment of the presidency. @ValerieJarrett's voice has often inspired me and I know “Finding My Voice” will inspire others to lift their voices, too. https://t.co/nWTBDByMoz"}, {"text": "Great to see Chicago’s historic mayoral race between two highly qualified candidates. Congrats to our next mayor, Lori Lightfoot—and Toni Preckwinkle campaigned hard and did us proud. I know that with our city’s heart and Lori’s leadership, Chicago’s best days are still ahead."}, {"text": "Here’s a story about people doing good that's worth sharing: @BradPaisley and his wife @Kimwilliamspais saw food insecurity in Nashville and decided to do something about it. They just broke ground on a free grocery store to help families in need: https://t.co/o6pcAApZsm"}, {"text": "A voice everybody should hear. https://t.co/0u7HUlQ8id"}, {"text": "In just a few minutes, I’m taking the stage at the @ObamaFoundation Town Hall Europe for a conversation about how to best support civic leaders carrying out good work across the continent. I hope you’ll tune in live at https://t.co/swMRHuB5Y4. https://t.co/Ds4I8wFFM1"}, {"text": "From a big NBA fan, congrats to future Hall of Famers Dwyane Wade and Dirk Nowitzki—not just all-time greats but class acts, too."}, {"text": "Another good story worth sharing: From one \"kid from Akron\" to a new generation of Akron kids, some remarkable early achievements at @IPROMISESchool. Great work, @KingJames—and even better work by those students. Proud to be a witness to their success: https://t.co/ctWfKnA5GL"}, {"text": "Congratulations, Tiger! To come back and win the Masters after all the highs and lows is a testament to excellence, grit, and determination."}, {"text": "Notre Dame is one of the world’s great treasures, and we’re thinking of the people of France in your time of grief. It’s in our nature to mourn when we see history lost – but it’s also in our nature to rebuild for tomorrow, as strong as we can. https://t.co/SpMEvv1BzB"}, {"text": "The attacks on tourists and Easter worshippers in Sri Lanka are an attack on humanity. On a day devoted to love, redemption, and renewal, we pray for the victims and stand with the people of Sri Lanka."}, {"text": "To all who celebrate today, happy Easter from our family to yours! On this day of rebirth and renewal, let’s recommit to love and serve our brothers and sisters, especially those in need, in every way we can. Have a great day, everybody. https://t.co/BtMyWebGLw"}, {"text": "Young people all over the world are leading the way in the fight to protect our planet because they know their future depends on it. This Earth Day, I want to celebrate the courageous, committed young leaders who are stepping up to save the one planet we've got."}, {"text": "They're people like 16-year-old @GretaThunberg, whose protests at Swedish parliament sparked a movement. Inspired by Greta's action, Fridays for Future brought together more than a million strikers on every continent last month to demand action on climate. https://t.co/un7nBhEF8i"}, {"text": "I met 23-year-old @luisamneubauer in Berlin earlier this month. Luisa, the organizer behind the student movement in Germany, says, “It’s our future and we’re not going to stop fighting for it.” https://t.co/hS03PCWYAq"}, {"text": "And in the U.S., 13-year old @AlexandriaV2005 of New York, 13-year old @havenruthie of Denver, and 16-year old @israhirsi of Minneapolis are some of the young people leading the fight at home. I hope more of us will follow their example. https://t.co/qe08CGHBEI"}, {"text": "This generation of climate activists is tired of inaction, and they've caught the attention of leaders all over the world. So while this challenge is only getting more urgent, they show us the kind of action it'll take to meet this moment."}, {"text": "Dominique’s story is a reminder to us that where you’re from shouldn’t define what you can achieve. I’m proud of her and all students striving for a better future. https://t.co/eD95oWrOk4"}, {"text": "For thirty-six years, Richard Lugar proved that pragmatism and decency work—not only in Washington but all over the world. Michelle and I send our warmest sympathies to his family and all those who had the privilege of knowing this American statesman. https://t.co/Oy5DzPwkGb"}, {"text": "Congratulations to the new class of @ObamaFoundation Fellows! Their work in every region of the globe is already making the world better, and I hope this experience helps them make an even bigger impact. https://t.co/azK2Y9Iw5c https://t.co/tuKO1SFhSK"}, {"text": "Condolences to the family of John Singleton. His seminal work, Boyz n the Hood, remains one of the most searing, loving portrayals of the challenges facing inner-city youth. He opened doors for filmmakers of color to tell powerful stories that have been too often ignored."}, {"text": "Happy #CollegeSigningDay, everybody! I'm proud of every student out there who's taking the next step in their education. It's the best thing you can do for yourself and your future. https://t.co/SZQaUG2Zze"}, {"text": "As part of the @ObamaFoundation, moms like Dr. Mwansa Ketty Lubeya are answering the call for change—and raising the next generation of leaders while they’re at it. https://t.co/llToyKG2Y7"}, {"text": "Happy Mother's Day to the most caring, brilliant, funny, and grounded woman I know—a perfect role model not just for our daughters, but so many others. Love you, @MichelleObama. https://t.co/liWmYaEPVk"}, {"text": "Here’s a great story: While we’ve still got a lot of work to do to make college affordable for everyone, that didn’t stop Robert F. Smith from seizing an opportunity to make a difference. He’s erasing the student loan debt for this year’s @Morehouse grads. https://t.co/I3X38Pbpjz"}, {"text": "Great to get out there and take a few cuts at the plate yesterday—I had a blast with all these extraordinary young people. Thanks for letting me drop in and thanks to the Nationals Youth Academy for the outstanding work you do to support youth in DC. https://t.co/GKRMd8kZxm"}, {"text": "On Memorial Day, we remember all those who gave everything for something greater than themselves. It's up to us to not simply reflect on their sacrifice but to honor it with service of our own—and by living out the values they fought for. https://t.co/tZx3qcHnfV"}, {"text": "Exciting to see the faces of Colombia's future at an @ObamaFoundation roundtable with young leaders in Bogotá. Their creativity, their compassion, and their drive to improve their country are promising signs of what's to come. https://t.co/HrhreUuPMa"}, {"text": "A story worth sharing: Twelve years ago, Brian joined my first presidential campaign. Two years ago, he was diagnosed with ALS and launched @iamalsorg to find a cure. Brian and Sandra wake up every day believing that we can win this fight—and that makes me hopeful, too. https://t.co/eETCgFnLgP"}, {"text": "What a life. American history has always been driven by visionaries like Leah Chase—and all the men and women who worked and ate at Dooky Chase’s over the years—folks who serve up progress one bowl of gumbo at a time. https://t.co/2LpuIbxvHk https://t.co/Y4i5snKjn7"}, {"text": "You've got a lot to be proud of, Jiwandeep. Thanks for everything you do to make this country a little more equal. Turban looks great, by the way. Happy Pride Month, everybody! https://t.co/SO7mgnOkgl"}, {"text": "Last week, it was Virginia Beach. But day after day and year after year, too many families and communities are shattered by senseless gun violence. We can't get numb to this. On National Gun Violence Awareness Day, pledge to speak out, #WearOrange — and vote — to protect lives."}, {"text": "Six years ago, David Ortiz's spirit and resolve helped us all begin to heal from the Boston Marathon bombing. Today, I want to join many others in wishing him a speedy recovery of his own. Get well soon, Papi. https://t.co/9orpBgnVI5"}, {"text": "The @USWNT is something to smile about. It was great to celebrate with them back in 2015 and I'm excited to root them on in their drive to earn their fourth star. Best of luck to these champions for equality, on and off the field. #OneNationOneTeam https://t.co/AHcHGATy5S"}, {"text": "Happy Father’s Day to Charles, one of our @ObamaFoundation Fellows, and all the dads at Fathers’ Uplift. Today, we’re celebrating fathers like these who provide a powerful example—not only for their kids, but for the rest of us, too. https://t.co/GJsxi8DozY"}, {"text": "Yes we can, Greta. I’m hopeful because of you and all the young people who are fighting to protect the planet. Keep at it. https://t.co/sUBwC0uNW8"}, {"text": "This is worth a read: a thought-provoking reminder that education reform isn’t a cure-all. As a supporter of education reform, I agree that fixing educational inequality requires doing more to address the broader, systemic sources of economic inequality. https://t.co/96B7fkBM4u"}, {"text": "Outside the Oval Office, I kept a painting of a small crowd huddled around a pocketwatch, waiting for the moment the Emancipation Proclamation took effect. On Juneteenth, we celebrate the anniversary of that news - freedom - reaching slaves in Texas. And something more: https://t.co/kSkLHbfnc3"}, {"text": "On Juneteenth, we celebrate our capacity to make real the promise of our founding, that thing inside each of us that says America is not yet finished, that compels all of us to fight for justice and equality until this country we love more closely aligns with our highest ideals. https://t.co/2XAKRuRrbG"}, {"text": "Now we’re talking! Congrats to Team USA for moving on, and thanks for continuing to make us all proud. #USA https://t.co/DVkKBfU6wA"}, {"text": "What a gift to come across this interview with Julia “Hurricane” Hawkins. I’m as grateful for her life advice as I am impressed by her 100-meter dash time. https://t.co/8lc9Cimqyt"}, {"text": "50 years ago, history was written at the Stonewall Inn when New York's LGBT community stood up, spoke out, and started a movement. In 2016 I was proud to designate it as a national monument—a reminder the arc of our history is an arc of progress as long as we keep pushing for it. https://t.co/xyvYfuoJwK"}, {"text": "The most important job in our democracy is citizen. If you’re tired of politicians manipulating maps and ignoring the will of voters, I hope you’ll sign @allontheline’s Citizen Commitment today: https://t.co/CUAaoAGY6z"}, {"text": "No one changes the world alone. That’s why the @ObamaFoundation is connecting emerging leaders from South Africa to Singapore to the South Side of Chicago—so they can change the world together. Read my reflection on our second year: https://t.co/ly3en2Neu4"}, {"text": "Congrats to the USWNT! A great performance from a great team—looking forward to Sunday. #OneNationOneTeam"}, {"text": "I’m admittedly biased, but this article gibes with my experience about what all of us might take away from the “aloha spirit.” https://t.co/TCgvZYzuHe"}, {"text": "Happy Fourth of July, everybody! This is always a great day in the Obama family: a chance to celebrate America—and Malia’s birthday, too. Hope all of you are able to get some time with friends, family, and fireworks. https://t.co/Gn9kVCCnuf"}, {"text": "Yes! Fourth star. Back to back. Congrats to the record breakers on the @USWNT, an incredible team that’s always pushing themselves—and the rest of us—to be even better. Love this team. #OneNationOneTeam"}, {"text": "Proud to rep America’s best team! Congrats @USWNT and thanks for being such a strong inspiration for women and girls—and everybody—all across the country. https://t.co/9Gp6UTZhEE"}, {"text": "The @ObamaFoundation is helping a new generation of leaders make their mark, and there’s an extraordinary group gathering this week for Obama Leaders: Africa. Their work will help unlock the incredible promise of the continent—and make the world better for all of us. https://t.co/rnPHn9UuEn"}, {"text": "I have a good feeling about these Chicago @UrbanAlliance interns. Thanks for letting me spend yesterday afternoon with you—you’re going to go on to do incredible things and make many people proud. In fact, you already have. https://t.co/ZjzFQmBQqm"}, {"text": "#MandelaDay reminds us that when things feel dark, confusing, or impossible—take a look back at his writings. There, we see how a belief in the dignity of every person can be made real, an unwavering hope to steel us along our own long walks toward something better. https://t.co/fKgrVRiHhc"}, {"text": "In America, we don’t fear the future, we embrace it. 50 years ago, that spirit took us to the moon. Today, it’s embodied by people like Tiffany Davis. She’s a young rocket scientist who is helping us explore the next frontier, wherever that might take us. https://t.co/a573n8hqtG"}, {"text": "Here are a couple of articles backed by new research that are worth taking a look at: A new study on the Medicaid expansion my administration fought for under the Affordable Care Act—and how these policy decisions affect lives in real terms: https://t.co/Lj4g7lGFnq"}, {"text": "Economist Raj Chetty is not only identifying the decline in opportunity we’ve seen in recent decades—but trying to reverse it. Inequality, like many problems we face, is as vast as it is complex. But this article left me a little more hopeful: https://t.co/CcsXpVVfkP"}, {"text": "I’ve always been proud of what this team accomplished during my administration. But more than what we did, I’m proud of how they’re continuing to fight for an America that’s better. https://t.co/0cfDltjueP"}, {"text": "Here’s a worthwhile Sunday read: “…nothing should temper partisanship more than an awareness that somewhere, on some issue, people with whom you disagree are telling a story that you really need to hear.” https://t.co/tpdMZ9hJoE"}, {"text": "Recent court decisions make it clear that the change we need to restore our democracy has to come from the ground up. @Allontheline’s work to ensure an accurate census count and achieve fair maps in 2021 has never been more important. Join us today: https://t.co/d9zwitUNOa https://t.co/mEbwKCDUiP"}, {"text": "The families of our wounded warriors don't often get a lot of fanfare, but they're serving and sacrificing right alongside their loved ones. We all owe a debt to them, too, and Fisher House is always making sure we're serving those who serve us. https://t.co/dqnvNk9cQR"}, {"text": "https://t.co/nNOVtQ50O4"}, {"text": "Until all of us stand up and insist on holding public officials accountable for changing our gun laws, these tragedies will keep happening: https://t.co/reTnmcg3xo"}, {"text": "Toni Morrison was a national treasure, as good a storyteller, as captivating, in person as she was on the page. Her writing was a beautiful, meaningful challenge to our conscience and our moral imagination. What a gift to breathe the same air as her, if only for a while. https://t.co/JG7Jgu4p9t"}, {"text": "A good story gives you the chance to better understand someone else’s life. It can help you find common ground. And it’s why Michelle and I were drawn to Higher Ground’s first film, American Factory. Take a look at our conversation with the directors, and check it out on Netflix. https://t.co/KzkYFqjrFV"}, {"text": "With summer winding down, here’s a sampling of what Michelle and I have been listening to — some new, some old, some fast, some slow. Hope you enjoy. https://t.co/BS5ri1lvxz"}, {"text": "Training is at the heart of organizing. It’s why I’ve always made it a priority – from my 2008 campaign until now. And it’s why I’m proud to announce @allontheline’s in-person training initiative, Redistricting U. Join us: https://t.co/yrWJ50wSdE https://t.co/HiKvGd2XyE"}, {"text": "Saw this story of a young person doing great work and wanted to share it—keep it up, David! That’s some creative organizing.\nhttps://t.co/bbkbf7vygr"}, {"text": "Yesterday’s ruling is a big win for North Carolina—and for all of us. Voters should choose their representatives, not the other way around. This win is proof that change is always within our reach, on gerrymandering, voting rights, and much more. https://t.co/sVlKm1JaIt"}, {"text": "Marca had a remarkable way of bringing out the best within us. For me, she was a trusted voice and a persistent, buoyant spirit—an example that progress can be slow, but it’s always possible. We’ll miss her, but we’re far better off because of her fight. https://t.co/gVkQvENtIs"}, {"text": "As we remember those we lost on 9/11, we also remember the spirit of unity and togetherness that defined the weeks and months after. On this day of service, I’m reflecting on all those still working to embrace that spirit, today and every day. https://t.co/y8x9PVcwDl"}, {"text": "Bahamian families and communities face a long recovery from Hurricane Dorian. And Americans are reaching out to help. Brittany Garvin is helping people reunite and evacuate. https://t.co/k5hXu68RPH"}, {"text": "Jermaine Bell is just six years old, but when he saw people in need, he took the money he’d been saving for a trip to Disney World and spent it on food and water for South Carolina evacuees.\nhttps://t.co/H6xBIW4Ka0"}, {"text": "That’s what Americans do when others are in need – we help. We give. We inspire. Want to make a difference? There are a number of ways you can help right here: https://t.co/cnRcAfNIk2"}, {"text": "Just 16, @GretaThunberg is already one of our planet’s greatest advocates. Recognizing that her generation will bear the brunt of climate change, she’s unafraid to push for real action. She embodies our vision at the @ObamaFoundation: A future shaped by young leaders like her. https://t.co/VgCPAaDp3C"}, {"text": "One challenge will define the future for today’s young generation more dramatically than any other: Climate change. The millions of young people worldwide who’ve organized and joined today’s #ClimateStrike demand action to protect our planet, and they deserve it."}, {"text": "On National Voter Registration Day, it’s up to us as citizens to make sure everyone we know can make their voices heard at the ballot box. Check and update your registration at https://t.co/NKXRGNgbZX — and tell your friends, too."}, {"text": "Like the Beatles said: It’s getting better all the time. Thanks, babe, for 27 amazing years! https://t.co/mImRqIYn1R"}, {"text": "As President, I leaned on @AmbassadorRice’s experience, expertise, and willingness to tell me what I needed to hear. In her memoir, Tough Love, you’ll see why. It’s a tribute to American leadership—and a unifying call for us to do our part to protect it. I hope you’ll read it. https://t.co/7iUWt76xUw"}, {"text": "Here’s an interesting read—a reminder that behind every opinion lies a human being with real experiences and a story to tell. Sometimes we’ll agree and sometimes we won’t, but if we want our democracy work, listening to each other isn’t optional. https://t.co/8d4fPUprlu"}, {"text": "Congrats to the @WashMystics on a gutsy, first-ever championship! A great team performance when it counted. If folks aren’t careful, this title thing might become a habit in DC."}, {"text": "Yesterday, marathoner Eliud Kipchoge became the first ever to break two hours. Today in Chicago, Brigid Kosgei set a new women’s world record. Staggering achievements on their own, they’re also remarkable examples of humanity’s ability to endure—and keep raising the bar."}, {"text": "In December, Michelle and I will head to Malaysia for the first @ObamaFoundation Leaders: Asia-Pacific gathering. The region plays an important role in my own story, and today, it’s home to a generation of rising leaders ready to create a better world. We can’t wait to join them. https://t.co/ldFDwXMi8J"}, {"text": "I was proud to work with Justin Trudeau as President. He's a hard-working, effective leader who takes on big issues like climate change. The world needs his progressive leadership now, and I hope our neighbors to the north support him for another term."}, {"text": "Michelle and I are heartbroken over the passing of our friend, Elijah Cummings. May his example inspire more Americans to pick up the baton and carry it forward in a manner worthy of his service. https://t.co/lM2rES3PNV"}, {"text": ".@SamanthaJPower is a Pulitzer winner, an incredible writer, and a great friend. Her memoir, The Education of an Idealist, grapples with the balance between idealism, pragmatism, advocacy, and governance. It's a must-read for anyone who cares about our role in a changing world."}, {"text": "Glad to be back in Chicago for the @ObamaFoundation Summit. It’s where I first learned to organize—and where I met @MichelleObama. We all have places that define us, and at the Summit, we’ll be exploring the meaning behind them—tune in tomorrow at https://t.co/swMRHuB5Y4. https://t.co/oymfsDZVnm"}, {"text": "Congrats to the World Champion @Nationals and their fans! A great group that always showed up when it counted and was never afraid to show a little joy: dancing in the dugout, laughing, believing, and always sticking together. A true team with a spirit that’d do us all well."}, {"text": "Today’s the first day of open enrollment on https://t.co/ob1Ynoesod, and high-quality coverage might be more affordable than you think. Nearly 9 in 10 https://t.co/ob1Ynoesod customers qualify for financial help—so if you or someone you know needs insurance, #GetCovered today."}, {"text": "Proud to endorse an outstanding group of Virginia Democrats in Tuesday’s election—candidates who’ll not only advance the causes of equality, justice, and decency, but help ensure that the next decade of voting maps are drawn fairly. That’s good policy—and good for our politics. https://t.co/IljmKBq7Gm"}, {"text": "Proud of all the Americans who showed up to vote yesterday, electing a set of hopeful, forward-thinking leaders primed to protect Medicaid, draw fair voting maps, and reduce gun violence. A great night for our country—one that’ll leave a lasting legacy."}, {"text": "No one says it better than @MichelleObama — the Obama Presidential Center coming to the South Side isn't for us, it's for the community and the next generation of leaders. https://t.co/aHHeNvAisn"}, {"text": "This Veterans Day, here’s a moving portrait of the extraordinary resilience of my friend Cory Remsburg, an Army Ranger I’ve come to know over the years. It’s an honest tribute to all those wounded warriors and their families who give so much to our country https://t.co/rBAMNk0zvb"}, {"text": "Stories like this are a reminder of our duty, as a country and as Americans, to support every veteran—not only in words, but in deed. To every veteran out there, thank you. We’re forever in your debt."}, {"text": "Proud to see Oluwaseun @AyodejiOsowobi in this list. She’s an @ObamaFoundation Leader who’s organizing young people in Nigeria to help end sexual violence, and her work embodies what our foundation is all about: passing the baton to the next generation. https://t.co/JSkUnRtaoD"}, {"text": "Young leaders like these are powering the promise of the Asia Pacific region. Michelle and I couldn’t be more impressed by their initiative. Can’t wait to join them in Malaysia next month. https://t.co/jrure7D6Uv"}, {"text": "Take a look at this piece to understand the very real consequences of gerrymandering. In Asheville, NC, we see what happens when district lines are drawn for maximum partisan advantage: It mean citizens’ voices are diminished. It means more polarization. https://t.co/CLBQLPfTsu"}, {"text": "Politicians shouldn’t be picking their voters. Voters should be picking their representatives. But unless we act, the status quo will remain in states all across the country. Let's make sure maps are drawn fairly when redistricting happens again in 2021: https://t.co/Pi2gd2B4bv"}, {"text": "Before arguing with friends or family around the Thanksgiving table, take a look at the science behind arguing better. And it'll never hurt to try this: \"Listen to people, get them to think about their own experience, and highlight your common humanity.\" https://t.co/AZC9kpqoqx"}, {"text": "Today, we give thanks for our blessings, give back to those around us, and enjoy some time — and turkey, and maybe a little football — with the ones we love. From the Obama family to yours, Happy Thanksgiving. https://t.co/GEZSGaNSGe"}]