[{"text": "@Erdayastronaut @goathobbit Wearing black not recommended https://t.co/lqoBFTeMX2"}, {"text": "@Erdayastronaut @goathobbit Testing a possible Starship windward side ceramic tile. Maximizing emissivity is best for conductive/particle heating. Nice thing about steel is that tiles can be very thin, unlike carbon fiber or aluminum airframe."}, {"text": "@Erdayastronaut @goathobbit Thin tiles on windward side of ship &amp; nothing on leeward or anywhere on booster looks like lightest option"}, {"text": "@SpaceXUpdates Pc (chamber pressure) high due to colder than expected propellant"}, {"text": "Dr. Livingstone, I presume? https://t.co/aV8t3s6nIz"}, {"text": "@SpaceX Launch underway"}, {"text": "@CathieDWood @ARKInvest Probably 1/4 to 1/2 of that capacity would be for stationary storage"}, {"text": "@robbystarbuck @Tesla Good point. Getting fixed …"}, {"text": "@robbystarbuck @Tesla Btw, you can schedule service via the Tesla app in less than a minute"}, {"text": "Starhopper flight successful. Water towers *can* fly haha!!"}, {"text": "@engineers_feed 200m hop in a week or two"}, {"text": "@bcart03 @engineers_feed Yes"}, {"text": "Engine cam https://t.co/3cWHU50353"}, {"text": "@yousuck2020 Thanks!"}, {"text": "Drone cam https://t.co/gVdMrMgUZq"}, {"text": "Encounter in 88 https://t.co/18ohUrtGQe"}, {"text": "Frank Frazetta"}, {"text": "@GooseWayneYT Space fairies are real"}, {"text": "@Tesla Cuphead for Tesla coming out in August"}, {"text": "@danywhite11 @Tesla Will run v high res at 60 fps. Cuphead doesn’t need 4k."}, {"text": "@lister6520 @neiltyson And those who weren’t expecting a ternary joke"}, {"text": "@flcnhvy @Tesla Unity port is done, so finessing the controls now. Mostly limited by local storage. Will allow additional game storage via USB. Whatever’s most fun!"}, {"text": "@EvaFoxU @flcnhvy @Tesla Yes, really enjoyed it, although wish she’d made it up to sky city"}, {"text": "Ability to stream YouTube &amp; Netflix when car is stopped coming to your Tesla soon! Has an amazingly immersive, cinematic feel due to the comfy seats &amp; surround sound audio."}, {"text": "When full self-driving is approved by regulators, we will enable video while moving"}, {"text": "@ktoddstorch Yeah, feels just like an old school drive in movie experience, but with much better sound"}, {"text": "@TesLatino Maybe August, not more than a few months"}, {"text": "@JeremyGreenlee @TesLatino We’re close, but the magic is in the final details. Maybe 2 to 3 months."}, {"text": "@AndrewMayne Can’t you just play though phone Bluetooth?"}, {"text": "@DMC_Ryan Yes, V10 will include several games &amp; infotainment features, improved highway Autopilot, better traffic light &amp; stop sign recognition &amp; Smart Summon"}, {"text": "@eugenelee3 @DMC_Ryan Not currently in V10, but will try"}, {"text": "@ATAT137 @DMC_Ryan Some"}, {"text": "@jgrano305 @DMC_Ryan Yes"}, {"text": "@annerajb @ATAT137 @DMC_Ryan If not immediately, will be followed shortly in a point release"}, {"text": "@schristakos @jgrano305 @DMC_Ryan Hoping to get “Joe Mode” into V10. The default, of course, is normal volume, but selecting “Joe Mode” would lower the volume of strident beeps &amp; chimes by half."}, {"text": "@redmor11 @schristakos @jgrano305 @DMC_Ryan Will recognize &amp; read all signs for FSD. Focused on traffic lights &amp; stop signs right now. Most are very easy. Difficulty is millions of corner cases."}, {"text": "@cleantechnica Tesla Service Centers &amp; a lot more Superchargers coming to Poland later this year"}, {"text": "@justpaulinelol @schristakos @jgrano305 @DMC_Ryan Depends on how release to owners with early access goes, but hopefully wide release by end of August"}, {"text": "@teslaownersSV Haha probably true (sigh)"}, {"text": "@jakekornegay15 Sure"}, {"text": "@thetaylorcav @Tesla We’re working on it. Agreed, Minecraft is high priority. Roblox too."}, {"text": "Tesla owners can schedule service appointments in under a minute just using their Tesla phone app!"}, {"text": "@Jennerator211 System automatically selects between mobile service &amp; service center appointment. Say prefer mobile in comments to bias. We will add a check box for mobile preferred."}, {"text": "@Some1gee Vehicle alert seen show up automatically &amp; enable single touch request for service for that item either from the car screen or mobile app"}, {"text": "@13arm13arm @simonhackett You can"}, {"text": "@DannyMekic @DaveMaasland Thanks for letting me know"}, {"text": "Falcon 9 piercing the sound barrier on reentry https://t.co/pMkBaeHVqT"}, {"text": "Now that Hopper has flown, Starship update probably in two weeks or so."}, {"text": "Falcon rocket reentry from space with double sonic booms https://t.co/6DDPjcOgQH"}, {"text": "@Jason Thanks Jason! Super proud to work with such great teams at SpaceX, Tesla, Neuralink and Boring!!"}, {"text": "Tesla Megapack now available for utility-scale energy storage https://t.co/MQMgMkFfNm"}, {"text": "@DMC_Ryan Spooling up production line rapidly. Hoping to manufacture ~1000 solar roofs/week by end of this year."}, {"text": "@SciGuySpace Ancient times …"}, {"text": "@JaneidyEve @SciGuySpace Never thought we’d make it this far"}, {"text": "@SciGuySpace Mailing Dragon dock with Space Station is much harder than docking with our own ship for refilling. Not a problem."}, {"text": "@SciGuySpace Depot haha"}, {"text": "@rahulsood @Tesla Fixing …"}, {"text": "@SciGuySpace Orbital refilling is vital to humanity’s future in space. More likely spacecraft to spacecraft (as aircraft do aerial refueling), than a dedicated depot, at least at first."}, {"text": "@Yashwanthnadal I’m told import duties are extremely high (up to 100%), even for electric cars. This would make our cars unaffordable."}, {"text": "@hi__hassan Not sure. Will check with my team."}, {"text": "@TeslaClubIN @Yashwanthnadal For other countries, we pay in part for the local factory by selling cars there ahead of time. Also, gives a sense of demand. Current rules in India prevent that, but recent changes in sales tax give hope for future changes."}, {"text": "Fates loves irony https://t.co/T9sMcivKGK"}, {"text": "@DrAlahbabi @Space_Station @SpaceX @NASA @esa @roscosmos @csa_asc @JAXA_en @ISS_CASIS @ISS_Research You’re most welcome!"}, {"text": "@LobbycastGeoff @teslamodel3fan @Tesla Good idea"}, {"text": "@vincent13031925 Will also be launching The Boring Company China on this trip"}, {"text": "@sara_boutall @vincent13031925 Yes"}, {"text": "@EvaFoxU @SpaceX That was our last chance to reach orbit. If it had failed, SpaceX would have died."}, {"text": "@justpaulinelol @EvaFoxU @SpaceX August 24th, either at Cape Canaveral or Boca Chica"}, {"text": "@Tesla Also, you can request any service from the Tesla phone app in under a minute"}, {"text": "@Lindowitz @Tesla Sure"}, {"text": "@Sofiaan @Lindowitz @Tesla Ok, will discuss with team"}, {"text": "@justpaulinelol @EvaFoxU @SpaceX Relief"}, {"text": "@SIMOZT1 @justpaulinelol @EvaFoxU @SpaceX I would’ve been bankrupt too. Unlikely investors would have funded a second attempt."}, {"text": "@JaneidyEve @justpaulinelol @EvaFoxU @SpaceX Very convincing! Ok, Boca it is. We should have Starship Mk1 with 3 Raptors almost ready to fly by then."}, {"text": "@NASA @NASAJuno We are tiny"}, {"text": "@SciGuySpace Yes, detailed review of the first orbital Starship, explaining the pros &amp; cons of each design decision"}, {"text": "@newscientist I dare say that 🐝 could use a nice 🎩 https://t.co/3NPn1dmUXj"}, {"text": "@newscientist The lost art of entomological haberdashery &amp; millinery …"}, {"text": "@keatonmiller93 @newscientist Oh my, what a dashingly handsome hat you have!"}, {"text": "🐝 all u can 🐝"}, {"text": "@PatrickLac007 It finally almost doesn’t suck"}, {"text": "I ♥️ Top Hat \nhttps://t.co/IcrlCErQWW"}, {"text": "@acflores91 True"}, {"text": "Fred Astaire &amp; Ginger Rogers👌"}, {"text": "A US 🐝 https://t.co/WEvAwY465n"}, {"text": "@SamiKandell Yes"}, {"text": "@banQuo__ Mad skillz"}, {"text": "@isacan2358 It’s about time I suppose"}, {"text": "His name is Eric, of course"}, {"text": "@SteveH8960 philosophically"}, {"text": "@flcnhvy That is a great guide 👍"}, {"text": "@padgeuk Will Dojo to be the difference"}, {"text": "@tenormasta @flcnhvy The best guide by far!"}, {"text": "@IamEvilVictor It’s all about branding https://t.co/C4uMF5cCdC"}, {"text": "“am … 🐝 guity” 🧐"}, {"text": "@senjam777 @baconmashwbs Workin on it. One of my boys maybe gonna make this here candy."}, {"text": "Teletub 🐝 https://t.co/Vj4xtIyQ5S"}, {"text": "Queen 🐝 https://t.co/InE4OIu9kL"}, {"text": "@SciGuySpace Progress is accelerating"}, {"text": "@janvesp @SciGuySpace Yes"}, {"text": "Lyft/Uber/taxi drivers are expert Tesla advocates. Thanks for your support!!\n https://t.co/coIzNY5QOO"}, {"text": "Just left Starship Texas build site. Very proud of progress SpaceX team has made! Pics are of 9m dome rotation &amp; Starship airframe behind windbreak. https://t.co/1cmOzkPlkn"}, {"text": "Headed to Starship Cape Canaveral build site today"}, {"text": "@cleantechnica So much drama &amp; good times too! Maybe worth a book one day, but would come at expense of 🚀 &amp; 🚘 &amp; 🧠."}, {"text": "Great progress by Starship Cape team. Started several months behind, but catching up fast. This will be a super fun race to orbit, moon &amp; Mars!"}, {"text": "@ShorealoneFilms Vandenberg is great for polar orbits. Will still play an important role long-term, but 80%+ will be eastward."}, {"text": "@kulpability No"}, {"text": "@HarryStoltz1 @ShorealoneFilms Not in current plans, but that may change"}, {"text": "@HarryStoltz1 @ShorealoneFilms Details coming at Starship update"}, {"text": "@Erdayastronaut Race to orbit by both teams, although a success by both in close proximity would be amazing &amp; each would count as a win"}, {"text": "Hoping to catch the fairing in a few mins https://t.co/JZSkfQnItX"}, {"text": "Fairing caught, video posting soon"}, {"text": "Rocket fairing falls from space &amp; is caught by Ms Tree boat https://t.co/nJv0Ry1iKk"}, {"text": "And @JayLeno really knows cars! https://t.co/QN3x0UzP4v"}, {"text": "Rocket fairing falling from space (higher res) https://t.co/sa1j10qAWi"}, {"text": "@Erdayastronaut Sure"}, {"text": "🎶 Strangers in the Night 🎶\nhttps://t.co/9ZURElJxJQ"}, {"text": "@bluemoondance74 @Erdayastronaut Ok"}, {"text": "@Sofiaan @IIHS_autosafety @atj721 Well said!"}, {"text": "@HarryStoltz1 @Sofiaan @IIHS_autosafety @atj721 Good question. NHTSA is great for fundamental structural safety, except for unbelted front passenger occupant factor. Very rare these days for front passenger to be unbelted. NCAP also great, but there are some weird headlight angle factors. Super inside baseball stuff …"}, {"text": "@HarryStoltz1 @Sofiaan @IIHS_autosafety @atj721 Ultimately, however, what really matters is empirical safety. Nothing in life is 100% safe, so optimal figure of merit is how many millions of miles/km per accident."}, {"text": "@cleantechnica But actual road data is what matters most https://t.co/q44lsjJZZa"}, {"text": "@brunosilva @vincent13031925 @ResidentSponge @Teslarati @Tesla We’re working with EU regulators to improve rules. Spirit of rules is correct, but exact language doesn’t quite align with spirit. Navigate on Autopilot working well in rest of world."}, {"text": "Thanks George! https://t.co/ccWYz9FqhH"}, {"text": "@Teslarati Wouldn’t read too much into this. Likely to be fewer F9/FH flights, but possibly an order of magnitude more than these numbers in Starship flights."}, {"text": "@JaneidyEve @Teslarati No sooner than a week. Working approvals with FAA."}, {"text": "@vincent13031925 Yeah, George is a little nuts, but I like him &amp; he often has interesting things to say"}, {"text": "@DisruptResearch @vincent13031925 Don’t know enough about George’s company, but it sounds like he’s focused on a machine vision approach, which is the only general solution imo"}, {"text": "@marialauraadr @vincent13031925 Pot kettle 😀"}, {"text": "@greenenergyluv @cleantechnica 🤔"}, {"text": "Tesla software V10 is lookin real good! Releasing to early access list soon …"}, {"text": "@Some1gee Tons of fun!"}, {"text": "@bobjouy Thanks for reminding me. Will rectify."}, {"text": "@joost_akker @bobjouy FSD owners will get priority in the upload queue"}, {"text": "@HeyMarkL Video is amazing with the Tesla sound system. Will include Caraoke!"}, {"text": "@Kristennetten @joost_akker @bobjouy Probably every 2 to 4 months, depending on how much progress we make"}, {"text": "@DavidPereiro @Kristennetten @joost_akker @bobjouy We’re accelerating opening up configurator/order page for more countries. Sorry, lot on our plate!"}, {"text": "@chiledaniel Priority / early access will be automatic for all owners with FSD"}, {"text": "Gas cars are so last-century! https://t.co/jrfrXjbLeZ"}, {"text": "@justpaulinelol Might take a bit longer to get through regulatory approvals. Likely September."}, {"text": "@Erdayastronaut Yup"}, {"text": "@Erdayastronaut For sure"}, {"text": "@Erdayastronaut Amazing work over many years by SpaceX engineering/production/launch teams to get (almost) there"}, {"text": "@marstronauts @Erdayastronaut Between $100B and $10T"}, {"text": "@TTVBaconz @Tesla Yes"}, {"text": "@Tesla Powerwall doesn’t need solar panels, but will work fine with both Tesla &amp; non-Tesla solar panels"}, {"text": "@ajtourville @marstronauts @Erdayastronaut Approx min payload to Mars to nearest order of magnitude, so at $100k/ton, cost would be $100B"}, {"text": "@Erdayastronaut @SpaceX Thanks. Starship, which aspires to be fully &amp; immediately reusable in super heavy class, is a truly 🥜🚀. Even though I’m immersed in Starship/Raptor design &amp; build 7 days/week, it still doesn’t feel real."}, {"text": "@bluemoondance74 @Erdayastronaut @SpaceX Just spoke with FAA, so hopefully yes"}, {"text": "@EcoHeliGuy @marstronauts @Erdayastronaut Will be needed for sure. Bandwidth, no problem, latency is a challenge 🤣🤣"}, {"text": "@slashdot Because our universe is actually a microverse in a miniverse. We probably just power someone’s brake lights. https://t.co/0jgPXfsRpJ"}, {"text": "Passing fad. Like steam engines. They look cool in a museum."}, {"text": "@SteveHamel16 @slashdot When Opportunity knocks …"}, {"text": "@HardcoreHistory I support Yang"}, {"text": "@HardcoreHistory He would our first openly goth president. I think this is very important."}, {"text": "@HarryStoltz1 @HardcoreHistory Obviously needed"}, {"text": "Watching a movie on Tesla V10.0 is great, in large part due to the sound system https://t.co/7Qh2iHEn8i"}, {"text": "@GrizzlyAustin @Tesla No plans to introduce air suspension on Model 3 at this time"}, {"text": "@danielinhodu83 Working on upgrades to Sentry …"}, {"text": "Try playing Powerglide in your Tesla at volume 11 https://t.co/FCDc6wYvIr"}, {"text": "@tesla_truth Possibly two weeks"}, {"text": "@Kristennetten @tesla_truth Ok"}, {"text": "@C3LT_Games Roughly"}, {"text": "No but srsly don’t do it https://t.co/6kXAdGwWsC"}, {"text": "@acf3301 True"}, {"text": "heh heh https://t.co/UbHul2wgjM"}, {"text": "@justpaulinelol 🤣"}, {"text": "fyi https://t.co/6ZRMDvAS19"}, {"text": "@JaneidyEve @SpaceX Not yet"}, {"text": "Corporate Surrealism™️"}, {"text": "@chadsmith @Tesla We’ll take care of it"}, {"text": "@dbabrams @BangOlufsen Tesla audio engineers come from B&amp;O &amp; many other companies. They literally rōq. Our system is highly programmable, so we keep improving it via OTA codec updates."}, {"text": "@Inelonwetrust__ @dbabrams @BangOlufsen Coming"}, {"text": "@CazzRS Stop posting my password on twitter!"}, {"text": "@ThePhoenixFlare @CazzRS That was my actual password at one point!"}, {"text": "@flying_briann @SciGuySpace Stacking fairing &amp; tanks soon, then adding control fins, engines &amp; landing gear"}, {"text": "@SpacePadreIsle @SciGuySpace Am talking to @FAA in a few hours"}, {"text": "@SpacePadreIsle @SciGuySpace @faa Good conversation with head of FAA Space. Need a bit more hazard analysis &amp; should be clear to fly soon."}, {"text": "@arctechinc This isn’t correct. Will address."}, {"text": "Nuke Mars!"}, {"text": "@Trailblayzer_ I’d play that game"}, {"text": "@Trailblayzer_ Guess I sort of am already"}, {"text": "T-shirt soon"}, {"text": "@nichegamer Of course!"}, {"text": "@flcnhvy It’s not boring …"}, {"text": "Hey babe, fancy a hot date …? 😉 @4thFromOurStar"}, {"text": "Trust me, it will be 🔥🔥"}, {"text": "@41Strange Simulations all the way down"}, {"text": "Nuking Mars one T-shirt at a time https://t.co/Kiah2HbxFi"}, {"text": "@HarryStoltz1 @41Strange No, as better to vary thickness with vehicle height, but this is the right way to go for Boring Co tunnels reinforcement imo"}, {"text": "https://t.co/NLzW87AZC0"}, {"text": "Hashtags are an abomination"}, {"text": "Perhaps that one was too edgy …"}, {"text": "@mayemusk Stop hashtagging me 🤣"}, {"text": "@ItsJoshPeck Yeah, the trick is opening &amp; closing the spacesuit helmet really fast"}, {"text": "Not saying it solves everything, mind you, but it’s a step in the right direction"}, {"text": "@Epic2662 Yes"}, {"text": "The sun is an immense thermonuclear explosion fyi"}, {"text": "@nadavision Aspirationally, decades"}, {"text": "@nadavision Meaning less than a century. But this would be pretty intense."}, {"text": "@jasonemry It is quite silly"}, {"text": "Generates a *lot* of energy https://t.co/k5nUWFb8iM"}, {"text": "@WorldAndScience Yeah, legs are hydraulic pistons &amp; abdomen is the accumulator"}, {"text": "@flcnhvy @WorldAndScience In a few years"}, {"text": "1 Gigawatt per square kilometer of solar energy reaches Earth’s surface"}, {"text": "Which means a small corner of Texas  (or anywhere) with solar panels could power the entire United States"}, {"text": "Tesla Solar just relaunched. Lmk what you think … https://t.co/mDoPO17YB9"}, {"text": "With the new lower Tesla pricing, it’s like having a money printer on your roof if you live a state with high electricity costs. Still better to buy, but the rental option makes the economics obvious."}, {"text": "@flcnhvy Next year"}, {"text": "One click to order solar &amp; save ~$500/year in utility bills with no long-term contract (cancel anytime)"}, {"text": "@justpaulinelol Don’t know yet, but it’s important that the whole world transition to sustainable energy, so we’ll make costs as low as possible"}, {"text": "Great name! Wouldn’t worry about this particular one, but a big rock will hit Earth eventually &amp; we currently have no defense. https://t.co/XhY8uoNNax"}, {"text": "Converts about 5 million tons of mass to energy every second"}, {"text": "Cookie decorating contest with kids https://t.co/tP06cr4Af5"}, {"text": "@JalaniShreyansh Um I ate most of it"}, {"text": "@royalsociety 🤣🤣"}, {"text": "@SciGuySpace This is a great idea"}, {"text": "@flcnhvy @SciGuySpace Not yet"}, {"text": "@Teslarati Looking forward to seeing Giga Shanghai soon 😀 Amazing work by Tesla China team &amp; support of authorities much appreciated!"}, {"text": "@teslaownersSV @Teslarati Initially Model 3, later Y"}, {"text": "@MemesOfMars @Teslarati @ray4tesla Yeah, would be great to get feedback from Tesla supporters"}, {"text": "@SciGuySpace @hover389 AF certification required an enormous amount of work. It’s mostly design-review based, not flight-based."}, {"text": "Might make sense to have thousands of solar reflector satellites 🛰 to warm Mars vs artificial suns (tbd)"}, {"text": "@eatinggaming94 @4thFromOurStar 🤣🤣"}, {"text": "@ThePhoenixFlare Trickier than it may seem on Mars, as atmospheric density is 1% that of Earth &amp; gravity is 38%, but doable for localized warming"}, {"text": "@HarryStoltz1 @ThePhoenixFlare Will be converted to Raptor vertical test stand"}, {"text": "@JaneidyEve Will probably make sense to do this when Starship Mk 1 has 3 Raptors, moving body fins &amp; landing gear installed, which is hopefully mid September"}, {"text": "Nuke Mars refers to a continuous stream of very low fallout nuclear fusion explosions above the atmosphere to create artificial suns. Much like our sun, this would not cause Mars to become radioactive."}, {"text": "@wingod @DJSnM @ThePhoenixFlare True, diverting a comet would be super hard. Could be done with small asteroids &amp; a mass driver, but this is risky."}, {"text": "@justpaulinelol Not risky imo &amp; can be adjusted/improved real-time. Essentially need to figure out most effective way to convert mass to energy, as Mars is slightly too far from this solar system’s fusion reactor (the sun)."}, {"text": "Price increase for Tesla FSD postponed until version 10 with smart summon is in wide release, which is about 4 to 8 weeks away, depending on how early access goes"}, {"text": "@arctechinc Everyone who bought FSD will receive priority/early access"}, {"text": "@universal_sci Wow"}, {"text": "@TeslaTrip @arctechinc We need to complete internal QA testing for safety, which will hopefully be done in about 4 weeks"}, {"text": "@MinimalDuck @Tesla @Teslarati Ok"}, {"text": "@engineers_feed Looks like a wheel of cheese"}, {"text": "@newscientist The Nude Scientisté"}, {"text": "@newscientist 🤣🤣👍👍"}, {"text": "@AKawakbi @newscientist Tesla is working hard to help stop global warming"}, {"text": "@DKled007 @AKawakbi @newscientist Yes, probably within next 6 to 9 months"}, {"text": "If you’re a utility or public utilities commission, please consider using the Tesla Megapack. Better for the environment &amp; usually lower cost than fossil fuel peaker plants! https://t.co/Ls4IfB0d6a"}, {"text": "@Erdayastronaut @DKled007 @AKawakbi @newscientist Should be soon"}, {"text": "@MartianDays @Erdayastronaut @DKled007 @AKawakbi @newscientist Ok"}, {"text": "@aikisteve We’re working closely with EU regulators &amp; hope to clarify the timeline soon"}, {"text": "Looks like @SpaceX Starhopper flight may be as soon as Monday. FAA support is much appreciated!"}, {"text": "@flcnhvy Agreed, that’s the right future"}, {"text": "@FuzionPlaysTV @teslaownersSV Exactly! Especially let your PUC commissioners/authorities know."}, {"text": "@Erdayastronaut @SpaceX Yes, last flight for Hopper. If all goes well, it will become a vertical test stand for Raptor."}, {"text": "World’s first very large scale battery has worked out well https://t.co/X7gdbL8U5b"}, {"text": "@MarkMeijer10 Where are additional Superchargers most needed?"}, {"text": "@Erdayastronaut @SpaceX It’s quite robust"}, {"text": "@Tesla 😢 https://t.co/kTNomigW3e"}, {"text": "@4thFromOurStar Oh behave u naughty planet … 😉"}, {"text": "@TheOnion Finally, VR that’s cool *and* sexy!"}, {"text": "Starhopper flight currently tracking to 5pm Texas time for 150m / ~500ft hover test"}, {"text": "About 5 mins from flight attempt https://t.co/CWkvsqDQYE"}, {"text": "@SciGuySpace Raptor uses dual redundant torch igniters. Better long-term, but more finicky in development."}, {"text": "Igniters need to be inspected. We will try again tomorrow same time."}, {"text": "@teslaownersSV Appears to be a wiring/connector issue"}, {"text": "@cleantechnica ♥️♥️♥️"}, {"text": "@MemesOfMars @cleantechnica Hopefully next year"}, {"text": "@Teslarati Impressively accurate analysis!"}, {"text": "@PPathole @Teslarati Yes, rather embarrassing tbh"}, {"text": "@HarryStoltz1 @PPathole @Teslarati Not that I know of"}, {"text": "@WorldAndScience Interesting"}, {"text": "Dronship with wings folded traveling through Panama Canal https://t.co/TawM5Ntj0e"}, {"text": "Dragon Crew Arm. Astronauts will walk this gantry to enter Dragon &amp; depart for the @Space_Station. https://t.co/rKkUTeHson"}, {"text": "About to do next Starhopper flight test https://t.co/eeXPQPk7t6"}, {"text": "Congrats SpaceX team!! https://t.co/duckYSK0D4"}, {"text": "One day Starship will land on the rusty sands of Mars https://t.co/EfENYVdOzM"}, {"text": "@cleantechnica Empty article?"}, {"text": "R2D2’s Dad"}, {"text": "@SpaceX Core body diameter is 9m/30ft"}, {"text": "@justpaulinelol @SpaceX Can’t believe it’s been 6 years since our first vertical landing!"}, {"text": "Also, u can order online at https://t.co/46TXqRJ3C1 in 2 mins, have car delivered to ur doorstep &amp; return for full refund https://t.co/OTAPpYMdcH"}, {"text": "@mralbertsun Should be. Will fix."}, {"text": "@_IAMOtis Would love to, but import duties are extremely high, even for electric vehicles"}, {"text": "@Freiraum77 @SpaceX Probably 18m for next gen system"}, {"text": "@flcnhvy @Freiraum77 @SpaceX Probably 2 to 3 months. We’re about to ship Raptor SN 10."}, {"text": "@JaneidyEve @flcnhvy @Freiraum77 @SpaceX Aiming for 20km flight in Oct &amp; orbit attempt shortly thereafter. Starship update will be on Sept 28th, anniversary of SpaceX reaching orbit. Starship Mk 1 will be fully assembled by that time."}, {"text": "@HjorturBrynjars @enn_nafnlaus @Tesla Very soon, sorry for the delay"}, {"text": "@PatrickMJanson 🇮🇸 Iceland 🇮🇸 for sure!"}, {"text": "@Model3Owners @Tesla Yes"}, {"text": "@WadeAndersonPT @Tesla Coming soon. Version 10.1 at latest."}, {"text": "@tesla_truth Exactly"}, {"text": "https://t.co/tndaPd6d8z https://t.co/G98dOzgWTv"}, {"text": "@vincent13031925 So good!"}, {"text": "Haha actually true https://t.co/VNB822fpPT"}, {"text": "@fermatslibrary Slowpoke! Didn’t even finish his hypothesis …"}, {"text": "@HjorturBrynjars @Tesla Opening on 9/9"}, {"text": "Try Tesla Insurance. Should be ~20% less than avg. Currently only in California, but expanding soon. Critical feedback much appreciated. https://t.co/L8xv8vxllj"}, {"text": "@tesla_truth Definitely"}, {"text": "@coolsilver @Tesla Yes"}, {"text": "@teslaownersSV @tesla_truth Yup"}, {"text": "@flcnhvy @coolsilver @Tesla Both 🍀 and 😋 buttons in V10.0"}, {"text": "@Sofiaan @flcnhvy @coolsilver @Tesla Yeah, several. Smart Summon most significant."}, {"text": "@ElecVehicleGuy @Tesla Anywhere insurance prices are high"}, {"text": "@konrad_bilinski Gasoline is designed to burn"}, {"text": "@nichegamer Nice"}, {"text": "@Tesla In close traffic, poisonous gas spewing from the car in front of you goes straight into your AC intake. Good thing gas/diesel carmakers didn’t cheat on their emissions or we’d be in real trouble 😅"}, {"text": "@justpaulinelol @Tesla Same, except where limited by EU regulations. We’re aware of extreme consumer unhappiness about this &amp; are working with EU regulators to address."}, {"text": "@thbo It’s up to 🇳🇴 &amp; 🇳🇱 as to whether they go with EU rules or rest of world. Not our choice."}, {"text": "@TeslaTrip Still too buggy to be in wide EAP. Requires more testing. Hopefully, going to wide EAP next week."}, {"text": "@WillyTHodgkins Yes, and it ♥️♥️♥️ irony"}, {"text": "@ethelreddy1 @Tesla Looking into it"}, {"text": "Um @Porsche, this word Turbo does not mean what you think it does"}, {"text": "@Michael7Striker @Porsche 🤣🤣"}, {"text": "@Jalopnik @Porsche Jalopnik not sharpest tool in shed …\nhttps://t.co/6MeFDpotrB"}, {"text": "@Jalopnik @Porsche Also, cars are called “automobiles”"}, {"text": "Model S on Nürburgring next week"}, {"text": "@Kristennetten @Jalopnik @Porsche 🤔"}, {"text": "@RationalEtienne @florindoc2003 @Kristennetten @Jalopnik @Porsche In some of those, I’m even funny"}, {"text": "@HarryStoltz1 @RationalEtienne @florindoc2003 @Kristennetten @Jalopnik @Porsche Legs, but this render isn’t accurate"}, {"text": "@nabz713 🤗"}, {"text": "@MrRozanov @belpartisan Uh no"}, {"text": "@NewsfromScience A Neuralink could increase this by several orders of magnitude"}, {"text": "@newscientist 😲"}, {"text": "@newscientist Sounds sweaty https://t.co/tcR4zLra3Z"}, {"text": "But Taycan does seem like a good car. Nürburgring track time is great."}, {"text": "Tesla doing laps at Nerdburgering https://t.co/G7dYVS1Jpn"}, {"text": "@Eljaboom We’re almost there"}, {"text": "@vincent13031925 @Eljaboom November most likely"}, {"text": "@tesla_truth @Tesla 10 years ago …"}, {"text": "@teslaownersSV @tesla_truth @Tesla Wanted to build an electric car company in college. Was going to do PhD at Stanford in electric energy storage (ultracaps), but got distracted for a few years by the Internet."}, {"text": "@HarryStoltz1 @teslaownersSV @tesla_truth @Tesla For sure on first crewed missions for exactly that reason"}, {"text": "@Gfilche @teslaownersSV @tesla_truth @Tesla 🥳"}, {"text": "@brandonbernicky @Gfilche @teslaownersSV @tesla_truth @Tesla Looking good. Smart summon is almost great. Drive-in theater mode, caraoke &amp; Cuphead are awesome."}, {"text": "@annerajb @brandonbernicky @Gfilche @teslaownersSV @tesla_truth @Tesla Merging code branches &amp; one more QA-level release this week. Hopefully, EAP wide release week after."}, {"text": "@IvanEscobosa @annerajb @brandonbernicky @Gfilche @teslaownersSV @tesla_truth @Tesla No, probably V10.1"}, {"text": "@flcnhvy @annerajb @brandonbernicky @Gfilche @teslaownersSV @tesla_truth @Tesla We might be in one right now"}, {"text": "@nico_rosberg Thanks for offering! Sure, that would be great."}, {"text": "@RenataKonkoly @HarryStoltz1 @teslaownersSV @tesla_truth @Tesla Yes"}, {"text": "@chandanudawat Very exciting to see India’s rapid progress in space! There are always setbacks, of course, but I think India is doing great overall."}, {"text": "@AWintersong Definitely for Space Force. We need to make Starfleet real."}, {"text": "For the remainder of September, Tesla is permanently waiving the $1500 solar removal fee requirement. Note, the ability to stop monthly payments at any time remains."}, {"text": "Without the removal fee, Tesla Solar is unequivocally a guaranteed, instant money printer, producing $300 to $1000 per year (in after tax income!)"}, {"text": "Also https://t.co/LTX4acsgAS"}, {"text": "@RenataKonkoly Offer me money, offer me power … https://t.co/zwcLa89cGR"}, {"text": "Hadouken!! https://t.co/gN915jdvsl"}, {"text": "@meamZ_MZ @widespreadcha0s @HeyMarkL @Tesla Over time, it will be 100% sustainable"}, {"text": "@WorldAndScience It’s not"}, {"text": "@flcnhvy @WorldAndScience Sounds about right"}, {"text": "Why aren’t more people talking about this!? https://t.co/iUFIBcDQrp"}, {"text": "@MikeHudema @GretaThunberg Wow cool"}, {"text": "Probability that we’re in base Polytopia is highly unlikely - KWM"}, {"text": "@tarimnazmi Definitely"}, {"text": "@dStanca Hoping to open in Romania soon!"}, {"text": "@EvaFoxU Deep lore"}, {"text": "And flights of angels sing thee to thy rest https://t.co/Vh1L7hv2dW"}, {"text": "@flcnhvy @tarimnazmi Ceres, Callisto, Ganymede &amp; Titan"}, {"text": "@justpaulinelol Actually true"}, {"text": "@Erdayastronaut @flcnhvy @tarimnazmi For sure"}, {"text": "@Erdayastronaut @KevinKling12 @DJSnM @spaceXcentric Sea level Raptor’s vacuum Isp is ~350 sec, but ~380 sec with larger vacuum-optimized nozzle"}, {"text": "@EvaFoxU @justpaulinelol @flcnhvy @tarimnazmi Photoshop is amazing"}, {"text": "@SpaceXFan97 @Erdayastronaut @KevinKling12 @DJSnM @spaceXcentric Most likely"}, {"text": "@Erdayastronaut @KevinKling12 @DJSnM @spaceXcentric Over time, 355 &amp; 385 are possible, but very difficult"}, {"text": "@Erdayastronaut @DJSnM @KevinKling12 @spaceXcentric Raptor turbines can spin up extremely fast. We take it easy on the test stand, but that’s not indicative of capability."}, {"text": "@DJSnM @Erdayastronaut @KevinKling12 @spaceXcentric Not currently planning for pad abort with early Starships, but maybe we should. Vac engines would be dual bell &amp; fixed (no gimbal), which means we can stabilize nozzle against hull."}, {"text": "@flcnhvy @DJSnM @Erdayastronaut @KevinKling12 @spaceXcentric Everything happens so fast. It’s such a different paradigm that applying aircraft concepts to rockets is almost like applying shipping concepts to aircraft. Travels 10,000 km in 30 mins."}, {"text": "@flcnhvy @DJSnM @Erdayastronaut @KevinKling12 @spaceXcentric You know destination weather before departure &amp; there’s no weather in space"}, {"text": "@Erdayastronaut @vicvic21266 @flcnhvy @DJSnM @KevinKling12 @spaceXcentric 🤣🤣"}, {"text": "@Erdayastronaut @DJSnM @KevinKling12 @spaceXcentric Distance from fireball is 0.5*a*t^2, so if t is small, you haven’t moved far even if a is high. At ~6g thrust, you’ll only travel ~0.03m in 100 ms. Pressure wave (aka explosion) with liquid rockets is low, as ox &amp; fuel are poorly mixed. If you can fly out of it, you’re prob ok."}, {"text": "@Erdayastronaut @IvanEscobosa @DJSnM @KevinKling12 @spaceXcentric Precisely"}, {"text": "@Erdayastronaut @JHC2718 @MagnussonMani @vicvic21266 @flcnhvy @DJSnM @KevinKling12 @spaceXcentric Failure rate is actually both higher &amp; lower than that, as the Falcon 9 design has changed almost completely several times. Currently flying version has no failures (may fate continue to be merciful), but older versions therefore have a higher failure rate."}, {"text": "@Teslarati The hex tiles are actually mechanically attached, which is important to allow for very high temp on back side of tile that would destroy any adhesive. Marshmellow-looking thing is a rope seal."}, {"text": "@nate_mccomb @Teslarati 48 61 20 68 61"}, {"text": "@MemesOfMars @Teslarati The mechanical attachment mechanism. We need to make sure they won’t fall off due to vibration &amp; acoustics."}, {"text": "@kierank_ @Teslarati Looks good"}, {"text": "@tesla_truth Exactly"}, {"text": "@C3LT_Games Will be answered on 28th"}, {"text": "♥️♥️🇮🇸🇮🇸 Ísland 🇮🇸🇮🇸♥️♥️ https://t.co/p6eQKDlPUN"}, {"text": "@kimpaquette @Tesla For sure!"}, {"text": "@TheOnion @tim_cook 👍"}, {"text": "obv"}, {"text": "@mortchad @TheOnion I’d love to"}, {"text": "@SamNazarius @mortchad @TheOnion No, but that was an epic piece at a time when the word was being overrun by demented versions of an otherwise delightful jam container. It was like World War Z, but mason jars …"}, {"text": "@flcnhvy @SamNazarius @mortchad @TheOnion Aargh!!"}, {"text": "Getting ready for flight of orbit-class Starship design https://t.co/CtXtq522ia"}, {"text": "DMT FTW https://t.co/DgfQ2teLG2"}, {"text": "@hanktheskank34 @joerogan 🤣🤣"}, {"text": "Model S just set record for fastest 4 door ever at Laguna Seca, video tmrw"}, {"text": "@alistairmilne Model S is already there"}, {"text": "@alistairmilne But we probably won’t try for best lap time this week, as we need to review &amp; tune Model S thoroughly for safety on Nürburgring, especially Flugplatz section"}, {"text": "@nichegamer This could be good"}, {"text": "@flcnhvy @nichegamer Polytopia"}, {"text": "@teslaownersSV @flcnhvy @nichegamer Of course"}, {"text": "@RenataKonkoly @teslaownersSV @flcnhvy @nichegamer Cuphead"}, {"text": "@MKBHD @alistairmilne Next year"}, {"text": "@v_g_fischer @teslaownersSV @flcnhvy @nichegamer A Flock of Bricks"}, {"text": "The only thing beyond Ludicrous is Plaid"}, {"text": "@annerajb No"}, {"text": "@emicimaz Yes. To be clear, Plaid powertrain is about a year away from production &amp; applies to S,X &amp; Roadster, but not 3 or Y. Will cost more than our current offerings, but less than competitors."}, {"text": "@MKBHD Soon"}, {"text": "@Sofiaan @emicimaz Yes"}, {"text": "@flcnhvy @Sofiaan @emicimaz Flux capacitor option package"}, {"text": "@PPathole @flcnhvy @Sofiaan @emicimaz Spaceballs"}, {"text": "@ThePhoenixFlare @PPathole @flcnhvy @Sofiaan @emicimaz All great! ♥️ Mel Brooks"}, {"text": "Model S at Nürburgring has 7 seats"}, {"text": "@JCobrae To carry 7 people"}, {"text": "@kalinizaurus @wylsacom Good point"}, {"text": "@TheOnion The downward spiral …"}, {"text": "@universal_sci Makes it clear that you can only sense acceleration, not velocity"}, {"text": "@Dc_Nawfel @universal_sci v^2/r is fun haha"}, {"text": "@Teslarati Autopilot active crash prevention keeps getting better, as we examine every crash for improvement &amp; then upload smarter software. Ironically, I hope we’re never on the list!"}, {"text": "@justpaulinelol @Dc_Nawfel @universal_sci This is technically a Speedraptor"}, {"text": "@justpaulinelol @Dc_Nawfel @universal_sci A Speedraptor is a Velociraptor with no sense of direction (that’s how you can them apart)"}, {"text": "@Teslarati Ahem https://t.co/AmlTCVSHGZ"}, {"text": "@RationalEtienne @guardian @verge @CNBC @qz @Reuters @nytimes @Jalopnik @NewYorker @business At least they had great cigars 👍 https://t.co/Iqb25rAtBV"}, {"text": "Tesla commercial solar ordering now live at https://t.co/sCkn87vMa9!"}, {"text": "@GaryTheBot_ Yes, that’s exactly what I meant, Gary the Bot!"}, {"text": "@Kristennetten Yes"}, {"text": "@31WA Haha exactly!"}, {"text": "@Wikipedia They used to have butt bellows for blowing smoke up your … along the Thames River in London https://t.co/P8SJGokLY8"}, {"text": "@wonderofscience Sagan was awesome"}, {"text": "@slashdot Personally, I think the universe looks great for 12 billion years, let alone 13.8"}, {"text": "@justpaulinelol @31WA Hopefully, next year"}, {"text": "@Model3Owners Looking into this. A fundamental premise of Tesla is that everyone is offered same terms at same time, ie what you get should never be a function of bargaining."}, {"text": "@Teslatunity @Model3Owners There aren’t really meant to be “Tesla incentives”, just general price changes to reflect optimal value of product, as we sometimes get prices of some variants wrong or need to (partially) address shifts in tax incentives. Overarching principle, however, is same deal for all."}, {"text": "@hoofhrtd1254 @Teslatunity @Model3Owners Going to early access (including all who bought FSD) Tesla owners in US next week. If US early access rollout looks good, then rest of world early access owners following week. Might be some delays in EU for regulatory approval."}, {"text": "@flcnhvy @hoofhrtd1254 @Teslatunity @Model3Owners Agreed"}, {"text": "@Kristennetten @Model3Owners The fundamental operating principle is that prices, while they may change, will change for all equally &amp; should never be a function of bargaining. This is normal for most products, but weirdly not for the auto industry in most parts of the world."}, {"text": "@teslaownersSV @Kristennetten @Model3Owners At end of quarter, there is always some error in product mix allocation between the roughly 40 global regions, due to planning mistakes &amp; logistics problems (Earth is a big place). Small changes in prices are needed to correct local supply/demand imbalances."}, {"text": "@teslaownersSV @Kristennetten @Model3Owners That’s not to say that Tesla people somewhere in the world are being overzealous &amp; possibly overstepping our core principles, which is why I’m looking into it"}, {"text": "@teslaownersSV @Kristennetten @Model3Owners Should note that these product mix &amp; logistics errors also results in regional *undersupply*, eg UK &amp; Ireland right now, but we don’t raise the prices even so. The intent, at any given moment in time, is: heads we lose, tails buyers win."}, {"text": "@TeslaForLife @teslaownersSV @Kristennetten @Model3Owners Exactly! We’ve only one car factory in California &amp; one Gigafactory (for batteries &amp; drive units) in Nevada. Giga Shanghai will do cars, batteries &amp; drive units for the greater China area. Over time, regional Gigafactories will lower costs &amp; improve logistics worldwide."}, {"text": "Good analysis. You can order commercial solar in literally 30 secs if you use Apple Pay at https://t.co/sCkn87vMa9. https://t.co/V1rNPM1Hdk"}, {"text": "However, we won’t customize the contract or engage in negotiations. That just causes the Tesla &amp; customer legal bill to be high &amp; drag things out. Pay for clean power, not lawyers! It makes way more sense."}, {"text": "@GaryTheBot_ Wise words from Gary the Bot"}, {"text": "Thanks Tesla owners. You rock!! ♥️♥️ https://t.co/ATUEfTKYQU"}, {"text": "Joe Mode is the best mode https://t.co/UyvCSTEvNp"}, {"text": "@TheCriticofvg Oh that would be fun. Will see."}, {"text": "@TeslaTested Yes, coming soon"}, {"text": "@annerajb @TeslaForLife @teslaownersSV @Kristennetten @Model3Owners Getting close"}, {"text": "@austinbarnard45 I ♥️ visiting Boca Chica, Brownsville &amp; Texas in general! Thanks for all your support!!"}, {"text": "@DanAloni @TeslaTested That’s what we believe is highly likely"}, {"text": "@flcnhvy @austinbarnard45 🚀♥️ Starship Team ♥️🚀"}, {"text": "@teslamodel3fan Maybe we can buffer enough of it onboard. Will check."}, {"text": "@JaneidyEve @austinbarnard45 Sure, I’m planning on meeting community supporters around the presentation on the 28th. Thanks!"}, {"text": "@justpaulinelol @teslaownersSV @Kristennetten @Model3Owners Service center expansion is at max speed, so yes"}, {"text": "@Kristennetten @EvaFoxU @justpaulinelol @teslaownersSV @Model3Owners I want this T-shirt!"}, {"text": "@wonderofscience Damn …"}, {"text": "@Sofiaan @Kristennetten @EvaFoxU @justpaulinelol @teslaownersSV @Model3Owners Great conversation-starter!"}, {"text": "@Evgeni__Enchev 10.1"}, {"text": "@Teslarati Feeling Lucky (Google tribute!) or Hungry are 100% intended for max enjoyment of Tesla owner. If location has destination chargers, that’s a plus, but car should only route there if location is great. This will be hit &amp; miss initially, but should hone towards excellent over time."}, {"text": "@Model3Owners Absolutely"}, {"text": "Droid Junkyard, Tatooine https://t.co/yACFR9y04P"}, {"text": "Area 51 of Area 51 https://t.co/Du7i92sFaO"}, {"text": "@bonnienorman @Model3Owners They’re available through the app, but we need to make them easier to find"}, {"text": "@BocachicaMaria1 Thanks, I will stop by on the 20th!"}, {"text": "@Teslarati It’s a start. We expect these track times to be beaten by the actual production 7 seat Model S Plaid variant that goes into production around Oct/Nov next year."}, {"text": "@ZainRaz4 @Teslarati No, original 5 forward facing seats plus 2 rear-facing smaller seats. The new rear seats will accommodate larger passengers than before."}, {"text": "@justpaulinelol @Teslarati New Roadster and X will come later"}, {"text": "@flcnhvy @Teslarati Absolutely"}, {"text": "@DanielCardena @Teslarati Rear facing, but roomier. Great for family gatherings! I did a road trip across America with my five boys &amp; Talulah in the 7 seat Model S several years ago."}, {"text": "@teslaownersSV @flcnhvy @Teslarati No, but very close"}, {"text": "@ElonAccessories @teslaownersSV @flcnhvy @Teslarati Actually, Model 3 would beat the Taycan on Nürburgring over multiple laps, as it has more range"}, {"text": "@DMC_Ryan @justpaulinelol @Teslarati Exactly"}, {"text": "@flcnhvy @ElonAccessories @teslaownersSV @Teslarati You never know …"}, {"text": "@TFM312 @Tesla Glad you’re ok!"}, {"text": "@Erdayastronaut Yes"}, {"text": "@PPathole @Erdayastronaut Landing leg frame"}, {"text": "@Wikipedia Apollo"}, {"text": "@28delayslater @Tesla Haha"}, {"text": "@HarryStoltz1 @28delayslater @Tesla A little, but this is mostly a design update for those interested"}, {"text": "@TheOnion Busted"}, {"text": "@Newsweek In other news …"}, {"text": "Told you AI was dangerous!! 🔥💣💦 https://t.co/BBTEYJP0Qz"}, {"text": "@JasonWHansen @Tesla Yes"}, {"text": "@areus Lane offset should be much better in V10.0"}, {"text": "@RationalEtienne @LaurenRow5 Je ne regrette Etienne"}, {"text": "@_jameshatfield_ @RationalEtienne @LaurenRow5 https://t.co/epdlNkjz5k"}, {"text": "Amazingly, this is not an Onion article"}, {"text": "@LilSkoorb Nice"}, {"text": "@annerajb @RationalEtienne @LaurenRow5 L'Ambroisie, Place des Vosges"}, {"text": "@makingnocchi “Smart” Summon will work on all v2.0+ hardware in wide release"}, {"text": "@MFrunker Whoa cool"}, {"text": "@fermatslibrary For some reason, I always loved this formula"}, {"text": "@MemesOfMars @fermatslibrary e^👁🥧 + 1 = 0"}, {"text": "@MemesOfMars @fermatslibrary And of course, this one, but that’s obv https://t.co/UKWYrBwjkZ"}, {"text": "@EvaFoxU @MemesOfMars @fermatslibrary Nice compression"}, {"text": "Electric is the future! Congratulations Daimler!! https://t.co/Zg2VSj4tjO"}, {"text": "@MercedesBenz Very meaningful action by the company that invented the internal combustion engine. People will remember this day. Respect."}, {"text": "@tesla_truth Well said"}, {"text": "@chrisleehawaii @Tesla Much better chess engine coming"}, {"text": "@tesletter @tesla_truth Fixing several minor bugs &amp; a regression in highway driving, so probably early to mid next week"}, {"text": "@itsJayLew @tesletter @tesla_truth No, it’s one integrated release"}, {"text": "@nytimes You have been warned https://t.co/11CHFHUdr1"}, {"text": "@flcnhvy @nytimes That’s what life was like back in 1985"}, {"text": "@tdenton1138 @sciam @GretaThunberg A 16 year old who has better reasoning &amp; more heart than the vast majority of political leaders"}, {"text": "@Teslarati Great work by SpaceX parachute engineering! The Crew Dragon parachutes are way more difficult than they may seem. The Apollo program found them to be so hard that it became a notable morale problem!"}, {"text": "@justpaulinelol @Teslarati Yes"}, {"text": "@TeslaTested @Teslarati Will discuss with my product team next week, but probably"}, {"text": "@TeslaTested @Teslarati Next quarter"}, {"text": "@Robotbeat @justpaulinelol @Teslarati Sure. Have to do it on Mars from beginning. Will ultimately do that on Earth too, so rocket flights will be zero net carbon long-term."}, {"text": "@vincent13031925 @ResidentSponge @Teslarati It’s my 🔥 glasses 😉"}, {"text": "@cleantechnica srsly"}, {"text": "Either way, sustainable energy wins!! https://t.co/13hB5hd2Hc"}, {"text": "@teslaownersSV Thanks!"}, {"text": "Adding the rear moving fins to Starship Mk1 in Boca Chica, Texas https://t.co/HWLihqihph"}, {"text": "@SpaceXFan97 Yes. There’s a huge amount of hardware in the tip of the faring that being integrated on the ground, which is why we haven’t closed it out."}, {"text": "@SpaceXFan97 Nose tip has forward movable fins, cold gas attitude control thrusters, header tanks for landing, composite pressure vessels, several large batteries, etc. Placed up there to balance high mass of Raptors &amp; rear fins at the bottom."}, {"text": "@Erdayastronaut Stability is not an issue with 3"}, {"text": "@Erdayastronaut Stability is controlled by (very) rapid movement of rear &amp; fwd fins during entry &amp; landing, as well as ACS thrusters. The smaller leeward “fin” would simply be used as a leg."}, {"text": "@Erdayastronaut Current analysis, which I’m not fully bought into, suggests that 2 rear fins with separate airframe-mounted legs will be lighter, so this is the plan for Mk1/Mk2"}, {"text": "@Kalzsom @Erdayastronaut For aero control, it comes down to % of cross-sectional area moving vs not. Flexible as to whether front or rear, so long as within bounds of center of mass &amp; pressure."}, {"text": "@CptnCrutch5373 @Erdayastronaut @Kalzsom Approximately correct. We also fire the ACS thrusters to rotate the vehicle &amp; ignite Raptors at full gimbal angle to complete the turn."}, {"text": "@happych19952208 😉"}, {"text": "@Erdayastronaut @CptnCrutch5373 @Kalzsom Super Heavy rocket will be much like Falcon 9, but the Ship is a strange combination of Dragon, F9 &amp; a skydiver."}, {"text": "Just leaving SpaceX Starship build site in Boca https://t.co/Bqt40mSdX4"}, {"text": "Raceway &amp; flap hinge aero covers"}, {"text": "Bottom half of Starship at night. Top half with forward fins &amp; header tanks probably stacks on Wednesday. Three Raptors already installed. https://t.co/haq3m1V1Wm"}, {"text": "@Kristennetten SpaceX Foundry is used exclusively for advanced alloys/shapes for Raptor, incl our superalloy, SX500"}, {"text": "@28delayslater @karpathy Classified as a URO, unidentified road object (from Area 69)"}, {"text": "@flcnhvy @28delayslater @karpathy Ahem … well … um …"}, {"text": "@TeslaMiles @28delayslater @karpathy @Tesla OG Roadster is def helping us out here with 826M miles by itself https://t.co/Pcybhf8jc3"}, {"text": "@Mich41V4294 @flcnhvy @28delayslater @karpathy Hoping to open in Slovakia, Croatia, Serbia &amp; most of Eastern Europe early next year. Finally, we will do Nikola Tesla proud by having his cars in his countries of origin!"}, {"text": "@TheOnion “Between the trees and the forest floor, it’s like a giant mural,” continued the veritable High Priest of the Harvest Season, adding that he would soon have to rake his driveway, an activity for which he will most certainly don a cashmere scarf."}, {"text": "Some secrets are too dangerous to be free https://t.co/g547UdmiJ7"}, {"text": "@JaneidyEve Just sent a note to check"}, {"text": "@bopinion Herbert Diess is doing more than any big carmaker to go electric. The good of the world should come first. For what it’s worth, he has my support."}, {"text": "@Erdayastronaut That’s correct. Essentially controlled falling, like a skydiver."}, {"text": "@flcnhvy @Erdayastronaut Many powerful electric motors &amp; batteries. Force required is enormous, as entire fin moves. More about this on the 28th."}, {"text": "@Erdayastronaut It does actually generate lift in hypersonic regime, which is important to limit peak heating"}, {"text": "@DJSnM Exactly. For reusable heatshield, minimize peak heating. For ablative/expendable, minimize total heat. Therefore reusable like Starship wants lift during high Mach reentry for lower peak, but higher total heat."}, {"text": "@Erdayastronaut Better just to ride your max temp all the way down &amp; let T^4 be your friend. Lower atmosphere cools you down real fast, so not crazy hot after landing."}, {"text": "@OranMaliphant @Erdayastronaut Could do it, but we developed low cost reusable tiles that are much lighter than transpiration cooling &amp; quite robust"}, {"text": "@The_ShadowZone @DJSnM For sure more than one pass coming back to Earth. To Mars could maybe work single pass, but two passes probably wise."}, {"text": "@Teslarati Tesla is building a major engineering team in China, incl heavy focus on software/firmware for factory &amp; car"}, {"text": "@Teslarati This includes original engineering of new factory processes &amp; cars. Great engineers will only join if original engineering is supported, not just localization."}, {"text": "@flcnhvy @Erdayastronaut @Tesla It would be pretty embarrassing to use a non-Tesla battery!"}, {"text": "@justpaulinelol @Teslarati Mostly C/C++, Python &amp; SQL"}, {"text": "@HarryStoltz1 @justpaulinelol @Teslarati Turbo Pascal"}, {"text": "@SamNazarius @HarryStoltz1 @justpaulinelol @Teslarati Almost entirely C++, but we did have an (advanced for the time) client-side Java app for viewing maps &amp; (weirdly) a 3D hockey game in VRML"}, {"text": "@tannerfox Impressive work by Chad &amp; Steve!"}, {"text": "@levie Exactly"}, {"text": "@katlinegrey язык хорошо подвешен"}, {"text": "@EvaFoxU @katlinegrey правда"}, {"text": "@justpaulinelol @EvaFoxU @katlinegrey https://t.co/IzVngWWY7G"}, {"text": "Lifting lower section of Starship https://t.co/bfW17i469a"}, {"text": "On the transporter https://t.co/CGNj1MlKAU"}, {"text": "@Erdayastronaut @kimitalvitie Six. Two windward, one under each fin &amp; two leeward. Provides redundancy for landing on unimproved surfaces."}, {"text": "@Teslatunity @Tesla You’re welcome! Feature requests always appreciated."}, {"text": "@teslaownersSV @Teslatunity @Tesla Absolutely"}, {"text": "@Jennerator211 @Erdayastronaut Mk1 ship is around 200 tons dry &amp; 1400 tons wet, but aiming for 120 by Mk4 or Mk5. Total stack mass with max payload is 5000 tons."}, {"text": "@annerajb @Jennerator211 @Erdayastronaut With rare exceptions, composites would make Starship heavier. They don’t stand up well to high temperatures, but steel does great."}, {"text": "@TeslaGong @teslaownersSV @Teslatunity @Tesla Not sure we could go quite that tight, but we can for sure allow much narrower spaces at user’s discretion"}, {"text": "@Erdayastronaut 50m"}, {"text": "@MarkChica @Kristennetten @TeslaGong @teslaownersSV @Teslatunity @Tesla We could probably do that"}, {"text": "@28delayslater @DJSnM Haha awesome"}, {"text": "@flcnhvy @28delayslater @DJSnM This is quite a complex beast, but hopefully within a month or so"}, {"text": "@Kristennetten @annerajb @Jennerator211 @Erdayastronaut That would be a nice touch"}, {"text": "@Wally_Wests Exactly"}, {"text": "If advanced AI (beyond basic bots) hasn’t been applied to manipulate social media, it won’t be long before it is"}, {"text": "Anonymous bot swarms deserve a closer examination. If they’re evolving rapidly, something’s up."}, {"text": "@moyo5150 More like https://t.co/f8BUlz0Xdo"}, {"text": "Tesla V10.0 just started rolling out to all US Tesla owners with FSD option &amp; “advanced download” selected in vehicle software settings"}, {"text": "@GaryTheBot_ Gary, you rock!"}, {"text": "@justpaulinelol We look for rare corner case issues with a limited release US build, then expand internationally as we receive approval from regulatory authorities. So, soon, but hard to say exactly."}, {"text": "@BrendanCogbill7 About a week. Will include slight improvements, based on initial user feedback."}, {"text": "@SpacePadreIsle @SpaceX Wow, it’s been 5 years since we started at Boca!"}, {"text": "@EvaFoxU @BrendanCogbill7 Always"}, {"text": "Three Raptors on a Starship https://t.co/UrRiD62EVk"}, {"text": "@Erdayastronaut @Cor_SPACE Raptor uses milled copper channels with an inconel jacket all the way down"}, {"text": "@DLoesch Media report was false"}, {"text": "Meanwhile, back in reality https://t.co/NrHHB9G81L"}, {"text": "@GaryTheBot_ Figure of speech"}, {"text": "@Erdayastronaut @Cor_SPACE What blows my mind is that peak pressure in regen chamber &amp; nozzle is *far* above combustion pressure at over 800 bar or ~12,000 psi"}, {"text": "@NCBirbhan @Erdayastronaut @Cor_SPACE Probably around 6 or 7pm"}, {"text": "@flcnhvy @Erdayastronaut @Cor_SPACE No, we’ve been focusing on production (now on SN12). Only need 250 bar or even a bit less for Starship/Super Heavy. Anything above 250 is nice to have &amp; we’ll get around to it, but not needed for flight."}, {"text": "@Erdayastronaut @Cor_SPACE Well, hopefully closer to 300 bar over time. However, that the chamber/nozzle jacket has so many joints &amp; dissimilar metals at such high pressure &amp; temperature is what I find remarkable about it."}, {"text": "@Carter__99 @Erdayastronaut @askingbubble385 @Cor_SPACE Yes"}, {"text": "@Erdayastronaut @Cor_SPACE There’s so much power going through this engine that it’s close to the limit of the known physics of materials in many places"}, {"text": "@flcnhvy @Erdayastronaut @Cor_SPACE Just SX500 so far, but we use many superalloys developed by others, eg Inco 718+. If anyone has 718++, that would be helpful haha. Massive engineering work in the casting, printing &amp; machining of Raptor — far more than in design of the engine itself!"}, {"text": "Summon is improving rapidly \nhttps://t.co/khgXDRnD2Z"}, {"text": "Starship halves being joined https://t.co/7pdxfh8e81"}, {"text": "Starship will allow us to inhabit other worlds"}, {"text": "To make life as we know it multiplanetary"}, {"text": "@tesla_truth @Tesla Precisely"}, {"text": "@tesla_truth Makes sense"}, {"text": "@tesla_truth Special light pattern (but not hazards, as they’re too shrill) seems right"}, {"text": "@tesla_truth @NRF_designs We’re going to use the pedestrian pink noise speaker to talk to people &amp; create customized horn sounds. “I beg your pardon, but would you be so kind as to allow me to proceed?” Said in the voice of Mr. Darcy."}, {"text": "Rage, rage against the dying of the light https://t.co/aGRw4VowAQ"}, {"text": "@thejackbeyer 😀"}, {"text": "@S_Padival @Tesla @business @liamdenning @josheidelson @danahull @ZekeFaux Good question"}, {"text": "@DisruptResearch @Tesla @karpathy Probably our most viral feature ever. Most of the Autopilot team has been working on this, led by Ashok, CJ, Andrej &amp; many others."}, {"text": "@EvaFoxU @DisruptResearch @Tesla @karpathy Cool video!"}, {"text": "Inside Starship cargo bay. Header tanks mounted in tip of nosecone to offset engine weight at rear. https://t.co/EJSwqMCooA"}, {"text": "@HarryStoltz1 In solving for a good Mars climate, we will learn a great deal about how to do so on Earth. It is the inverse problem."}, {"text": "@TrevorMahlmann Haha yes"}, {"text": "@ColinPearceUK Bigger flaps/fins at rear also moves center of pressure back"}, {"text": "Production version will be a lot more polished than this prototype, but still fun to see"}, {"text": "@engineers_feed Thankfully not. FSW is very difficult to get right &amp; not needed with steel."}, {"text": "@engineers_feed Lot of ways to melt &amp; join steel. Mostly just needs to be welded consistently &amp; with precise parts."}, {"text": "@SS4Adrian Clearly a sign of the apocalypse!"}, {"text": "@Kristennetten @SS4Adrian I have that exact thought every time I get the flu"}, {"text": "@RationalEtienne @LaurenRow5 @EvaFoxU @Kristennetten @SteveHamel16 @TheElonMasked @MemesOfMars @MichellBasler @mayemusk @kimbal Agreed &amp; such a heartwarming photo ♥️"}, {"text": "@JohnnaCrider1 @RationalEtienne @LaurenRow5 @RenataKonkoly @Kristennetten @EvaFoxU @MemesOfMars @PositivePyrami1 Stop sending me this 💩 🤣🤣"}, {"text": "@AngelNDevil2 @MarkChica @FutureJurvetson @bluemoondance74 @SpaceX Raptor cost is tracking to well under $1M for V1.0. Goal is &lt;$250k for V2.0 is a 250 ton thrust-optimized engine, ie &lt;$1000/ton"}, {"text": "@AngelNDevil2 @MarkChica @FutureJurvetson @bluemoondance74 @SpaceX It’s all the “secondary” structure that concerns me, not engines &amp; primary airframe"}, {"text": "@OranMaliphant @Erdayastronaut @AngelNDevil2 @MarkChica @FutureJurvetson @bluemoondance74 @SpaceX That’s about right, except no sensors. Tile itself is the sensor as it will partially ablate where too hot &amp; have to be replaced."}, {"text": "@KeithMansfield @Erdayastronaut Great summary of the key points!"}, {"text": "@justpaulinelol @KeithMansfield @Erdayastronaut If 20km works, then orbit"}, {"text": "@tesla_truth Thanks, Tesla team is the strongest it’s ever been &amp; doing an amazing job! Honored to work beside them."}, {"text": "Over 550,000 Tesla Smart Summon uses in first few days!"}, {"text": "@MemesOfMars First point release update expected to go out this weekend"}, {"text": "@flcnhvy Not yet"}, {"text": "@annerajb @flcnhvy Hopefully, a month or two, although it may be a little silly at first"}, {"text": "@arctechinc Aiming for this weekend!"}, {"text": "@AdamTForbes @annerajb @flcnhvy Enhanced should get it too"}, {"text": "@teslaownersSV @arctechinc Not sure, will ask regulators"}, {"text": "Rosetta by Vangelis is incredible https://t.co/MKqbsdVVsN"}, {"text": "@HarryStoltz1 Probably Starlink 🛰 &amp; some fun things"}, {"text": "@flcnhvy @HarryStoltz1 Welded steel"}, {"text": "@TarikCelebii Wow, cool! Summon will get steadily smoother until it’s like an expert chauffeur who knows you well."}, {"text": "@TeslaOwnersSK @Tesla Sorry it took so long!"}, {"text": "@nichegamer Let’s go boyz!"}, {"text": "Excited about launching @NASA asteroid defense mission! #Armageddon69 https://t.co/6Hz4CKOLwU"}, {"text": "@tesla_truth 🤣🤣"}, {"text": "@rklau Great list of hotel hacks in this thread!"}, {"text": "@vincent13031925 @Sofiaan @SCE Exactly"}, {"text": "@Mikeado @Lancelot_Fox @Tommymcglynn @trevorandersen @fermatslibrary It’s true 🤣🤣"}, {"text": "@EvaFoxU To understand the nature of consciousness"}, {"text": "@justpaulinelol @EvaFoxU True"}, {"text": "@bluemoondance74 @EvaFoxU We will understand the next question"}, {"text": "@Erdayastronaut @bluemoondance74 @EvaFoxU Haha"}, {"text": "Customized horn &amp; movement sounds (coconuts being one, of course) coming to Teslas soon"}, {"text": "@teslaownersSV Sure"}, {"text": "@JudaMeg Will consider"}, {"text": "💨 &amp; 🐐 sounds too (also, of course)"}, {"text": "Given how quickly the world is shifting to electric vehicles, a gas/diesel vehicle bought today will probably have low resale value https://t.co/zmfOwk9wML"}, {"text": "@yukaichou @Tesla Any feature requests?"}, {"text": "@SpodieDodie Agreed, fair point"}, {"text": "@TameemJi @yukaichou @Tesla Good ones"}, {"text": "@jesterpb @yukaichou @Tesla Agreed"}, {"text": "And that’s just the tip of the iceberg https://t.co/cgRKiDsdbK"}, {"text": "Trouble! https://t.co/qo2hR7Vcsp"}, {"text": "@WellsAdams Done"}, {"text": "@browserdotsys Haha true"}, {"text": "@pewdiepie Hāhā"}, {"text": "@Gizmodo We’re doomed!"}, {"text": "@BnOrdhaug @Gizmodo I hope so"}, {"text": "@flcnhvy @BnOrdhaug @Gizmodo Culture Class is really something"}, {"text": "@alex_gayer 🤣"}, {"text": "@SciGuySpace For what it’s worth, the SpaceX schedule, which I’ve just reviewed in depth, shows Falcon &amp; Dragon at the Cape &amp; all testing done in ~10 weeks"}, {"text": "@SciGuySpace We had to reallocate some resources to speed this up &amp; received great support from Airborne, our parachute supplier. I was at their Irvine factory with the SpaceX team on Sat and Sun. We’re focusing on the advanced Mk3 chute, which provides highest safety factor for astronauts."}, {"text": "@flcnhvy @SciGuySpace All hardware is at the Cape. Need to do static fire and reconfigure for flight. Launch probably late Nov / early Dec."}, {"text": "Worth reading “Human Compatible” by Stuart Russell (he’s great!) about future AI risks &amp; solutions https://t.co/ZCdvZrrcVf"}, {"text": "@justpaulinelol I’m in the credits"}, {"text": "@Teslarati 🦶 💨"}, {"text": "@annerajb @Teslarati Not easily, as requires wire harness changes"}, {"text": "@Aero_JohnG @Erdayastronaut @SciGuySpace Yeah"}, {"text": "@teslaownersSV Thanks for mentioning. Should be enabled on all loaner cars."}, {"text": "@alex_gayer @teslaownersSV Will remove"}, {"text": "the color orange is named after the fruit"}, {"text": "@sara_boutall Door hinge"}, {"text": "@teslaownersSV Yes"}, {"text": "Why is there no emoji for dignity!!"}, {"text": "🦌"}, {"text": "@_GaryTheBot siq burn, Gary, siq burn"}, {"text": "@Thebault_Arthur @_GaryTheBot Next update"}, {"text": "A Shortfall of Gravitas"}, {"text": "@nextspaceflight Yes"}, {"text": "Tesla software V10.0 comes with karaoke 🎤"}, {"text": "But we call it “caraoke”, because it’s in a 🚘"}, {"text": "It’s really quite fun!"}, {"text": "@_GaryTheBot Even Gary likes it!"}, {"text": "@GeorgKonjovic Working on it"}, {"text": "@JimBridenstine @NASAMoon Important for Moonbase Alpha!"}, {"text": "@tesla_truth No change"}, {"text": "@annerajb @tesla_truth Yes"}, {"text": "@Kristennetten @annerajb @tesla_truth 🚀🚘 🧠🕳"}, {"text": "@Teslarati We’re changing Powerwall Storm Watch to Disaster Watch. Covers more bases."}, {"text": "https://t.co/BkKeiIzNPM"}, {"text": "Sooo annoying!! https://t.co/QKtCC0YgDG"}, {"text": "All Tesla Supercharger stations in regions affected by California power outages will have Tesla Powerpacks within next few weeks. Just waiting on permits."}, {"text": "Also adding Tesla Solar to our Supercharger stations as fast as possible. Goal is 24/7 clean power with no blackouts."}, {"text": "@Milostoessel @Tesla @TeslaSchweiz Ok"}, {"text": "@tesla_truth Exactly"}, {"text": "@sara_boutall @In2867Muk @parisreview I ♥️ Asterix &amp; Obelix!"}, {"text": "@RationalEtienne @tesla_truth @AfMusk @28delayslater @EvaFoxU @JohnnaCrider1 @vincent13031925 @mayemusk @RenataKonkoly @Tesla @zshahan3 True 🤣🤣"}, {"text": "@Gfilche @Tesla Fundamental metric of good of Tesla is how many years sooner it brings the advent of a sustainable energy future"}, {"text": "@vincent13031925 It’s something special"}, {"text": "@mandeepdalip @Tesla Will be throughout Canada"}, {"text": "Get Tesla Solar plus Powerwall battery for 24/7 clean power &amp; no more blackouts! https://t.co/mDoPO17YB9"}, {"text": "Now that Tesla V10.0 with Smart Summon is out, Full Self-Driving price will increase by $1000 on Nov 1"}, {"text": "@Thebault_Arthur Still working with RDW, the car regulatory authority in Netherlands. Unclear why there’s a delay. Other countries are supportive."}, {"text": "@annerajb @Thebault_Arthur Working with engineering team to figure out best way to do upgrade without crushing service team. Will start doing upgrades in volume in a few months, coincident with more FSD features being released."}, {"text": "@wilsonlam 😉"}, {"text": "@tesla_addicted @sanjeev_r11 @vincent13031925 Putting panels on east or west facing roofs works well too. Energy loss is fairly minor. Just north facing that’s problematic above ~30 deg latitude."}, {"text": "@cutza7 When the car is FSD without supervision, ie robotaxi, you’ll be able to earn far more than monthly lease/loan cost by allowing others to use it. Managing a small fleet of robotaxis will be a career for many &amp; much better than driving a single car."}, {"text": "V important: pure solar subscription is guaranteed to be a net money-maker for the homeowner or Tesla will take the panels back. Adding Powerwall negatively affects economics, but gives homeowner power protection in event of a blackout."}, {"text": "Allows homeowner potential to go completely off grid"}, {"text": "@bruce_mittleman Tesla cannot continue to lose money. To achieve our goal of environmental sustainability, Tesla must be financially sustainable or we will cease to exist."}, {"text": "@brockm Yes, but probably a year or two away. Lot of fish to fry …"}, {"text": "Price for fully installed solar plus battery has been reduced ~10% to help those affected by blackouts"}, {"text": "@wk057 @Tesla Should be much better at this point"}, {"text": "@cleantechnica Several finesse improvements coming to Smart Summon in coming weeks. Will be smooth as silk."}, {"text": "@tesla_truth @BarkMSmeagol @vincent13031925 @jchybow @JohnnaCrider1 @28delayslater @flcnhvy @AfMusk Super messed up situation!"}, {"text": "@tesla_truth @BarkMSmeagol @vincent13031925 @jchybow @JohnnaCrider1 @28delayslater @flcnhvy @AfMusk .@DrPatSoonShiong, are you aware that one of your senior journalists (Russ Mitchell) is openly funding a fake charity run by an online bully?"}, {"text": "French fries 🍟 are the devil 😈 https://t.co/AR3h57RPIA"}, {"text": "@Macwars Fair point. Will hold on EU price change until Tesla gets clarity from regulators about Smart Summon feature release date."}, {"text": "@bonnienorman Whoa, that does look good!"}, {"text": "@Erdayastronaut Depends on total system efficiency &amp; how long the propellant plant can run to refill Starship, so 1 to 10MW as a rough guess"}, {"text": "@Erdayastronaut Solar"}, {"text": "@owlmaster08 @Tesla Nice 🤣🤣"}, {"text": "@anonyx10 @mayemusk Sure looks that way"}, {"text": "@Nobody_Really7 @anonyx10 @mayemusk So it goes"}, {"text": "Is Space Jam good?"}, {"text": "Underappreciated 🎥, will watch!"}, {"text": "First will rewatch Godfather Part II, then Space Jam"}, {"text": "@jay11w Recommended for sure. Both movies are incredible."}, {"text": "Space Jam should’ve won the Oscar https://t.co/E7l2DCAxDH"}, {"text": "@russ1mitchell lol"}, {"text": "Ms. Chief &amp; Ms. Tree https://t.co/YgRFtq0tSc"}, {"text": "Haha https://t.co/hY3yDsrVqk"}, {"text": "@TeslaGong Coming v soon"}, {"text": "@Charalanahzard Those rumors are false"}, {"text": "@28delayslater @Charalanahzard Cybertruck doesn’t look like anything I’ve seen bouncing around the Internet. It’s closer to an armored personnel carrier from the future."}, {"text": "@teslaownersSV @28delayslater @Charalanahzard ♥️ hot pot"}, {"text": "@nate_mccomb @28delayslater @Charalanahzard Yep, good catch"}, {"text": "@YogiSC1127 @Tesla Deep Rain™️ neural net coming soon. We’re not trademarking any other Autopilot neural nets, just this one, because rain is deep."}, {"text": "@annerajb @YogiSC1127 @Tesla It is actually called deep rain, as sort of a joke at Tesla. Takes a surprising amount of deep learning to know when &amp; how fast to move the wipers."}, {"text": "@aquastorm Yes, we will"}, {"text": "@tesla_truth @annerajb @YogiSC1127 @Tesla True"}, {"text": "@flcnhvy @aquastorm Venus would be very difficult"}, {"text": "@tesla_addicted Will start rendering traffic cones in the display soon"}, {"text": "@SteveMartineau6 @annerajb @YogiSC1127 @Tesla Yes"}, {"text": "@annerajb @tesla_addicted Software"}, {"text": "@NASASpaceflight @IanPineapple Yeah, will be Raptor vertical test stand. Hopefully allows simplification of Raptor design, as pump shaft wear &amp; drainage is better in vertical config. Also, more representive of flight. Test as you fly …"}, {"text": "@neiltyson @Space_Station Most people aren’t aware that orbit (and “zero” gravity) is all about horizontal speed, not altitude. A spacecraft needs to travel about 25 times the speed of sound to stay in space."}, {"text": "@HarryStoltz1 @neiltyson @Space_Station Exactly. And you can on the moon, since it has no atmosphere."}, {"text": "@J_ump_er @neiltyson @Space_Station To be precise, r is distance from center of masses of two objects. Center of mass of Earth is ~6400km, so gravity change is small at Space Station altitude, which is ~6800km from center of Earth. https://t.co/21hICWczMq"}, {"text": "@Sofiaan @annerajb @tesla_addicted Yeah, great team!"}, {"text": "@teslaownersSV @Sofiaan @annerajb @tesla_addicted We’re working on a simple initial version of Autopark. Will be safe, but sometimes park in silly places that aren’t actual parking spaces."}, {"text": "@HarryStoltz1 @neiltyson @Space_Station Big challenge for Starship refueling on the moon is finding sources of carbon. Probably some pretty big deposits in craters from meteorites. Same goes for hydrogen &amp; oxygen, also in (shadowed) craters."}, {"text": "@torybruno @Erdayastronaut @MartianDays @AerojetRdyne This is true. All that matters is number used in ∆v equation. Propellant residuals are incredibly important, often overwhelming engine mass. https://t.co/s2LcEapGAU"}, {"text": "@Erdayastronaut @torybruno @MartianDays @AerojetRdyne Oberth effect is not well appreciated. Value of high thrust low in gravity well is not captured in simple delta-v equation. One of the reasons we favor CH4 over H2. https://t.co/LijrUMuJDq"}, {"text": "@Erdayastronaut @torybruno @MartianDays @AerojetRdyne Max thrust version of Raptor should achieve true T/W &gt; 170. Target is 1.5 ton engine with &gt;260 t-F. Max Isp version should achieve ~380 sec, but T/W probably &lt;120 due to big nozzle. These are just guesses for now."}, {"text": "@nextspaceflight @Erdayastronaut @torybruno @MartianDays @AerojetRdyne Couple months, but V1.0 of Raptor Vac is suboptimal, as optimized for speed of development. Isp maybe 365 to 370 sec."}, {"text": "@nextspaceflight @Erdayastronaut @torybruno @MartianDays @AerojetRdyne Also, we’re keeping area ratio low enough to fire Raptor Vac at sea level without flow separation, so that’s leaving a lot on the table"}, {"text": "@MartianDays @Erdayastronaut @torybruno @AerojetRdyne We def could be wrong about this, but it’s actually good to fix high efficiency vacuum engines with giant nozzles in place &amp; only thrust vector engines with smaller nozzles. Don’t need a lot of room &amp; moment of inertia is much lower."}, {"text": "@Ingvar_Oolsen @neiltyson @Space_Station Looking forward to Kerbal 2!"}, {"text": "@TTownJoe @Erdayastronaut @torybruno @MartianDays @AerojetRdyne Conservation of energy tells you the answer"}, {"text": "@NotEricRalph @MartianDays @Erdayastronaut @torybruno @AerojetRdyne Yeah, gimbal SL engines at min throttle for control, so most of impulse goes through vac engines"}, {"text": "And the lead character is also named Woody https://t.co/ZxK84rB020"}, {"text": "@RationalEtienne @LaurenRow5 @EvaFoxU @JohnnaCrider1 @Kristennetten @vincent13031925 @28delayslater @Sofiaan @hamids @InsideEVs Prototypes are easy, but achieving volume production of a new technology is insanely hard"}, {"text": "@RationalEtienne @LaurenRow5 @EvaFoxU @JohnnaCrider1 @Kristennetten @vincent13031925 @28delayslater @Sofiaan @hamids @InsideEVs Tesla is first American car company to achieve sustained volume production in past ~100 years. Hardest, most painful thing I’ve ever been through, including getting Falcon to orbit."}, {"text": "So much respect for those doing high volume manufacturing. It’s insanely hard, but you make a real thing that people value. My hat is off to you …"}, {"text": "@Erdayastronaut Tesla team has done an incredible job with Giga Shanghai. Honored to work with them. I’m in awe."}, {"text": "Anyone who’s interested in working on cutting edge manufacturing — designing &amp; building the machine that makes the machine — please consider working at Tesla or SpaceX. We’re gonna take this to a whole new level!"}, {"text": "@Teslarati The final configuration used at Nürburgring to set the record will go into production around summer 2020, so this is not merely for the track"}, {"text": "Tesla wins best headlights award 🥇 https://t.co/SjvA931B3U https://t.co/8yfeJiXd0N"}, {"text": "@slashdot And so begins the robocalypse …"}, {"text": "@WorldAndScience Common myth, but incorrect"}, {"text": "@Erdayastronaut @NotEricRalph @MartianDays @torybruno @AerojetRdyne Need to deal with thrust asymmetry from flameout of an engine without forcing shutdown of opposing pair engine, which would double thrust loss. Also, thrust differential doesn’t solve roll control well."}, {"text": "@John_Gardi @Erdayastronaut @NotEricRalph @MartianDays @torybruno @AerojetRdyne More about dealing with failure modes &amp; roll control"}, {"text": "@TesLatino @Erdayastronaut @NotEricRalph @MartianDays @torybruno @AerojetRdyne @elon Both at the same time!"}, {"text": "Going offline for a few days"}, {"text": "Order Tesla Solar + Powerwall battery for 24/7 clean power &amp; no blackouts! https://t.co/mDoPO17YB9"}, {"text": "PG&amp;E says rolling blackouts expected in California for next 10 years! https://t.co/Iv9f0piK82"}, {"text": "Very likely that a home with clean power that’s lower cost than utility, plus blackout protection via Powerwall, will have a positive effect on value"}, {"text": "More carrot, less stick"}, {"text": "Homes with solar sell for 4.1% more, according to Zillow https://t.co/EtqGAxDlAF"}, {"text": "Sending this tweet through space via Starlink satellite 🛰"}, {"text": "Whoa, it worked!!"}, {"text": "@tecnocato @Tesla Coming soon"}, {"text": "@TesLatino Please lmk about your experience and what can be improved"}, {"text": "@TesLatino Internal camera isn’t used yet (meant for robotaxi), but that’s a good idea"}, {"text": "@Teslarati The big rear wing is only on for one day for rear downforce calibration. Isn’t needed to set ring record &amp; won’t be in the production car."}, {"text": "Tesla Q3 results:\n\n- Shanghai Giga ahead of schedule\n- Model Y ahead of schedule\n- Solar installs +48% from Q2\n- GAAP profitable\n- Positive free cash flow"}, {"text": "Super proud of Tesla team for great execution &amp; support of Tesla customers greatly appreciated!!"}, {"text": "But actually … https://t.co/XJNjPHrq2A"}, {"text": "@KlausLovgreen Sure"}, {"text": "Tesla Solar Tile Roof V3 launch tomorrow at 2pm"}, {"text": "@flcnhvy I have V1, but will switch to V3"}, {"text": "@MoWo91 @SpX_memes @SpaceX @Tesla @RenataKonkoly @sara_boutall @Kristennetten @Erdayastronaut @flcnhvy @JohnnaCrider1 🤣🤣"}, {"text": "@GerberKawasaki @Tesla Major FUD incoming for sure … haha"}, {"text": "Will do an open call Q&amp;A"}, {"text": "@flcnhvy This product may appear simple, but actually *very* difficult to get right"}, {"text": "California time"}, {"text": "To be clear, integrated solar tiles only make financial sense for new houses or replacement roofs. If your roof is more than 5 years away from replacement, solar retrofit is recommended https://t.co/mDoPO17YB9"}, {"text": "@longnow @Liv_Boeree Strange to think that our civilization is only ~5000 years old, if dated from earliest writing. Less than the lifespan of a fruit fly, compared to age of Earth."}, {"text": "🔥"}, {"text": "@TeslaNY @SpaceX Gwynne rocks! Starlink will probably be a little bumpy at first, but then improve rapidly."}, {"text": "Maybe call Tesla solar roof tiles product Solarglass? Like Dragonglass, but solar!"}, {"text": "@HarryStoltz1 That would be cool. Surfaces that see the sun should be alive with power, not inert!"}, {"text": "@Cardoso @Erdayastronaut Transparent aluminum is a real thing! https://t.co/hX4XLih1Hk"}, {"text": "Srsly https://t.co/MWipMr84cD"}, {"text": "@tobyliiiiiiiiii Haha true"}, {"text": "@Tesla Will start at ~2:15. Sorry for slight delay."}, {"text": "Tesla Solarglass roof https://t.co/7lw43mL92D"}, {"text": "@john_s_wilkins Yes, wight destruction guaranteed or your money back!"}, {"text": "@GerberKawasaki Jerome is great! Tesla team in general is the strongest its ever been."}, {"text": "@AT61_AUE @Cobalt310 @Tesla Yes, you can walk on the Tesla Solarglass roof. In stilettos, if you want 😉 https://t.co/6wwKJqmPdr"}, {"text": "Physics facts https://t.co/Z2a6PzokJx"}, {"text": "Sandwich time travel is the only explanation https://t.co/M8c98GBsDC"}, {"text": "@tesletter Thanks to everyone at Tesla who worked so hard over the years to make our Fremont factory successful!"}, {"text": "Took my son to play piano for the seniors home in Pasadena. It was lovely to see them smile ♥️"}, {"text": "@flcnhvy https://t.co/40NtMONR72"}, {"text": "@SnazzyQ @Tesla Sure"}, {"text": "Tesla Solar plus Powerwall battery backup for 24/7 clean energy &amp; no blackouts at https://t.co/mDoPO17YB9"}, {"text": "US clean energy incentive drops by 4% on Jan 1, so orders must be received by roughly Nov 15 to be installed in time"}, {"text": "@teslaownersSV Will do what we can for anyplace affected by natural disasters"}, {"text": "@starshipsara Extremely high"}, {"text": "@flcnhvy @teslaownersSV I’d recommend regular solar panels for flat roofs"}, {"text": "Homes with solar sell for 4.1% more, according to Zillow. Adding a Powerwall battery is highly likely to increase home value too imo, as security against blackouts is increasingly important. \nhttps://t.co/3y4M5L50qF"}, {"text": "@jasondunn So true. Imagine if phones were gasoline powered. Total sales would be like 14 units worldwide! Using oil/gas &amp; being forced to constantly visit toxic chemical dispensing stations will seem so insane in the future!"}, {"text": "Apologies to those waiting for Solar/Powerwall outside California, as we are prioritizing those affected by wildfires"}, {"text": "If you’re directly affected by wildfire power outages, Tesla is reducing Solar+Powerwall prices by $1000 as of today"}, {"text": "We don’t make much money on this product, so $1000 actually means a lot"}, {"text": "Unfortunately, it’s hard to google Tesla solar links due to tons of ads &amp; SEO. Go to https://t.co/UvQa8JOE7v to add solar to an existing roof &amp; https://t.co/D9yUuL7NVE for a new roof with integrated solar."}, {"text": "@realDiegoMonroy I hate advertising"}, {"text": "@kylegrantham Very true. Glass doesn’t burn &amp; melting point is extremely high, so much more resilient than asphalt or wood roofs."}, {"text": "@Jon4Lakers @Tesla We’re changing this from storm watch to disaster watch to cover fires, earthquakes, etc"}, {"text": "@Jason @kylegrantham Making a roof out of kindling in a fire risk zone is not recommended"}, {"text": "@MrBeastYT Sounds cool. Where are the trees being planted &amp; what kind of trees?"}, {"text": "@MKBHD @MrBeastYT Ok, sounds legit, will donate 1M trees"}, {"text": "For Treebeard"}, {"text": "“I always like going South; somehow, it feels like going downhill.”"}, {"text": "Just a reminder that the Tesla Full Self-Driving option goes up by $1000 at midnight on Nov 1 for all regions that have Smart Summon. Order your car online at https://t.co/7FlnbrMxOl."}, {"text": "@teslaownersSV If you have autonav enabled, car will automatically navigate either to address in calendar, to work if you’re home &amp; to home if at work. Not sure if that’s in wide release yet, but def in early access. It’s an awesome feature."}, {"text": "@RenataKonkoly @MrBeastYT @MKBHD True, my name literally means tree"}, {"text": "@themuskbros @teslaownersSV That’s significantly improved in current production"}, {"text": "Soon, SpaceX will launch @NASA astronauts to @Space_Station! https://t.co/wAy5MNqnEI"}, {"text": "@johnkrausphotos @NASA @Space_Station Hard to say with high accuracy, but 4 to 6 weeks is my best guess"}, {"text": "♥️ snacks ♥️ https://t.co/LPcZyX607f"}, {"text": "@TeslaStars @Tesla …"}, {"text": "@NutaIie Haha true"}, {"text": "@flcnhvy The fires are all too real"}, {"text": "@tobi @chris__lu @MarkRober @MrBeastYT Congrats! Shopify is great btw. Nice work."}, {"text": "Thank for helping grow sustainable energy through solar! https://t.co/zH08AMhVMj"}, {"text": "@TeslaNY Walking on a Tesla Solarglass roof is definitely no problem!"}, {"text": "@Teslarati Drag Race Times analysis is correct. Also, there’s a software upgrade for Model S coming out that increases peak power by 50HP, so Model S should beat Porsche Taycan Turbo S by a wider margin in 0 to 60 &amp; 1/4 mile races."}, {"text": "@stephenpallotta @Teslarati Sorry, Drag Times is correct, Top Gear is wrong"}, {"text": "Tesla Solarglass vs 🎃 \nHappy Halloween!! https://t.co/p5tXeJYqne"}, {"text": "@Teslarati Putting Model S in range mode is the opposite of launch mode, as it minimizes performance in favor of range. Show should be called “Low Gear”!"}, {"text": "Great work by SpaceX Dragon team &amp; Airborne! To be clear, we’ve only done 1 multi-parachute test of Mk3 design, so 9 more left to reach 10 successful tests in a row. https://t.co/Q814zVoW4S"}, {"text": "@flcnhvy Great poem"}, {"text": "@TJ_Cooney Wow, 2011 seems like eons ago! With fairing recovery, Falcon is ~80% reusable, but reflight takes several days &amp; requires boats. Starship will be fully reusable with booster reflight possible every few hours &amp; ship reflight every 8 hours. No boats needed."}, {"text": "@TJ_Cooney That said, most Starship spaceports will probably need to be ~20 miles / 30km offshore for acceptable noise levels, especially for frequent daily flights, as would occur for point to point flights on Earth"}, {"text": "@rafaelcr @OfWudan Would be odd to expect anything else"}, {"text": "@bob_burrough Yes"}, {"text": "@cleantechnica More to come"}, {"text": "@Teslarati Connected, autonomous cars require great software. Advanced factories also require great software. The car industry is not very good at software."}, {"text": "@WillFealey @Teslarati Fair point. Coming soon. We’re making foundational upgrades to the core Tesla corporate OS. 2FA right after that."}, {"text": "@Teslarati This is based on an incorrect Electrek article. The Air Force asked me to speak at a startup conference called “Pitch Day” &amp; I happened to mention Cybertruck. They don’t buy APCs. It’s the Air Force."}, {"text": "@justpaulinelol @Teslarati Naturally"}, {"text": "@FredericLambert @Teslarati The audience of entrepreneurs should try it, not the AF"}, {"text": "@Ryanth3nerd @Teslarati Yes"}, {"text": "@uhaveanygrapes @Teslarati Looking into it"}, {"text": "Cybertruck unveil on Nov 21 in LA near SpaceX rocket factory"}, {"text": "The date is strangely familiar …\nhttps://t.co/YZl5R1POJL"}, {"text": "@BenSullins Yes"}, {"text": "@SimoneGiertz Of course!"}, {"text": "Extremism is so fun! (@waitbutwhy)\nhttps://t.co/ECACsaqAXR"}, {"text": "@cleantechnica True"}, {"text": "@cleantechnica Gas/diesel cars too"}, {"text": "@flcnhvy The economics have to be something like that to build a self-sustaining city on Mars"}, {"text": "@flcnhvy Payload to orbit per year of Starship fleet is most mind-blowing metric, as it’s designed to fly 3X per day, which is ~1000X per year"}, {"text": "@flcnhvy If we build as many Starships as Falcons, so ~100 vehicles &amp; each does 100 tons to orbit, that’s a capacity of 10 million tons of payload to orbit per year"}, {"text": "@flcnhvy Current global payload to orbit capacity is about 500 tons per year, of which Falcon is about half"}, {"text": "@Malcolmmarsman @flcnhvy No problem. We could program Starship to perform Swan Lake in the sky. Minimizing landing burn propellant mass is what’s hard."}, {"text": "@teslaownersSV @flcnhvy A thousand ships will be needed to create a sustainable Mars city"}, {"text": "@teslaownersSV @flcnhvy As the planets align only once every two years"}, {"text": "@teslaownersSV @flcnhvy So it will take about 20 years to transfer a million tons to Mars Base Alpha, which is hopefully enough to make it sustainable"}, {"text": "@teslaownersSV @flcnhvy No, in the beginning, assuming you even make it there alive, Mars will be far more dangerous &amp; difficult than Earth &amp; take decades of hard labor to make self-sufficient. That’s the sales pitch. Want to go?"}, {"text": "@leo_cadle @teslaownersSV @flcnhvy Exactly! It’s also a far more exciting &amp; inspiring future if consciousness is out there among the stars, than forever confined to Earth until some eventual extinction event, however far in the future that may be (hopefully, very far)."}, {"text": "@jchybow @teslaownersSV @flcnhvy Pretty much"}, {"text": "@bluemoondance74 @flcnhvy Raptor is evolving rapidly. Probably wouldn’t consider it to be even V1.0 until roughly engine 50, although probably engines 12+ can be retrofitted for orbital flight, especially on Super Heavy, which is less sensitive to engine variation. It just needs crazy up force!"}, {"text": "@bluemoondance74 @flcnhvy SpaceX engine production is gearing up to build about a Raptor a day by next year, so up to 365 engines per year. Most will be the (as high as) 300 ton thrust (but no throttle &amp; no gimbal) variant for Super Heavy. Cumulative thrust/year could thus be as high as 100,000 tons/year."}, {"text": "@bluemoondance74 @flcnhvy Deleting throttle allows the engine to achieve max thrust on max thrust variant. Other variants will have throttle."}, {"text": "@stephenjudkins @flcnhvy Yes"}, {"text": "141 MPGe! https://t.co/eb8b517Yvk"}, {"text": "@zerohedge 😘 https://t.co/w0BkNGbvQ1"}, {"text": "@RobGMacfarlane @nybooks @emilyraboteau Same goes for digital super intelligence denial"}, {"text": "@lexfridman Bad logic is always ugly"}, {"text": "@SciGuySpace @yokem55 @waynehale Without a fully &amp; rapidly reusable orbital rocket, humanity will never be a multiplanet species"}, {"text": "@flcnhvy @SciGuySpace @yokem55 @waynehale Exactly"}, {"text": "@getjeda @Tesla Haha"}, {"text": "@xtrmmax @getjeda @Tesla Yes"}, {"text": "Starlink vertical on the pad https://t.co/WuiB1piKcK"}, {"text": "@KenHowery Congratulations!"}, {"text": "🖤♥️💛 GIGA BERLIN 💛♥️🖤"}, {"text": "Will build batteries, powertrains &amp; vehicles, starting with Model Y"}, {"text": "Congrats to Tesla team on Model 3 winning best midsize car in Germany! 🇩🇪🇩🇪🇩🇪 https://t.co/4CDTf4c3eC"}, {"text": "@brandonbernicky Yeah, makes sense"}, {"text": "@atlasobscura fomo 4 yolo"}, {"text": "@v_g_fischer @Tesla There will be many opportunities for both new &amp; experienced people!"}, {"text": "@Matt_B730 @ID_AA_Carmack F8 🖤 irony"}, {"text": "@nichegamer @v_g_fischer @Tesla Memes are modern art"}, {"text": "@flcnhvy @v_g_fischer @Tesla It was Tacheles"}, {"text": "Gentrify Mordor?"}, {"text": "@CroWarrior1978 We fought the Balrog last year"}, {"text": "@flcnhvy @neuralink Right now, trajectory of neuro-silicon symbiosis doesn’t appear to intersect trajectory of AGI. Goal of Neuralink is to raise this probability above 0.0%."}, {"text": "@davidtrover Seems likely. 🧝‍♂️🧝‍♂️ = hipsters."}, {"text": "@fael097 @davidtrover Semi-infinite"}, {"text": "@cleantechnica True"}, {"text": "@arstechnica @SciGuySpace This doesn’t seem right"}, {"text": "@arstechnica @SciGuySpace Meaning not fair that Boeing gets so much more for the same thing"}, {"text": "Innovation comes in many ways https://t.co/3plylbd1eZ"}, {"text": "Cybertruck unveil Thursday night https://t.co/AHBxaubdhO"}, {"text": "@cleantechnica Surprisingly common"}, {"text": "@flcnhvy Exactly! Well said."}, {"text": "@Ford Congratulations on the Mach E! Sustainable/electric cars are the future!! Excited to see this announcement from Ford, as it will encourage other carmakers to go electric too."}, {"text": "@farrxy @Ford I’d be way too embarrassed to put that on a Tesla. It’s like a kid’s drawing."}, {"text": "@Kristennetten @farrxy @Ford Guess I was obsessed with space from an early age. Fair point."}, {"text": "@Teslarati Even Toyota, who made the Prius. That is sad."}, {"text": "@teslaownersSV @Teslarati Not sure. Maybe write or message carmakers who oppose the environmental initiative?"}, {"text": "@universal_sci True"}, {"text": "@justpaulinelol @universal_sci It certainly does"}, {"text": "@mrclipsmaniac Cephalopods have a strange intelligence"}, {"text": "@slashdot The China space industry is very impressive"}, {"text": "78% of people want to gentrify Mordor"}, {"text": "https://t.co/lvCnlztkPa"}, {"text": "National Science Foundation, u should add a W to ur name. Would get way more clicks. Ur welcome."}, {"text": "@SupaZT @Erdayastronaut That would be cool"}, {"text": "@lexfridman @NSF Gravitas is overrated https://t.co/4MdteBfEjY"}, {"text": "@TeslaTested So many reporters gave Chanos airtime when he called Tesla a worthless fraud. Now that he has been proven wrong, silence …"}, {"text": "@MKBHD Maybe won’t need a key at all"}, {"text": "@Erdayastronaut @SpaceX Absolutely, but to move to Mk3 design. This had some value as a manufacturing pathfinder, but flight design is quite different."}, {"text": "Tonight https://t.co/pVAv4v1h8b"}, {"text": "Long journey"}, {"text": "@WillFealey @Tesla Fun party guaranteed!"}, {"text": "@ward069 Of course"}, {"text": "Tesla Cybertruck (pressurized edition) will be official truck of Mars"}, {"text": "@ElenMatvievska @Tesla Coming soon! We’re working to complete the full Supercharger route from London to Shanghai."}, {"text": "Cybertruck design influenced partly by The Spy Who Loved Me https://t.co/HKBzxFNfzm"}, {"text": "@DMC_Ryan High time we had a Tesla coil!"}, {"text": "@tesla_addicted @DMC_Ryan Haha"}, {"text": "@Qrypton Yup"}, {"text": "Nobody *expects* the Cybertruck https://t.co/khhYNFaVKs"}, {"text": "@CyberpunkGame See ya in 2077 😉"}, {"text": "@MoeSargi Tesla 2 person electric ATV will come at first as an option for Cybertruck"}, {"text": "@JRussell614 Will be an option to add solar power that generates 15 miles per day, possibly more. Would love this to be self-powered. Adding fold out solar wings would generate 30 to 40 miles per day. Avg miles per day in US is 30."}, {"text": "@mithunoorath @Tesla Yes"}, {"text": "Better truck than an F-150, faster than a Porsche 911. Order Cybertruck online at https://t.co/hltT8dg2NO"}, {"text": "@reecethesaxman We threw same steel ball at same window several times right before event &amp; didn’t even scratch the glass!"}, {"text": "🖤🖤🖤 Syd Mead 🖤🖤🖤 https://t.co/8nbD5LrAQJ"}, {"text": "Franz throws steel ball at Cybertruck window right before launch. Guess we have some improvements to make before production haha. https://t.co/eB0o4tlPoz"}, {"text": "@SuperSaf @Tesla Sure"}, {"text": "Riding in the Cybertruck https://t.co/A4ddKBkGMb"}, {"text": "@carkuwu Armored Personnel Carrier (APC)"}, {"text": "@cleantechnica 🤣🤣"}, {"text": "@pewdiepie Gonna have some sick attachments"}, {"text": "@GenerationPls @pewdiepie That would be cool"}, {"text": "@cleantechnica Great analysis"}, {"text": "146k Cybertruck orders so far, with 42% choosing dual, 41% tri &amp; 17% single motor"}, {"text": "With no advertising &amp; no paid endorsement"}, {"text": "@Revitalize Haha v true"}, {"text": "@somepitch Yes"}, {"text": "187k"}, {"text": "Excellent review by Marques! https://t.co/RaXLl30FfF"}, {"text": "Reason Cybertruck is so planar is that you can’t stamp ultra-hard 30X steel, because it breaks the stamping press"}, {"text": "Even bending it requires a deep score on inside of bend, which is how the prototype was made"}, {"text": "@flcnhvy Starship steel decision came first. We were going to use titanium skins for Cybertruck, but cold-rolled 30X stainless is much stronger."}, {"text": "@annerajb @flcnhvy We’re creating this alloy at Tesla. Not a problem to create a lot of it, but we’ll need to come up with new body manufacturing methods, as it can’t be made using standard methods."}, {"text": "⚔️ Study the Blade!! ⚔️ https://t.co/cvuW1TmcjI"}, {"text": "@vicentes Haha true! New manufacturing methods are certainly needed, but then I’m confident it will actually cost less, because of its simplicity &amp; lower part count."}, {"text": "@vicentes Hardcore body engineers will understand this at a profound level"}, {"text": "@Erdayastronaut Really? Ok sure."}, {"text": "@RenataKonkoly 🤣🤣"}, {"text": "@evanthefreeman @CoinstorageGuru True"}, {"text": "@vistacruiser7 @RenataKonkoly Interesting idea"}, {"text": "@S_Padival @annerajb @flcnhvy Long term, it probably makes sense to build a smaller Cybertruck too"}, {"text": "@EV_Stevee @PicklePunchD The body panels will actually be laser cut!"}, {"text": "@JohnnaCrider1 @EV_Stevee @PicklePunchD Can be wrapped in any color!"}, {"text": "@thomasbroadfoot Good question. It’s a new variant of 300 series stainless steel, but it also gets cold-worked many times, depending on kilotonnage of press."}, {"text": "Cybertruck is our last product unveil for a while, but there will be some (mostly) unexpected technology announcements next year"}, {"text": "@Sofiaan @Tesla We should def make it good to hang out there"}, {"text": "@TeslaOwnersofMA @Sofiaan @Tesla In general, this is something Tesla should do"}, {"text": "@greenspank Higher hardness, higher strength &amp; doesn’t cost crazy money for ~3mm skins"}, {"text": "Cybertruck pulls F-150 uphill https://t.co/OfaqUkrDI3"}, {"text": "@RodAdib1 Yup. Sledgehammer impact on door cracked base of glass, which is why steel ball didn’t bounce off. Should have done steel ball on window, *then* sledgehammer the door. Next time …"}, {"text": "200k"}, {"text": "@Halo @pewdiepie Cybertruck is inspired by games like Halo. Warthog irl!!"}, {"text": "Bring it on https://t.co/pCnln1NdRO"}, {"text": "@neiltyson Electric motors also have insane torque. If we load both trucks to the max, electric still wins. Physics is the law, everything else is a recommendation."}, {"text": "@neiltyson Agreed, this will be exciting to see!"}, {"text": "@kimpaquette @neiltyson Sure, will aim to do this next week"}, {"text": "@Nnedi @Tesla We’d be happy to help"}, {"text": "250k"}, {"text": "@jpthor__ @RodAdib1 Yes, Cybertruck will have steel balls 🤣🤣"}, {"text": "@TheSeanBooker Def not dainty"}, {"text": "@RenataKonkoly @Tesla @Teslarati @InsideEVs 🤣🤣"}, {"text": "@TheWalkingDead @Tesla The finest in apocalypse protection technology! Flamethrower optional."}, {"text": "This one is deep.\nHappy Thanksgiving! https://t.co/2Dog5HBxjX"}, {"text": "@ruttenpete @DeviantArt @TheBakaArts Just because he has a flamethrower and I have a flamethrower doesn’t mean … um … ok fine I’m Hank Scorpio"}, {"text": "@hardmaru @Tesla Touché"}, {"text": "@IntEngineering With extreme effort, Cybertruck might hit a 0.30 drag coefficient, which would be insane for a truck. Requires tweaking many small details. https://t.co/IMLJbsInmq"}, {"text": "@ZackBornstein It’s a generational thing"}, {"text": "@sivarajkumar237 @ZackBornstein @TheOnion They are dead to me"}, {"text": "@indiealexh @es2120 @Tesla @woodhaus2 Safety work is done by engineering, with passive safety by body/chassis eng &amp; active by Autopilot. Design in automotive refers to look &amp; feel."}, {"text": "@Real_John_D That’s why Cybertruck has active suspension height &amp; damping control"}, {"text": "@TeslaForLife @Tesla @RamTrucks @Ford Laminar air flow due to a completely smooth bottom is underappreciated"}, {"text": "@Erdayastronaut @IntEngineering Overall shape is good for low drag coefficient. Matters a lot exactly how you trip airflow at edges &amp; guide air around wheels, like an invisible sculpture."}, {"text": "Do you like our owl? https://t.co/4fNOEv3N5b"}, {"text": "It’s artificial"}, {"text": "@royalsociety Tesla was almost called Faraday, as original holder of Tesla Motors trademark refused to sell it to us!"}, {"text": "@HarryStoltz1 @royalsociety We sent the nicest person in the company to sit on his doorstep until he at least talked to us &amp; then he said yes"}, {"text": "@brandonorselli Still can’t believe how hard it was to get https://t.co/46TXqRrsdr!"}]