[{"text": "Louisiana Republicans must go out and vote REPUBLICAN in your Governor’s race. A Republican will win if you can force a runoff! Early voting has started. Your 2nd Amendment, and much else, is at stake."}, {"text": "I won the right to be a presidential candidate in California, in a major Court decision handed down yesterday. It was filed against me by the Radical Left Governor of that State to tremendous Media hoopla. The VICTORY, however, was barely covered by the Fake News. No surprise!"}, {"text": "Massive sections of The Wall are being built at our Southern Border. It is going up rapidly, and built to the highest standards and specifications of the Border Patrol experts. It is actually an amazing structure! Our U.S. Military is doing a GREAT job."}, {"text": "Congressman Adam Schiff should resign for the Crime of, after reading a transcript of my conversation with the President of Ukraine (it was perfect), fraudulently fabricating a statement of the President of the United States and reading it to Congress, as though mine! He is sick!"}, {"text": "All the Do Nothing Democrats are focused on is Impeaching the President for having a very good conversation with the Ukrainian President. I knew that many people were listening, even have a transcript. They have been at this “stuff” from the day I got elected. Bad for Country!"}, {"text": "#DONOTHINGDEMS"}, {"text": "“Nancy Pelosi and the Democrats haven’t met the standards of impeachment. They have to be very careful here.” Jeanne Zaino. @FoxNews"}, {"text": "Now the press is trying to sell the fact that I wanted a Moat stuffed with alligators and snakes, with an electrified fence and sharp spikes on top, at our Southern Border. I may be tough on Border Security, but not that tough. The press has gone Crazy. Fake News!"}, {"text": "All of this impeachment nonsense, which is going nowhere, is driving the Stock Market, and your 401K’s, down. But that is exactly what the Democrats want to do. They are willing to hurt the Country, with only the 2020 Election in mind!"}, {"text": "Nancy Pelosi just said that she is interested in lowering prescription drug prices &amp; working on the desperately needed USMCA. She is incapable of working on either. It is just camouflage for trying to win an election through impeachment. The Do Nothing Democrats are stuck in mud!"}, {"text": "Democrats are trying to undo the Election regardless of FACTS! https://t.co/cQ3B1bGD4L"}, {"text": "Adam Schiff should only be so lucky to have the brains, honor and strength of Secretary of State Mike Pompeo. For a lowlife like Schiff, who completely fabricated my words and read them to Congress as though they were said by me, to demean a First in Class at West Point, is SAD!"}, {"text": "The Do Nothing Democrats should be focused on building up our Country, not wasting everyone’s time and energy on BULLSHIT, which is what they have been doing ever since I got overwhelmingly elected in 2016, 223-306. Get a better candidate this time, you’ll need it!"}, {"text": "“Schiff, House Intel Chairman, Got Early Account of Whistle-Blower’s Accusations” \n\nSCHIFF IS A FRAUD! \nhttps://t.co/BNXiq5dsXg https://t.co/PHdh8PBTGb"}, {"text": "LOOK AT THIS PHOTOGRAPH! https://t.co/QQYTqG4KTt"}, {"text": "....He loves our Military and supports our Vets! Democrat Jim Hood will never give us his vote, is anti-Trump and pro-Crooked Hillary. Get Out and Vote for Tate Reeves on November 5th. He has my Complete &amp; Total Endorsement!"}, {"text": "Mississippi, there is a VERY important election for Governor on November 5th. I need you to Get Out and Vote for our Great Republican nominee, @TateReeves. Tate is strong on Crime, tough on Illegal Immigration, and will protect your Second Amendment...."}, {"text": "DEMOCRATS WANT TO STEAL THE ELECTION! #KAG2020 https://t.co/hz6fWLId3L"}, {"text": "The U.S. won a $7.5 Billion award from the World Trade Organization against the European Union, who has for many years treated the USA very badly on Trade due to Tariffs, Trade Barriers, and more. This case going on for years, a nice victory!"}, {"text": "“The Ukraine controversy continues this morning as new documents obtained by @FoxNews show that a former Ukrainian prosecutor said that he was forced to back off looking into a firm tied to Hunter Biden.” @MariaBartiromo  Does anyone other than Fake News protectors have a doubt?"}, {"text": "Keep up the great work Kellie! https://t.co/PcAnK009EW"}, {"text": "Great job Richard! https://t.co/Uv8xgZPshu"}, {"text": "A great book by a brilliant author. Buy it now! https://t.co/L8XC5Nnj4N"}, {"text": "Thank you Hugh! https://t.co/So77AMeK5u"}, {"text": "Book is doing really well. A study in unfairness to a potentially great Justice! https://t.co/i6GwghuEsU"}, {"text": "The Republican Party has never had such support! https://t.co/P6GHgBv3v9"}, {"text": "Schiff is a lying disaster for our Country. He should resign! https://t.co/ytwEy5NasJ"}, {"text": "Schiff is a lowlife who should resign (at least!). https://t.co/nGp9aFP3rX"}, {"text": "Fake News, just like the snakes and gators in the moat. The Media is deranged, they have lost their minds! https://t.co/rk26SXj4il"}, {"text": "https://t.co/2TfEyp1dHX"}, {"text": "Leader McCarthy, we look forward to you soon becoming Speaker of the House. The Do Nothing Dems don’t have a chance! https://t.co/uWPdGJg99F"}, {"text": "95% Approval Rating in the Republican Party, and record setting fundraising that has taken place over the past two weeks. Thank you!"}, {"text": "ELECTION INTERFERENCE!"}, {"text": "Great time at The Villages in Florida today. Sorry we couldn’t get everybody in. I will be back soon! https://t.co/ia87A0sEue"}, {"text": "There wasn’t ANYTHING said wrong in my conversation with the Ukrainian President. This is a Democrat Scam!"}, {"text": "“Trump Fundraising Haul Shows Impeachment Backfiring on Dems” https://t.co/LM1hTQX0lY"}, {"text": "“This is yet again an example of Democrats projecting THEIR criminal acts on President Trump. President Trump is an innocent man. It is a lawless coup attempt against a duly elected President.” @replouiegohmert @BreitbartNews"}, {"text": "DRAIN THE SWAMP! https://t.co/N3FaZ5Dkjq"}, {"text": "Thank you @JennaEllisRives, really well done! https://t.co/N2VsQ8y0rb"}, {"text": "“It was just a congenial phone call, but its become so big. I’ve never seen the Media work so hard with so little.” @greggutfeld @FoxNews  Witch Hunt!"}, {"text": "Today at The Villages in Florida, it was my great honor to sign an Executive Order on protecting and improving Medicare for our Nation’s Seniors. Today’s action is only the latest of many important steps we are taking to dramatically improve healthcare for the American People! https://t.co/nWfn2r10o5"}, {"text": "The Greatest Witch Hunt in the history of our Country! https://t.co/5wvry1rkBT"}, {"text": "\"...blowing MASSIVE holes inside of the theory, the narrative, that Chairman Schiff has been providing to the public.\" @RepLeeZeldin https://t.co/CUJhiKZfgr"}, {"text": "As the President of the United States, I have an absolute right, perhaps even a duty, to investigate, or have investigated, CORRUPTION, and that would include asking, or suggesting, other Countries to help us out!"}, {"text": "Another big loss for the Do Nothing Dems! https://t.co/Pwp7dYdF8e"}, {"text": "The Do Nothing Democrats don’t have time to get it done! https://t.co/2cwyMtT3Gu"}, {"text": "AOC is a Wack Job! https://t.co/LU3hIeek0c"}, {"text": "Great job Jim! https://t.co/JMuE3pRWmk"}, {"text": "We are simultaneously fighting the Fake News Media and their partner, the Democrat Party. Always tough to beat the “Press,” but people are beginning to see how totally CORRUPT they are, and it makes our job a whole lot easier!"}, {"text": "This isn’t about a Campaign, this is about Corruption on a massive scale! https://t.co/DOCvfM8eqi"}, {"text": "“They (Do Nothing Dems) are trying to nullify an election...” Joe diGenova https://t.co/0a7Apd4kUO"}, {"text": "Nancy Pelosi today, on @GMA, actually said that Adam Schiffty Schiff didn’t fabricate my words in a major speech before Congress. She either had no idea what she was saying, in other words lost it, or she lied. Even Clinton lover @GStephanopoulos strongly called her out. Sue her?"}, {"text": "https://t.co/WaLS3cL5ng"}, {"text": "The Washington Times, “Ukraine envoy blows ‘massive hole’ into Democrat accusations. Republicans at hearing find no Trump Pressure.” The Ukrainian President also strongly stated that NO pressure was put on him. Case Closed!"}, {"text": "As President I have an obligation to end CORRUPTION, even if that means requesting the help of a foreign country or countries. It is done all the time. This has NOTHING to do with politics or a political campaign against the Bidens. This does have to do with their corruption!"}, {"text": "Breaking News: Unemployment Rate, at 3.5%, drops to a 50 YEAR LOW. Wow America, lets impeach your President (even though he did nothing wrong!)."}, {"text": "The Whistleblower, who had the facts wrong about the phone call, reached out, and more, to the Democrat controlled House Intelligence Committee. Schiff never told us about this!"}, {"text": "https://t.co/uYyoaCXuqu"}, {"text": "“When your making an unsubstantiated statement that the President is making a claim having to do with quid pro quo, this witness has blown a big hole into that statement. The Ambassador put a dagger in the heart of Schiffs fairytale.”  Rep. Lee Zeldin"}, {"text": "“The witness was asked at least 20 times, and there definitely was no Quid Pro Quo.”  @RepMarkMeadows @FoxNews  Their whole case was built around this, now they no longer mention!"}, {"text": "“I think it’s outrages that a Whistleblower is a CIA Agent.”  Ed Rollins @FoxNews"}, {"text": "WOW, this is big stuff! https://t.co/H12yxMfua3"}, {"text": "Under my Administration, Medicare Advantage premiums next year will be their lowest in the last 13 years. We are providing GREAT healthcare to our Seniors. We cannot let the radical socialists take that away through Medicare for All!"}, {"text": "At the request of @SenThomTillis, I have declared a major disaster for the Great State of North Carolina to help with damages from Hurricane Dorian. Assistance now unlocked to recover stronger than ever! Thom loves N.C,. and so do I!"}, {"text": "I have just officially nominated Poland for entry into the Visa Waiver Program. With this decades long-awaited announcement, we are in the final steps of the process which, when complete, would grant Polish nationals visa-free business and tourism travel to the U.S. &amp; vice versa."}, {"text": "https://t.co/KYEzdMjl2k"}, {"text": "“When your making an unsubstantiated charge that the President of the United States is making a request having to do with quid pro quo, this witness has blown a big hole into that statement.The Ambassador put a dagger in the heart of Schiffs fairytale.”  Rep. Lee Zeldin @FoxNews"}, {"text": "LYIN’ SHIFTY SCHIFF! https://t.co/vSZgFz9fIS"}, {"text": "....it to Congress, and the American people, as though it was the statement of the President of the United States, me. He did it to fool Congress and the public in order to make me look BAD. He is a sick puppy!"}, {"text": "“Adam Schiff’s connection to the Whistleblower is coming to light.” @FoxNews  These facts, and others, make it impossible for the ridiculous impeachment “scam” to go forward! Schiff has also committed a crime, perhaps treason, in making up a horrible statement and reading...."}, {"text": "My daughter Ivanka will be on @trish_regan tonight on @FoxBusiness at 8:00 P.M., following the great @LouDobbs at 7:00. Enjoy!"}, {"text": "Join me at the Target Center in Minneapolis, Minnesota next Thursday, October 10th at 7:00pm! Tickets: https://t.co/xqJzZt7gsp https://t.co/EDkr6JYysX"}, {"text": "Along with Pelosi and her boss AOC, the Do Nothing Democrat “leader.” https://t.co/PILyE1c220"}, {"text": "....of Ukraine, and cannot find any reason to charge the President with high crimes &amp; misdemeanors. This is just a phony Witch Hunt, perpetuated by Democrats to get rid of Trump because they cannot beat him in a fair election.”  Richard Ketay"}, {"text": "“It isn’t often I get angry at the dirty politics of the Democrats in Congress, but this time I am enraged and hope this impeachment charade will backfire on Reps. Pelosi &amp; Schiff, &amp; the Democrats. I have read thoroughly the telephone conversation between Trump &amp; the President..."}, {"text": "“Ex-Envoy testified Ukraine (or the President of Ukraine) never raised Quid Pro Quo concerns with him: source.” @seanhannity @FoxNews  The President of Ukraine also stated that he was NOT PRESSURED by me in any way. END OF CASE!"}, {"text": "Thanks Jim. Would be great to just run our Country! https://t.co/8GcmgQaVYK"}, {"text": "Where is the LameStream Media on this? https://t.co/Qaak5dvyKC"}, {"text": "“Pelosi Blatantly Lies During @GMA Interview About Schiff's Reading of Ukraine Transcript”https://t.co/a6HEwMnEmU"}, {"text": "GREAT BOOK! https://t.co/LrRr1xhS0d"}, {"text": "“Report: ‘Whistleblower’ Never Disclosed Contact with House Intel Panel to Inspector General”https://t.co/Pmhqdgmxba"}, {"text": "Thank you @robertjeffress! https://t.co/GW4hFDbIpj"}, {"text": "https://t.co/N3FaZ5UVI0"}, {"text": "Too bad! https://t.co/UFHAIlhoCe"}, {"text": "https://t.co/GZH38uGdCK"}, {"text": "SHIFTY SCHIFF DUPED BY RUSSIAN PRANKSTERS! https://t.co/CpIL0b5FLW"}, {"text": "Thank you @KimStrassel and @AndrewCMcCarthy! https://t.co/aR6J1KIPRX"}, {"text": "\"NEW EXTREME DEMS NOW RUNNING THE PARTY!\" https://t.co/nEAvcUGpZZ"}, {"text": "The Media is “Fixed” and Corrupt. It bears no relationship to the truth. The @nytimes &amp; @washingtonpost are pure fiction. Totally dishonest reporting!"}, {"text": "The so-called Whistleblower’s account of my perfect phone call is “way off,” not even close. Schiff and Pelosi never thought I would release the transcript of the call. Got them by surprise, they got caught. This is a fraud against the American people!"}, {"text": "Somebody please wake up Mitt Romney and tell him that my conversation with the Ukrainian President was a congenial and very appropriate one, and my statement on China pertained to corruption, not politics. If Mitt worked this hard on Obama, he could have won. Sadly, he choked!"}, {"text": "Mitt Romney never knew how to win. He is a pompous “ass” who has been fighting me from the beginning, except when he begged me for my endorsement for his Senate run (I gave it to him), and when he begged me to be Secretary of State (I didn’t give it to him). He is so bad for R’s!"}, {"text": "THIS IS THE REAL STORY! @GreggJarrett https://t.co/aWrTySHJqL"}, {"text": "\"Schiff is a FRAUD!\" @dbongino https://t.co/Izexu2Nb1S"}, {"text": "https://t.co/CP7N9ASHKJ"}, {"text": "Not only are the Do Nothing Democrats interfering in the 2020 Election, but they are continuing to interfere in the 2016 Election. They must be stopped!"}, {"text": "I’m hearing that the Great People of Utah are considering their vote for their Pompous Senator, Mitt Romney, to be a big mistake. I agree! He is a fool who is playing right into the hands of the Do Nothing Democrats! #IMPEACHMITTROMNEY"}, {"text": "No Kevin, Jeff Flake is better! https://t.co/IyENBffEjp"}, {"text": "So Crooked Hillary Clinton can delete and acid wash 33,000 emails AFTER getting a Subpoena from the United States Congress, but I can’t make one totally appropriate telephone call to the President of Ukraine? Witch Hunt!"}, {"text": "Mitt, get off the stage, you’ve had your turn (twice)! https://t.co/zz6TA6XoGe"}, {"text": "Schiff and the Do Nothing Dems have lost all credibility...but the corrupt Media is working hard to keep them in the game! https://t.co/VufsDqYUVu"}, {"text": "“President Trump would be negligent if he did not bring this matter, Biden, up. If the V.P. of the U.S. is self enriching &amp; engaged in criminal behavior, at a minimum corrupt behavior, it ought to be looked at.” Peter Schweizer, author, “Secret Empires.” @marklevinshow"}, {"text": "The first so-called second hand information “Whistleblower” got my phone conversation almost completely wrong, so now word is they are going to the bench and another “Whistleblower” is coming in from the Deep State, also with second hand info. Meet with Shifty. Keep them coming!"}, {"text": "https://t.co/F84WZ5LveS"}, {"text": "https://t.co/UBsZoZb20g"}, {"text": "https://t.co/uElgSLSoJ8"}, {"text": "The great Scam is being revealed! https://t.co/Ny429UTVUn"}, {"text": "The Do Nothing Democrats are being exposed! https://t.co/Z5G5oEQOqs"}, {"text": "95% Approval Rating in Republican Party. Thank you!"}, {"text": "The Democrats are lucky that they don’t have any Mitt Romney types. They may be lousy politicians, with really bad policies (Open Borders, Sanctuary Cities etc.), but they stick together!"}, {"text": "It is INCREDIBLE to watch and read the Fake News and how they pull out all stops to protect Sleepy Joe Biden and his thrown out of the Military son, Hunter, who was handed $100,000 a month (Plus,Plus) from a Ukrainian based company, even though he had no experience in energy,..."}, {"text": "....and separately got 1.5 Billion Dollars from China despite no experience and for no apparent reason. There is NO WAY these can be legitimate transactions? As lawyers &amp; others have stated, as President, I have an OBLIGATION to look into possible, or probable, CORRUPTION!"}, {"text": "....And by the way, I would LOVE running against 1% Joe Biden - I just don’t think it’s going to happen. Sleepy Joe won’t get to the starting gate, &amp; based on all of the money he &amp; his family probably “extorted,” Joe should hang it up. I wouldn’t want him dealing with China &amp; U!"}, {"text": "The Biden family was PAID OFF, pure and simple! The fake news must stop making excuses for something that is totally inexcusable. Sleepy Joe said he never spoke to the Ukrainian company, and then the picture came out where he was playing golf with the company boss and Hunter....."}, {"text": "#DONOTHINGDEMOCRATS"}, {"text": "Going to Louisiana on Friday night for a big Republican Rally. Keep Democrat Governor Edwards under 50%, force a runoff, and have a great new Republican Governor! Voting on Saturday. Information for Rally to follow."}, {"text": "https://t.co/Q6LzFFTLyX"}, {"text": "https://t.co/Xsk50hrvvW"}, {"text": "Will be in Minnesota on Thursday night. Massive response, crowd and enthusiasm (actually, all over the Country) will be beyond belief! Same thing in Louisiana on Friday. Big and Bold USA!"}, {"text": "DRAIN THE SWAMP!"}, {"text": "Democrat lawyer is same for both Whistleblowers? All support Obama and Crooked Hillary. Witch Hunt! https://t.co/KL78g24AXx"}, {"text": "Good job, I must say, by Bob Woodward on “Deface the Nation.” The CBS no name host(ess), and other guest, Peter Baker of The Failing New York Times, were totally biased, boring and wrong (as usual), but Woodward was cool, calm and interesting. Thank you Bob!"}, {"text": "Join me at the Target Center in Minneapolis, Minnesota this Thursday, October 10th at 7:00pm! Tickets: https://t.co/xqJzZt7gsp https://t.co/3YWJOo6MnZ"}, {"text": "Sleepy Eyes Chuck Todd of “Meet the Press” had a total meltdown in his interview with highly reaspected Senator @RonJohnsonWI. Seems that a not very bright Chuck just wasn’t getting the answers he was looking for in order to make me look as bad as possible. I did NOTHING wrong!"}, {"text": "Gerry Baker of @WSJatLarge  “Do you think what you’ve seen rises to the level of impeachment?” Ken Starr, Clinton Special Prosecutor. “I don’t!”"}, {"text": "Unemployment Rate just dropped to 3.5%, the lowest in more that 50 years. Is that an impeachable event for your President?"}, {"text": ".@60Minutes “forgot” to report that we are helping the great farmers of the USA to the tune of 28 Billion Dollars, for the last two years, paid for out of Tariffs paid to the United States by China for targeting the farmer. They devalued their currency, therefore paying the cost!"}, {"text": "Nancy Pelosi knew of all of the many Shifty Adam Schiff lies and massive frauds perpetrated upon Congress and the American people, in the form of a fraudulent speech knowingly delivered as a ruthless con, and the illegal meetings with a highly partisan “Whistleblower” &amp; lawyer..."}, {"text": "....This makes Nervous Nancy every bit as guilty as Liddle’ Adam Schiff for High Crimes and Misdemeanors, and even Treason. I guess that means that they, along with all of those that evilly “Colluded” with them, must all be immediately Impeached!"}, {"text": "The United States was supposed to be in Syria for 30 days, that was many years ago. We stayed and got deeper and deeper into battle with no aim in sight. When I arrived in Washington, ISIS was running rampant in the area. We quickly defeated 100% of the ISIS Caliphate,....."}, {"text": ".....again said “NO,” thinking, as usual, that the U.S. is always the “sucker,” on NATO, on Trade, on everything. The Kurds fought with us, but were paid massive amounts of money and equipment to do so. They have been fighting Turkey for decades. I held off this fight for...."}, {"text": "....including capturing thousands of ISIS fighters, mostly from Europe. But Europe did not want them back, they said you keep them USA! I said “NO, we did you a great favor and now you want us to hold them in U.S. prisons at tremendous cost. They are yours for trials.” They....."}, {"text": "....almost 3 years, but it is time for us to get out of these ridiculous Endless Wars, many of them tribal, and bring our soldiers home. WE WILL FIGHT WHERE IT IS TO OUR BENEFIT, AND ONLY FIGHT TO WIN. Turkey, Europe, Syria, Iran, Iraq, Russia and the Kurds will now have to....."}, {"text": "...figure the situation out, and what they want to do with the captured ISIS fighters in their “neighborhood.” They all hate ISIS, have been enemies for years. We are 7000 miles away and will crush ISIS again if they come anywhere near us!"}, {"text": "We just WON the big court case on Net Neutrality Rules! A great win for the future and speed of the internet. Will lead to many big things including 5G. Congratulations to the FCC and its Chairman, Ajit Pai!"}, {"text": "“IG: DECLASSIFIED INFORMATION CONTRADICTS THE WHISTLEBLOWER.” @foxandfriends  But why are people surprised? The “partisan” Whistleblower was very wrong on what was said on my perfect, “no pressure,” call with the Ukrainian President. Bring in another Whistleblower from the bench!"}, {"text": "“Incomes much higher under Trump than Bush, Obama.” @foxandfriends And almost everything else is better also (except I am driving the Deep State, and the Radical Left, Do Nothing Democrats, CRAZY)!"}, {"text": "Heritage Foundation “These numbers are blockbusters. Just since Donald Trump took office, Median Family Incomrs are up over $4,100. In 8 years under President Obama, they only went up $1000. In one third the time, President Trump has increased incomes 4 times as much, and that..."}, {"text": "....doesn’t even include the almost $2000 that the families got from the Trump Tax Cut.” Stephen Moore, Freedomworks  That means $5000 to $6000 more in disposable yearly income that Americans have right now because of President Trump!"}, {"text": "The Radical Left Democrats have failed on all fronts, so now they are pushing local New York City and State Democrat prosecutors to go get President Trump. A thing like this has never happened to any President before. Not even close!"}, {"text": "I was elected on getting out of these ridiculous endless wars, where our great Military functions as a policing operation to the benefit of people who don’t even like the USA. The two most unhappy countries at this move are Russia &amp; China, because they love seeing us bogged....."}, {"text": "....down, watching over a quagmire, &amp; spending big dollars to do so. When I took over, our Military was totally depleted. Now it is stronger than ever before. The endless and ridiculous wars are ENDING! We will be focused on the big picture, knowing we can always go back &amp; BLAST!"}, {"text": "....the captured ISIS fighters and families. The U.S. has done far more than anyone could have ever expected, including the capture of 100% of the ISIS Caliphate. It is time now for others in the region, some of great wealth, to protect their own territory. THE USA IS GREAT!"}, {"text": "As I have stated strongly before, and just to reiterate, if Turkey does anything that I, in my great and unmatched wisdom, consider to be off limits, I will totally destroy and obliterate the Economy of Turkey (I’ve done before!). They must, with Europe and others, watch over..."}, {"text": "\"The Truth About Impeachment\"\n@SteveHiltonx @NextRevFNC https://t.co/3Pe2zClfUK"}, {"text": "Thank you @HeyTammyBruce! https://t.co/WYtJQmWv26"}, {"text": "https://t.co/4zENOQPQ11"}, {"text": "“There are no felonies, there are no Impeachable offenses. The Constitution’s very clear that you need bribery, treason, or other high crimes and misdemeanors. You can’t be impeached for the conduct that’s been alleged in this case.” @AlanDersh Dershowitz. @seanhannity  A Scam!"}, {"text": "Great book! https://t.co/i6GwghuEsU"}, {"text": "Adam should be Impeached! https://t.co/q7YRUWsJxy"}, {"text": "Thank you Joni! https://t.co/1DoUqOvOpp"}, {"text": "The lightweight mayor is hurting the great police and other wonderful supporters. 72,000 ticket requests already. Dump Frey and Omar! Make America Great Again! https://t.co/ibTqvSbsbn"}, {"text": "So many people conveniently forget that Turkey is a big trading partner of the United States, in fact they make the structural steel frame for our F-35 Fighter Jet. They have also been good to deal with, helping me to save many lives at Idlib Province, and returning, in very....."}, {"text": ".....good health, at my request, Pastor Brunson, who had many years of a long prison term remaining. Also remember, and importantly, that Turkey is an important member in good standing of NATO. He is coming to the U.S. as my guest on November 13th. #ENDENDLESSWARS"}, {"text": "We may be in the process of leaving Syria, but in no way have we Abandoned the Kurds, who are special people and wonderful fighters. Likewise our relationship with Turkey, a NATO and Trading partner, has been very good. Turkey already has a large Kurdish population and fully...."}, {"text": "....understands that while we only had 50 soldiers remaining in that section of Syria, and they have been removed, any unforced or unnecessary fighting by Turkey will be devastating to their economy and to their very fragile currency. We are helping the Kurds financially/weapons!"}, {"text": "I would love to send Ambassador Sondland, a really good man and great American, to testify, but unfortunately he would be testifying before a totally compromised kangaroo court, where Republican’s rights have been taken away, and true facts are not allowed out for the public...."}, {"text": "....to see. Importantly, Ambassador Sondland’s tweet, which few report, stated, “I believe you are incorrect about President Trump’s intentions. The President has been crystal clear: no quid pro quo’s of any kind.” That says it ALL!"}, {"text": "I think that Crooked Hillary Clinton should enter the race to try and steal it away from Uber Left Elizabeth Warren. Only one condition. The Crooked one must explain all of her high crimes and misdemeanors including how &amp; why she deleted 33,000 Emails AFTER getting “C” Subpoena!"}, {"text": "Thank you to Lt. Bob Kroll of the great Minneapolis Police Department for your kind words on @foxandfriends. The Police are fighting the Radical Left Mayor, and his ridiculous Uniform Ban. Actually, I LOVE the Cops for Trump shirts. Want to bring some home. I am with you 100%!!!!"}, {"text": "Someone please tell the Radical Left Mayor of Minneapolis that he can’t price out Free Speech. Probably illegal! I stand strongly &amp; proudly with the great Police Officers and Law Enforcement of Minneapolis and the Great State of Minnesota! See you Thursday Night!"}, {"text": "Get your great T-Shirts, “Cops for Trump,” at https://t.co/pmhDDXsIlx  REALLY NICE! Thank you to Minneapolis Police Officers &amp; Union! @foxandfriends"}, {"text": "https://t.co/bh1FyxfUiA"}, {"text": "Hasn’t Adam Schiff been fully discredited by now? Do we have to continue listening to his lies?"}, {"text": "Friday night in Louisiana will be Great. Big crowd expected. Republicans must get out and vote for either of our two incredible candidates (@DocAbraham &amp; @EddieRispone) so we can stop Left Leaning Governor John Bel Edwards from getting over 50%. We will easily win the runoff! https://t.co/TRiTu71ny2"}, {"text": "Radical Left Dem Mayor of Minneapolis, Jacob Frey, is doing everything possible to stifle Free Speech despite a record sell-out crowd at the Target Center. Presidents Clinton and Obama paid almost nothing! The Minneapolis Police have been incredible...."}, {"text": "....In fact, the “Cops For Trump” T-shirt Web Site CRASHED because of incredible volume, but is now back up and running. Proceeds go to the Police Union Charities. See you on Thursday night in Minneapolis!"}, {"text": "The U.S. Border is SECURE! https://t.co/h9EPUPL1uS"}, {"text": "This is just the beginning, thank you to @ByronYork! https://t.co/1ceplqe5MZ"}, {"text": "....If there is a Runoff in Louisiana, you will have a great new Republican Governor who will Cut your Taxes and Car Insurance, and do a fabulous job for you and your family. Vote Republican, the Party of Honest Abe Lincoln!"}, {"text": "Big Rally in Louisiana on Friday night. Must force a runoff with a Liberal Democrat Governor, John Bel Edwards, who has let your Taxes and Car Insurance get too high, and will never protect your 2nd Amendment. Vote for one of our two great Republicans on Saturday, force a runoff!"}, {"text": "Gasoline Prices in the State of California are MUCH HIGHER than anywhere else in the Nation ($2.50 vs. $4.50). I guess those very expensive and unsafe cars that they are mandating just aren’t doing the trick! Don’t worry California, relief is on the way. The State doesn’t get it!"}, {"text": "The Greatest Witch Hunt in the history of the USA! https://t.co/6FW11oLBv3"}, {"text": "“Bob Mueller was pursuing the FBI Director job when he met with President Trump in 2017, Administration officials say.” @FoxNews  Bret Baier and Jake Gibson @seanhannity This is true even though Mueller denied it!"}, {"text": "Wow, Just Breaking: “The (big deal) Whistleblower had a ‘PROFESSIONAL TIE’ to 2020 Democratic Candidate.” Washington Examiner, @ByronYork  In other words, was working with someone who was potentially running against me. Why wasn’t this reported by the ICIG? A Witch Hunt Scam!"}, {"text": "https://t.co/jZLa4vWXAZ"}, {"text": "https://t.co/ap9wN7wkj6"}, {"text": "So amazing! https://t.co/UG3DaSkmUc"}, {"text": "A Total Scam by the Do Nothing Democrats. For the good of the Country, this Wirch Hunt should end now! https://t.co/G2nPapozye"}, {"text": ".....The Whistleblower’s lawyer is a big Democrat. The Whistleblower has ties to one of my DEMOCRAT OPPONENTS. Why does the ICIG allow this scam to continue?"}, {"text": "The Whistleblower’s facts have been so incorrect about my “no pressure” conversation with the Ukrainian President, and now the conflict of interest and involvement with a Democrat Candidate, that he or she should be exposed and questioned properly. This is no Whistleblower....."}, {"text": "He should be Impeached for Fraud! https://t.co/lu3xKFQaON"}, {"text": "So make all Member Countries pay, not just the United States! https://t.co/IVbE4MqBVl"}, {"text": "Fighting between various groups that has been going on for hundreds of years. USA should never have been in Middle East. Moved our 50 soldiers out. Turkey MUST take over captured ISIS fighters that Europe refused to have returned. The stupid endless wars, for us, are ending! https://t.co/Fbcem9i55Z"}, {"text": "The United States has spent EIGHT TRILLION DOLLARS fighting and policing in the Middle East. Thousands of our Great Soldiers have died or been badly wounded. Millions of people have died on the other side. GOING INTO THE MIDDLE EAST IS THE WORST DECISION EVER MADE....."}, {"text": "....IN THE HISTORY OF OUR COUNTRY! We went to war under a false &amp; now disproven premise, WEAPONS OF MASS DESTRUCTION. There were NONE! Now we are slowly &amp; carefully bringing our great soldiers &amp; military home. Our focus is on the BIG PICTURE! THE USA IS GREATER THAN EVER BEFORE!"}, {"text": "The Do Nothing Democrats are Con Artists, only looking to hurt the Republican Party and President. Their total focus is 2020, nothing more, and nothing less. The good news is that WE WILL WIN!!!!"}, {"text": "....No Pressure at all said Ukraine! Very congenial, a perfect call. The Whistleblower and others spoke BEFORE seeing the Transcript. Now they must apologize to me and stop this ridiculous impeachment!"}, {"text": "The so-called Whistleblower, before knowing I was going to release the exact Transcript, stated that my call with the Ukrainian President was “crazy, frightening, and completely lacking in substance related to national security.” This is a very big Lie. Read the Transcript!"}, {"text": "They don’t have a clue, but I do. The USA is doing great despite the Fed! https://t.co/85aW2YGehY"}, {"text": "Great support from GOP in fighting the Radical Left, Do Nothing Democrats! https://t.co/qjskHYkQpD"}, {"text": "But we are now, for the first time, giving companies a better alternative! https://t.co/jJFKywyIGw"}, {"text": "So true Don, and this was a big lie. Look what happened to Friends of Trump, for less. Can’t let this pass! https://t.co/u2To514DNq"}, {"text": "Adam Schiff is a disgrace to our Country! https://t.co/4pM3j1GLev"}, {"text": "Why doesn’t the ICIG do something about this Scam? He should have never let it start, a Dem Hoax! https://t.co/UCbObppWbA"}, {"text": "True. Should have never been there in the first place! https://t.co/kVXtpB23Wy"}, {"text": "Crooked Hillary should try it again! https://t.co/UjfIpZp1FA"}, {"text": "President Obama said that he did not have the right to sign DACA, that it will never hold up in court. He signed it anyway! If the Supreme Court upholds DACA, it gives the President extraordinary powers, far greater than ever thought. If they do what is right and do not let......"}, {"text": "....DACA stand, with all of its negative legal implications, the Republicans and Democrats will have a DEAL to let them stay in our Country, in very short order. It would actually benefit DACA, and be done the right way!"}, {"text": "So why is someone a good or great President if they needed to Spy on someone else’s Campaign in order to win (that didn’t work out so well), and if they were unable to fill 142 important Federal Judgeships (a record by far), handing them all to me to choose. Will have 182 soon!"}, {"text": "Only 25 percent want the President Impeached, which is pretty low considering the volume of Fake News coverage, but pretty high considering the fact that I did NOTHING wrong. It is all just a continuation of the greatest Scam and Witch Hunt in the history of our Country!"}, {"text": "So pathetic to see Sleepy Joe Biden, who with his son, Hunter, and to the detriment of the American Taxpayer, has ripped off at least two countries for millions of dollars, calling for my impeachment - and I did nothing wrong. Joe’s Failing Campaign gave him no other choice!"}, {"text": "Sleepy Joe Biden! https://t.co/oZtytImXqq"}, {"text": "The hardest thing I have to do as President... https://t.co/6bzwh78I00"}, {"text": "https://t.co/I6VsoDIQQp"}, {"text": "“I don’t think it’s a Whistleblower at all. I think this is an anonymous source for the Democratic Staff in the House of Representatives. This is an insult to real Whistleblowers. Actual Whistleblowers go on to have their whole lives upended.” John Kiriakou  @TuckerCarlson"}, {"text": "A different take! https://t.co/XKnQ6XTF0k"}, {"text": "Impeached for what, having created the greatest Economy in the history of our Country, building our strongest ever Military, Cutting Taxes too much? https://t.co/LWxfEcRmj4"}, {"text": "In case the Kurds or Turkey lose control, the United States has already taken the 2 ISIS militants tied to beheadings in Syria, known as the Beetles, out of that country and into a secure location controlled by the U.S. They are the worst of the worst!"}, {"text": "“Ukrainian President Volodymyr Zelensky told reporters Thursday his controversial July call with President Trump involved no bribe, blackmail or quid pro quo, as impeachment-minded Democrats claim.” This should immediately end the talk of impeachment! \nhttps://t.co/0mOTK4dNC3"}, {"text": "From the day I announced I was running for President, I have NEVER had a good @FoxNews Poll. Whoever their Pollster is, they suck. But @FoxNews is also much different than it used to be in the good old days. With people like Andrew Napolitano, who wanted to be a Supreme...."}, {"text": "...Court Justice &amp; I turned him down (he’s been terrible ever since), Shep Smith, @donnabrazile (who gave Crooked Hillary the debate questions &amp; got fired from @CNN), &amp; others, @FoxNews doesn’t deliver for US anymore. It is so different than it used to be. Oh well, I’m President!"}, {"text": "Where is Hunter Biden? He has disappeared while the Fake News protects his Crooked daddy! https://t.co/Gtwn0nxOTt"}, {"text": "Turkey has been planning to attack the Kurds for a long time. They have been fighting forever. We have no soldiers or Military anywhere near the attack area. I am trying to end the ENDLESS WARS. Talking to both sides. Some want us to send tens of thousands of soldiers to...."}, {"text": "....the area and start a new war all over again. Turkey is a member of NATO. Others say STAY OUT, let the Kurds fight their own battles (even with our financial help). I say hit Turkey very hard financially &amp; with sanctions if they don’t play by the rules! I am watching closely."}, {"text": "Thank you to @OANN One America News for your fair coverage and brilliant reporting. It is appreciated by many people trying so hard to find a new, consistent and powerful VOICE! See you tonight at the Big Rally in Minneapolis."}, {"text": "The President of the Ukraine just stated again, in the strongest of language, that President Trump applied no pressure and did absolutely nothing wrong. He used the strongest language possible. That should end this Democrat Scam, but it won’t, because the Dems &amp; Media are FIXED!"}, {"text": "Why isn’t the IG investigating his so-called Whistleblower? All bad info!"}, {"text": "Big day of negotiations with China. They want to make a deal, but do I? I meet with the Vice Premier tomorrow at The White House."}, {"text": "https://t.co/HZzDQY5QqV"}, {"text": "https://t.co/sI5hZ81ASL"}, {"text": "....We have one of three choices: Send in thousands of troops and win Militarily, hit Turkey very hard Financially and with Sanctions, or mediate a deal between Turkey and the Kurds!"}, {"text": "We defeated 100% of the ISIS Caliphate and no longer have any troops in the area under attack by Turkey, in Syria. We did our job perfectly! Now Turkey is attacking the Kurds, who have been fighting each other for 200 years...."}, {"text": "WOW, THANK YOU Minneapolis, Minnesota — on my way! #KAG2020 https://t.co/Czl6GbCCxN"}, {"text": "The joint statement released with President Bolsonaro in March makes absolutely clear that I support Brazil beginning the process for full OECD membership. The United States stands by that statement and stands by @jairbolsonaro. This article is FAKE NEWS! https://t.co/Hym9ZATHjt"}, {"text": "A GREAT evening in Minneapolis, Minnesota with incredible American Patriots. THANK YOU! https://t.co/b3UQEo0wPq"}, {"text": "Over the next 13 months, we are going to fight with all of our heart and soul – and we are going to win the Great State of Minnesota in 2020! #TrumpMinneapolis #KAG2020 https://t.co/c3FQnrPJWr"}, {"text": "Good things are happening at China Trade Talk Meeting. Warmer feelings than in recent past, more like the Old Days. I will be meeting with the Vice Premier today. All would like to see something significant happen!"}, {"text": "I will be in Louisiana tonight (Love it!) to get Republicans to vote for either of our two great Republican Candidates and force a run off with John Bel Edwards, who has done a really poor job of tax cutting, car insurance cost (worst in USA), &amp; is suspect on your 2nd Amendment!"}, {"text": "One of the great things about the China Deal is the fact that, for various reasons, we do not have to go through the very long and politically complex Congressional Approval Process. When the deal is fully negotiated, I sign it myself on behalf of our Country. Fast and Clean!"}, {"text": "Will be with our two GREAT Senators, @SenJohnKennedy &amp; @SenBillCassidy, tonight in Louisiana. These two hard working, really smart men, love their Country and love their State. We will hopefully add a Great New Republican Governor to the beautiful Louisiana mix! See you tonight!"}, {"text": "What a disgraceful legal system for this guy to still be around after all of these years. A vicious killer who destroyed so many great people &amp; families! https://t.co/GTHdZ7BN6B"}, {"text": "A great evening in beautiful Minnesota! https://t.co/xgfAKaRSlM"}, {"text": "Do you believe this?  A total Scam! https://t.co/ihJmne0AbW"}, {"text": "The Do Nothing Democrats. Thanks Vicky! https://t.co/WEZgrvobs3"}, {"text": "Amazing Evening! https://t.co/jVTW8sRJpf"}, {"text": "A Giant Scam! https://t.co/Go4TffoEaq"}, {"text": "So Great! https://t.co/WZSY7E0A2M"}, {"text": "Really good news! https://t.co/dbc6AgzNPx"}, {"text": "We love you @MinneapolisPD, THANK YOU! #LESM https://t.co/fkOL8dCNP2"}, {"text": "A terrible and very dishonest person! https://t.co/bomdDcHTT4"}, {"text": "Kevin McAleenan has done an outstanding job as Acting Secretary of Homeland Security. We have worked well together with Border Crossings being way down. Kevin now, after many years in Government, wants to spend more time with his family and go to the private sector...."}, {"text": "....Congratulations Kevin, on a job well done! I will be announcing the new Acting Secretary next week. Many wonderful candidates!"}, {"text": "Just landed in Louisiana! Vote against John Bel Edwards, he has the worst jobs record in the United States. Louisiana will do much better by electing a REPUBLICAN. See everyone soon! @LAGOP https://t.co/V1rVXEEuso"}, {"text": "Is he leaving due to bad ratings, or some other less important reason? https://t.co/XBr7xVgarc"}, {"text": "WHERE’S HUNTER?"}, {"text": "So funny to watch Steve Kerr grovel and pander when asked a simple question about China. He chocked, and looks weak and pathetic. Don’t want him at the White House!"}, {"text": "“I never saw so many subpoenas!” @ShannonBream  @FoxNews  The Democrats have gone Crazy. Just read the Transcript, or listen to the New Ukraine President’s statement, NO PRESSURE! This is a Democrat Con Job. Impeach Schiff for FRAUD!"}, {"text": "Louisiana REPUBLICANS, thank you for a great evening. Get out TOMORROW and VOTE REPUBLICAN! Send the Radical Democrat establishment a loud and clear message that you are going to FIRE your Democrat Governor, John Bel Edwards and send a Great Republican to the Governor’s Mansion! https://t.co/4GHVNz8lda"}, {"text": "LOUISIANA — Tomorrow, you will head to the polls and VOTE to REPLACE Liberal Democrat John Bel Edwards with a great new REPUBLICAN Governor! Get out and vote for either @DocAbraham or @EddieRispone (BOTH GREAT)! https://t.co/Qyu6z9nZXr"}, {"text": "“Schiff aides worked with Whistleblower.” @foxandfriends  @RepLeeZeldin  Schiff is a lying mess!"}, {"text": "The case of Major Mathew Golsteyn is now under review at the White House. Mathew is a highly decorated Green Beret who is being tried for killing a Taliban bombmaker. We train our boys to be killing machines, then prosecute them when they kill! @PeteHegseth"}, {"text": "....Other aspects of the deal are also great - technology, financial services, 16-20 Billion in Boeing Planes etc., but WOW, the Farmers really hit pay dirt! @ChuckGrassley @joniernst @debfisher @BenSasse  Thank you to all Republicans in Congress for your invaluable help!"}, {"text": "The deal I just made with China is, by far, the greatest and biggest deal ever made for our Great Patriot Farmers in the history of our Country. In fact, there is a question as to whether or not this much product can be produced? Our farmers will figure it out. Thank you China!"}, {"text": "Louisiana, get out and vote REPUBLICAN before going to the big game today. A runoff will be a tremendous win for your Great State - lower taxes and car insurance, and better protection of your 2nd Amendment! Fantastic being with you last night!"}, {"text": "So now they are after the legendary “crime buster” and greatest Mayor in the history of NYC, Rudy Giuliani. He may seem a little rough around the edges sometimes, but he is also a great guy and wonderful lawyer. Such a one sided Witch Hunt going on in USA. Deep State. Shameful!"}, {"text": "https://t.co/0DTxsaGKZ1"}, {"text": "https://t.co/YBmYOsGdK3 https://t.co/LWCWvpeIqn"}, {"text": "Happy National Farmers Day! https://t.co/zqhaDCikQg"}, {"text": "That is the real story! https://t.co/fG3zvMIaxp"}, {"text": "Start thinking about getting bigger tractors! https://t.co/MhmvNhAA4r"}, {"text": "The Endless Wars Must End!"}, {"text": "The Governor of Louisiana, John Bel Edwards, has done a poor job. NOW HE IS IN A RUNOFF WITH A GREAT REPUBLICAN, @EddieRispone. Thank you Louisiana! 66% down to 47% after I explained what a bad job the Governor was doing."}, {"text": "The same people that got us into the Middle East Quicksand, 8 Trillion Dollars and many thousands of lives (and millions of lives when you count the other side), are now fighting to keep us there. Don’t listen to people that haven’t got a clue. They have proven to be inept!"}, {"text": "Congratulations to the Great State of Louisiana. A big night. You will soon have a new and wonderful Governor, @EddieRispone. Your Taxes and Car Insurance Payments will go DOWN!"}, {"text": "A despicable human being! https://t.co/3KpgUuRaXU"}, {"text": "The Media is not talking about the big Republican victory last night in Louisiana where a sitting Democrat Governor was forced into a runoff by not getting 50%. Big upset! Now @EddieRispone, who will be a great Governor, will win!"}, {"text": "Very smart not to be involved in the intense fighting along the Turkish Border, for a change. Those that mistakenly got us into the Middle East Wars are still pushing to fight. They have no idea what a bad decision they have made. Why are they not asking for a Declaration of War?"}, {"text": ".....The Kurds and Turkey have been fighting for many years. Turkey considers the PKK the worst terrorists of all. Others may want to come in and fight for one side or the other. Let them! We are monitoring the situation closely. Endless Wars!"}, {"text": "Do you remember two years ago when Iraq was going to fight the Kurds in a different part of Syria. Many people wanted us to fight with the Kurds against Iraq, who we just fought for. I said no, and the Kurds left the fight, twice. Now the same thing is happening with Turkey......"}, {"text": "Dealing with @LindseyGrahamSC and many members of Congress, including Democrats, about imposing powerful Sanctions on Turkey. Treasury is ready to go, additional legislation may be sought. There is great consensus on this. Turkey has asked that it not be done. Stay tuned!"}, {"text": "Where’s Hunter? He has totally disappeared! Now looks like he has raided and scammed even more countries! Media is AWOL."}, {"text": "We have become a far greater Economic Power than ever before, and we are using that power for WORLD PEACE!"}, {"text": "Happy Birthday @USNavy! https://t.co/H0lNgAdogV"}, {"text": "The Democrats are going to lose a lot of House Seats because of their Fraudulent use of Impeachment. Schiff fabricated phone call, a crime. Democrat Senate Seats will also be put at risk, even some that were supposedly safe. Look at Louisiana last night, North Carolina last week!"}, {"text": "....I agreed not to increase Tariffs from 25% to 30% on October 15th. They will remain at 25%. The relationship with China is very good. We will finish out the large Phase One part of the deal, then head directly into Phase Two. The Phase One Deal can be finalized &amp; signed soon!"}, {"text": "My deal with China is that they will IMMEDIATELY start buying very large quantities of our Agricultural Product, not wait until the deal is signed over the next 3 or 4 weeks. THEY HAVE ALREADY STARTED! Likewise financial services and other deal aspects, start preparing...."}, {"text": "CHINA HAS ALREADY BEGUN AGRICULTURAL PURCHASES FROM OUR GREAT PATRIOT FARMERS &amp; RANCHERS!"}, {"text": ".....BY THE WAY, DON’T CALL ME AGAIN, I’LL CALL YOU WHEN YOU’VE DONE WHAT I’VE ASKED.’” A reminder, that wasn’t just stupid, it was FALSE.” @greggutfeld @GregGutfeldShow @FoxNews  I never said this. Schiff made it up and read it to Congress &amp; the American People. End Witch Hunt!"}, {"text": "“Congressman Adam Schiff, who when seeing the REAL Ukraine phone call Transcript decided he’d better make up one of his own. ‘I’m going to say this only SEVEN times, so you better listen good. I want you to MAKE UP DIRT ON MY POLITICAL OPPONENT, UNDERSTAND, LOTS OF IT, AND....."}, {"text": ".@marklevinshow on @FoxNews is doing a big show tonight on the Democrat’s Impeachment Scam. 10:00 P.M. No guests, just Mark. He is angry (like so many others!). At 9:00 P.M. on @FoxNews, Steve Hilton is looking into the Crooked Bidens. Where’s Hunter?"}, {"text": "The U.S. has the worst of the ISIS prisoners. Turkey and the Kurds must not let them escape. Europe should have taken them back after numerous requests. They should do it now. They will never come to, or be allowed in, the United States!"}, {"text": "Somebody please explain to Chris Wallace of Fox, who will never be his father (and my friend), Mike Wallace, that the Phone Conversation I had with the President of Ukraine was a congenial &amp; good one. It was only Schiff’s made up version of that conversation that was bad!"}, {"text": "“Serial killers get more Due Process than the Democrats give to the President of the United States.” @marklevinshow"}, {"text": "“The Democrats are trashing this President, &amp; in the process, trashing the U.S. Constitution. Frankly, the American People need to wake up to the reality that the Democrats are so drunk on power that they’re willing to destroy this Constitutional Republic.” @GrahamLedger @OANN"}, {"text": "....Democrat’s game was foiled when we caught Schiff fraudulently making up my Ukraine conversation, when I released the exact conversation Transcript, and when Ukrainian President and the Foreign Minister said there was NO PRESSURE, very normal talk! A total Impeachment Scam!"}, {"text": "Adam Schiff now doesn’t seem to want the Whistleblower to testify. NO! Must testify to explain why he got my Ukraine conversation sooo wrong, not even close. Did Schiff tell him to do that? We must determine the Whistleblower’s identity to determine WHY this was done to the USA.."}, {"text": "Former Democrat Senator Harry Reid just stated that Donald Trump is very smart, much more popular than people think, is underestimated, and will be hard to beat in the 2020 Election. Thank you Harry, I agree!"}, {"text": "....Kurds may be releasing some to get us involved. Easily recaptured by Turkey or European Nations from where many came, but they should move quickly. Big sanctions on Turkey coming! Do people really think we should go to war with NATO Member Turkey? Never ending wars will end!"}, {"text": "Brian Kilmeade over at @foxandfriends got it all wrong. We are not going into another war between people who have been fighting with each other for 200 years. Europe had a chance to get their ISIS prisoners, but didn’t want the cost. “Let the USA pay,” they said..."}, {"text": "The same people who got us into the Middle East mess are the people who most want to stay there!"}, {"text": "Happy Columbus Day!"}, {"text": "https://t.co/cvCBBovvFP"}, {"text": "https://t.co/kDd9fzjPAh"}, {"text": "https://t.co/09bac03RX6"}, {"text": "Vote for good guy @seanspicer tonight on Dancing With The Stars. He has always been there for us!"}, {"text": "Will be looking into the Scott Hapgood case, and the Island of Anguilla. Something looks and sounds very wrong. I know Anguilla will want to see this case be properly and justly resolved! @foxandfriends @SteveDucey  @ainsleyearhardt"}, {"text": "https://t.co/Q6NhPEz2Qv"}, {"text": "Wow! Hunter Biden is being forced to leave a Chinese Company. Now watch the Fake News wrap their greasy and very protective arms around him. Only softball questions of him please!"}, {"text": "America First!"}, {"text": "The Fox Impeachment poll has turned out to be incorrect. This was announced on Friday. Despite this, the Corrupt New York Times used this poll in one of its stories, no mention...."}, {"text": "....of the correction which they knew about full well! “Fox News Pollster Braun Research Misrepresented Impeachment Poll: Analysis” @NYPost"}, {"text": "Great new book, \"Resistance (At All Costs): How Trump Haters Are Breaking America\" out by Kimberley Strassel of the Wall Street Journal. Kim has treated us fairly, and for that I am very appreciative. Check it out today, it is great!"}, {"text": "....Don't the Europeans have a lot of responsibility?” @KatiePavlich Thank you Katie, I offered ISIS prisoners to the European countries from where they came, and was rejected on numerous occasions. They probably figured that the U.S. would bear the tremendous cost as always!"}, {"text": "“To his credit the Europeans didn't step up to deal with this ISIS problem – it’s a lot of the reason why we are in this situation today. Now, Angela Merkel of Germany is finally stepping up and telling Turkey to back off...."}, {"text": "After defeating 100% of the ISIS Caliphate, I largely moved our troops out of Syria. Let Syria and Assad protect the Kurds and fight Turkey for their own land. I said to my Generals, why should we be fighting for Syria...."}, {"text": "....and Assad to protect the land of our enemy? Anyone who wants to assist Syria in protecting the Kurds is good with me, whether it is Russia, China, or Napoleon Bonaparte. I hope they all do great, we are 7,000 miles away!"}, {"text": "....I would much rather focus on our Southern Border which abuts and is part of the United States of America. And by the way, numbers are way down and the WALL is being built!"}, {"text": "Some people want the United States to protect the 7,000 mile away Border of Syria, presided over by Bashar al-Assad, our enemy. At the same time, Syria and whoever they chose to help, wants naturally to protect the Kurds...."}, {"text": "Statement from President Donald J. Trump Regarding Turkey’s Actions in Northeast Syria https://t.co/ZCQC7nzmME"}, {"text": "\"The Democrat Party has hijacked the House of Representatives...\" @MarkLevinShow https://t.co/SZhfmhzec2"}, {"text": "\"It doesn't speak for the FULL HOUSE because the FULL HOUSE hasn't spoken. The Democrat Party is pushing this Impeachment. This is a Democrat Party Impeachment, as I have been saying, a silent COUP effort.\" @MarkLevinShow https://t.co/sA9EgI2yBL"}, {"text": "\"The House gone rogue! I want to remind you a little bit about the ring leader in this whole rogue operation against the President of the United States...\" @MarkLevinShow https://t.co/EkXsaR9GPh"}, {"text": "Shifty Schiff now seems to think they don’t need the Whistleblower, who started the whole Scam. The reason is that the Whistleblower has lost all credibility because the story is so far from the facts on the Transcript. Also, the second Whistleblower is no longer even mentioned!"}, {"text": "A big scandal at @ABC News. They got caught using really gruesome FAKE footage of the Turks bombing in Syria. A real disgrace. Tomorrow they will ask softball questions to Sleepy Joe Biden’s son, Hunter, like why did Ukraine &amp; China pay you millions when you knew nothing? Payoff?"}, {"text": "“Project Veritas-Obtained Undercover Videos Highlight Jeff Zucker’s (@CNN) Campaign To Destroy Trump. Videos Reveal @CNN’s BIAS!” @TuckerCarlson @FoxNews Does this sound like a good, or even great, lawsuit?"}, {"text": "Democrats are allowing no transparency at the Witch Hunt hearings. If Republicans ever did this they would be excoriated by the Fake News. Let the facts come out from the charade of people, most of whom I do not know, they are interviewing for 9 hours each, not selective leaks."}, {"text": "Hunter Biden was really bad on @GMA. Now Sleepy Joe has real problems! Reminds me of Crooked Hillary and her 33,000 deleted Emails, not recoverable!"}, {"text": "Governor @MattBevin has done a wonderful job for the people of Kentucky! He continues to protect your very important Second Amendment. Matt is Strong on Crime and the Border, he Loves our Great Vets and Military. Matt has my Complete and Total Endorsement, and always has!"}, {"text": "Just out: MEDIAN HOUSEHOLD INCOME IS AT THE HIGHEST POINT EVER, EVER, EVER! How about saying it this way, IN THE HISTORY OF OUR COUNTRY! Also, MORE PEOPLE WORKING TODAY IN THE USA THAN AT ANY TIME IN HISTORY! Tough numbers for the Radical Left Democrats to beat! Impeach the Pres."}, {"text": "....He loves our Military and supports our Vets! Get out and Vote for Tate Reeves on November 5th. He has my Complete and Total Endorsement!"}, {"text": "Mississippi, there is a VERY important election for Governor on November 5th. I need you to Get Out and Vote for our Great Republican nominee, @TateReeves. Tate is strong on Crime, tough on Illegal Immigration, and will protect your Second Amendment...."}, {"text": "Join me in Dallas, Texas this Thursday (October 17th) at the American Airlines Center! #KAG2020\n\nTickets: https://t.co/DBmvgoQSTX https://t.co/cIuZfcj5EI"}, {"text": "Now that we have found out that @CNN is a virtual fraud, rumor has it that Jeff Zucker will be resigining momentarily?"}, {"text": "Congratulations @StLouisBlues! \nhttps://t.co/WjlWYFuiE6"}, {"text": "The @StLouisBlues amazing comeback reminds us to never give up – and never lose faith. When you work hard, support each other, believe in yourself, and give it everything you’ve got, victory is always within reach! #STLBlues https://t.co/QeF54kqUak"}, {"text": "https://t.co/Kj1LtwYSXa https://t.co/YgXImlvOYd"}, {"text": ".... It also brings Shifty’s fraudulent MADE UP CALL, which he read to the United States Congress pretending it to be the words of President Trump, which they were not! Nancy Pelosi is involved in this fraud in that she confirmed his fraudulent words on @GMA, and much more!"}, {"text": "Shifty Adam Schiff wants to rest his entire case on a Whistleblower who he now says can’t testify, &amp; the reason he can’t testify is that he is afraid to do so because his account of the Presidential telephone call is a fraud &amp; totally different from the actual transcribed call..."}, {"text": "Looks good to me! https://t.co/3aHn7y3ZxI"}, {"text": "A great group of Champions! https://t.co/A2ux83427l"}, {"text": "We now have the greatest Economy in history! https://t.co/8fLOejOpxH"}, {"text": "You would think there is NO WAY that any of the Democrat Candidates that we witnessed last night could possibly become President of the United States. Now you see why they have no choice but to push a totally illegal &amp; absurd Impeachment of one of the most successful Presidents!"}, {"text": "“What is happening to President Trump with Impeachment is a Constitutional Travesty.” @GrahamLedger  The likes of which we have never seen before. It is Adam Schiff and Nancy Pelosi who should be impeached for fraud!"}, {"text": "95% Approval Rating in the Republican Party. Thank you! Just won two Congressional Seats in North Carolina,  &amp; a Governors runoff in Louisiana, which Republicans should now win! Because of Impeachment Fraud, we will easily take back the House, add in the Senate, &amp; again win Pres!"}, {"text": "Our record Economy would CRASH, just like in 1929, if any of those clowns became President!"}, {"text": "Republicans are totally deprived of their rights in this Impeachment Witch Hunt. No lawyers, no questions, no transparency! The good news is that the Radical Left Dems have No Case. It is all based on their Fraud and Fabrication!"}, {"text": "Senator Rand Paul just wrote a great book, “The Case Against Socialism” which is now out. Highly recommended – as America was founded on LIBERTY &amp; INDEPENDENCE – not government coercion, domination &amp; control. We were born free, and will stay free, as long as I am your President!"}, {"text": "Guatemala, Honduras &amp; El Salvador have all signed historic Asylum Cooperation Agreements and are working to end the scourge of human smuggling. To further accelerate this progress, the U.S. will shortly be approving targeted assistance in the areas of law enforcement &amp; security."}, {"text": "https://t.co/O8E3i8kJwS"}, {"text": "THANK YOU, WORKING HARD! https://t.co/sNUppjB4Xm"}, {"text": "FAKE NEWS! https://t.co/ta8ii8yetP"}, {"text": "I’m fighting for the American people, but the Democrats’ sole focus is fighting against ME with their fraudulent Witch Hunt. Go to https://t.co/Dt42WogFxM and tell Democrats in Congress that Enough is Enough!"}, {"text": "Do you think they like me? https://t.co/TDmUnJ8HtF"}, {"text": "Nervous Nancy's unhinged meltdown! https://t.co/RDeUI7sfe7"}, {"text": "The Do Nothing Democrats, Pelosi and Schumer stormed out of the Cabinet Room! https://t.co/hmP4FNhemv"}, {"text": "Nancy Pelosi needs help fast! There is either something wrong with her “upstairs,” or she just plain doesn’t like our great Country. She had a total meltdown in the White House today. It was very sad to watch. Pray for her, she is a very sick person!"}, {"text": "“This President is the most patriotic President I’ve seen in many years. He is going to do what is good for Americans.”  Congressman Brian Babin, Texas. Thank you Brian!"}, {"text": "THANK YOU you Dallas, Texas. See you tomorrow night at the American Airlines Center! #TRUMP2020 https://t.co/fbtzlbroQi"}, {"text": "“What has happened here with the Anthony Wiener laptop, the Server, all of the Emails between Huma Abedin and Hillary Clinton, the deleted Clinton Emails - what is going on?” @LouDobbs  Joe D &amp; Victoria T!"}, {"text": "Years of BAD GOVERNMENT, such a sorry thing to see! https://t.co/H1r2Be2YS6"}, {"text": "Hope all House Republicans, and honest House Democrats, will vote to CENSURE Rep. Adam Schiff tomorrow for his brazen and unlawful act of fabricating (making up) a totally phony conversation with the Ukraine President and U.S. President, me. Most have never seen such a thing!"}, {"text": "https://t.co/ZtCSrCqJcN"}, {"text": "“About 500,000 human beings were killed in Syria while Barack Obama was president &amp; leading for a “political settlement” to that civil war. Media has been more outraged in the last 72 hours over our Syria policy than they were at any point during 7 years of slaughter.” BuckSexton"}, {"text": "I am the only person who can fight for the safety of our troops &amp; bring them home from the ridiculous &amp; costly Endless Wars, and be scorned. Democrats always liked that position, until I took it. Democrats always liked Walls, until I built them. Do you see what’s happening here?"}, {"text": "This is the real story. Thank you Jim! https://t.co/VqJrsUJdiX"}, {"text": "My warmest condolences to the family and many friends of Congressman Elijah Cummings. I got to see first hand the strength, passion and wisdom of this highly respected political leader. His work and voice on so many fronts will be very hard, if not impossible, to replace!"}, {"text": "The Greatest Witch Hunt in American History! https://t.co/sPnloffJMT"}, {"text": "As the Witch Hunt continues! https://t.co/klvvwSXq7M"}, {"text": "This number, based on the Economy &amp; how well our Country is doing, would potentially be 75% if not for the Fake News &amp; Phony Witch Hunt. 95% Approval Rating in the Republican Party! https://t.co/GFLxcNJOkk"}, {"text": "Great news out of Turkey. News Conference shortly with @VP and @SecPompeo. Thank you to @RTErdogan. Millions of lives will be saved!"}, {"text": "This deal could NEVER have been made 3 days ago. There needed to be some “tough” love in order to get it done. Great for everybody. Proud of all!"}, {"text": "This is a great day for civilization. I am proud of the United States for sticking by me in following a necessary, but somewhat unconventional, path. People have been trying to make this “Deal” for many years. Millions of lives will be saved. Congratulations to ALL!"}, {"text": "See you soon Dallas, Texas! https://t.co/Sg6xtp1vqQ"}, {"text": "Just arrived at the American Airlines Center in Dallas, Texas. Will be out shortly as we wait for more of you to get in! #TRUMP2020 https://t.co/TB2baAFoBK"}, {"text": "Thank you Dallas, Texas - I love you! #TrumpRallyDallas #KAG2020 https://t.co/meWpesDYeM"}, {"text": "The radical left tolerates no dissent, it permits no opposition, it accepts no compromise, and it has absolutely no respect for the will of the American People. They are coming after me, because I am fighting for YOU! #TrumpRallyDallas #KAG2020 https://t.co/OthKwS1bud"}, {"text": "Tonight, we forcefully condemn the blatant corruption of the Democrat Party, the Fake News Media, and the rogue bureaucrats of the Deep State. The only message these radicals will understand is a crushing defeat on November 3, 2020! #KAG2020 https://t.co/QW1Rk99O4b"}, {"text": "Democrats are now the party of high taxes, high crime, open borders, late-term abortion, socialism, and blatant corruption. The Republican Party is the party of the American Worker, the American Family, and the American Dream! #KAG2020 https://t.co/qXB198T5cM"}, {"text": "The USA! https://t.co/Zdj3Lyo76H"}, {"text": "....I have just been notified that some European Nations are now willing, for the first time, to take the ISIS Fighters that came from their nations. This is good news, but should have been done after WE captured them. Anyway, big progress being made!!!!"}, {"text": ".....this thinking years ago. Instead, it was always held together with very weak bandaids, &amp; in an artificial manner. There is good will on both sides &amp; a really good chance for success. The U.S. has secured the Oil, &amp; the ISIS Fighters are double secured by Kurds &amp; Turkey...."}, {"text": "Just spoke to President @RTErdogan of Turkey. He told me there was minor sniper and mortar fire that was quickly eliminated. He very much wants the ceasefire, or pause, to work. Likewise, the Kurds want it, and the ultimate solution, to happen. Too bad there wasn’t....."}, {"text": "DEFEAT TERRORISM! https://t.co/8WbnLPgWIK"}, {"text": "Can you believe I am doing this important work for our Country, and have to deal with Corrupt Adam Schiff and the Do Nothing Democrats at the same time? It was not intended to be this way for a President!"}, {"text": "I want to thank Secretary of Energy Rick Perry for the outstanding job he has done. He will be leaving at the end of the year to pursue other interests. Rick was a great Governor of Texas and a great Secretary of Energy...."}, {"text": "....He is also my friend! At the same time, I am pleased to nominate Deputy Secretary Dan Brouillette to be the new Secretary of Energy. Dan’s experience in the sector is unparalleled. A total professional, I have no doubt that Dan will do a great job!"}, {"text": "https://t.co/p5imhMJqS1"}, {"text": "Think of how many lives we saved in Syria and Turkey by getting a ceasefire yesterday. Thousands and thousands, and maybe many more!"}, {"text": "https://t.co/Q2ar4LZGM4"}, {"text": "REPUBLICANS MUST STICK TOGETHER AND FIGHT! https://t.co/chnSNURfFx"}, {"text": "Corrupt Congressman Adam Schiff is angry that Ambassadors that he thought would be good for his fraudulent Witch Hunt, are turning out to be good for me - some really good! He’s got all meetings locked down, no transparency, only his illegal leaks. A very dishonest sleazebag!"}, {"text": "“Because the House has already voted against the Impeachment Proceeding, the current inquiry is totally invalid. The current sham of a so-called investigation is nothing more than an unconstitutional power grab. It needs to end.”  @JasonChaffetz  @seanhannity  Corrupt Adam Schiff"}, {"text": "Congressman Michael McCaul, “Schiff’s inquiry defies Democracy.” @FoxNews @seanhannity"}, {"text": "Pelosi and Impeachment - There have already been 3 Votes, and they’ve all failed miserably. Here’s why there may not be a fourth - 137 Democrats voted against on the last vote.” @JasonChaffetz  @seanhannity  Many of those voting in favor will be beaten in 2020!"}, {"text": "Susan Rice, who was a disaster to President Obama as National Security Advisor, is now telling us her opinion on what to do in Syria. Remember RED LINE IN THE SAND? That was Obama. Millions killed! No thanks Susan, you were a disaster."}, {"text": "#StopTheCoup"}, {"text": "Such a disgrace that the Do Nothing Democrats are doing just as their name suggests, Doing Nothing! USMCA anyone?"}, {"text": "There has never been a greater fraud on Congress. Shifty Schiff is Corrupt. Go Andy! https://t.co/yw57NhKpG2"}, {"text": "Texas is great! https://t.co/aJSyPSHJfw"}, {"text": "I agree! https://t.co/mxKKg98NvO"}, {"text": "Thank you very much. Working hard! https://t.co/z8dgzQxkVC"}, {"text": "“I don’t see anything that constitutes an Impeachable offense - Nothing here rises to the level of Impeachment. The Democrats are making a mistake with this secrecy.” Kenn Starr, former Special Prosecutor"}, {"text": "A Great Book by Kimberley Strassel! https://t.co/TOQcUDmnAR"}, {"text": ".@RepMcClintock  Thank you Tom. Great interview on @TeamCavuto! @FoxNews"}, {"text": "Just another FAKE SUPPRESSION POLL, this time from @FoxNews, of course! https://t.co/x8lYVE7QCo"}, {"text": "It is ONLY about this! https://t.co/ZB5xPDKs4b"}, {"text": "Crooked Hillary Clinton just called the respected environmentalist and Green Party candidate, Jill Stein, a “Russian Asset.” They need a Green Party more than ever after looking at the Democrats disastrous environmental program!"}, {"text": "https://t.co/yvsGhK5N9X"}, {"text": "See you there! https://t.co/msBoZ1TbNX"}, {"text": "“The President never told me to withhold any money until the Ukrainians did anything related to the server. The only reason we were holding the money was because of concern about LACK OF SUPPORT FROM OTHER NATIONS and CONCERNS OVER CORRUPTION.” Yesterday’s Mick Mulvaney statement"}, {"text": ".....its own 50 to 70 unit building. Would set up better than other alternatives. I announced that I would be willing to do it at NO PROFIT or, if legally permissible, at ZERO COST to the USA. But, as usual, the Hostile Media &amp; their Democrat Partners went CRAZY!"}, {"text": "I thought I was doing something very good for our Country by using Trump National Doral, in Miami, for hosting the G-7 Leaders. It is big, grand, on hundreds of acres, next to MIAMI INTERNATIONAL AIRPORT, has tremendous ballrooms &amp; meeting rooms, and each delegation would have..."}, {"text": "https://t.co/dNfXkc8uUG"}, {"text": "....Therefore, based on both Media &amp; Democrat Crazed and Irrational Hostility, we will no longer consider Trump National Doral, Miami, as the Host Site for the G-7 in 2020. We will begin the search for another site, including the possibility of Camp David, immediately. Thank you!"}, {"text": "Never give up. We are doing GREAT! We are WINNING! https://t.co/MKDn5WStFU"}, {"text": "So now Crooked Hillary is at it again! She is calling Congresswoman Tulsi Gabbard “a Russian favorite,” and Jill Stein “a Russian asset.” As you may have heard, I was called a big Russia lover also (actually, I do like Russian people. I like all people!). Hillary’s gone Crazy!"}, {"text": "https://t.co/kNVQf6JdIL"}, {"text": "The WALL is making a very big difference. Even Dems in area are happy! https://t.co/NDzq2oIsHV"}, {"text": "“The ceasefire is holding up very nicely. There are some minor skirmishes that have ended quickly. New areas being resettled with Kurds. U.S. soldiers are not in combat or ceasefire zone. We have secured the Oil.” Mark Esper, Secretary of Defense. Ending endless wars!"}, {"text": "https://t.co/kNVQf6JdIL"}, {"text": "https://t.co/dNfXkc8uUG"}, {"text": "Pelosi is now leading a delegation of 9, including Corrupt Adam Schiff, to Jordan to check out Syria. She should find out why Obama drew The Red Line In the Sand, &amp; then did NOTHING, losing Syria &amp; all respect. I did something, 58 missiles. One million died under Obama’s mistake!"}, {"text": "....fiction to Congress and the American People?  I demand his deposition. He is a fraud, just like the Russia Hoax was, and the Ukraine Hoax is now. When do the Do Nothing Democrats pay a price for what they are doing to our Country, &amp; when do the Republicans finally fight back?"}, {"text": "....because their so-called story didn’t come even close to matching up with the exact transcript of the phone call. Was it a Corrupt Adam Schiff con? Why didn’t the IG see this? When do we depose Shifty Schiff to find out why he fraudulently made up my phone call and read this.."}, {"text": "This Scam going on right now by the Democrats against the Republican Party, and me, was all about a perfect phone call I had with the Ukrainian President. He’s already stated, NO PRESSURE! Where is the Whistleblower, or the 2nd Whistleblower, or the “informant?” All gone....."}, {"text": "So interesting that, when I announced Trump National Doral in Miami would be used for the hosting of the G-7, and then rescinded due to Do Nothing Democrat/Fake News Anger, very few in Media mentioned that NO PROFITS would be taken, or would be given FREE, if legally permissible!"}, {"text": "“To the Democrats, Impeachment is partisan politics dressed up as principle.” @SteveHiltonx @FoxNews"}, {"text": "Congratulations Barbara! https://t.co/0cYrjL1YOj"}, {"text": "Adam Schiff is a Corrupt Politician! https://t.co/16aSrqjwu2"}, {"text": "A Great Democrat Scam! https://t.co/LbkVT7UvXX"}, {"text": "https://t.co/6sKKniiOfE"}, {"text": "https://t.co/R3Chppjx6S"}, {"text": "https://t.co/oSn6amjZo4"}, {"text": "Great new book by wonderful and very street smart author Dan Bongino, EXONERATED, THE FAILED TAKEDOWN OF PRESIDENT DONALD TRUMP BY THE SWAMP. Dan hits all of the crooked points of the greatest Witch Hunt in political history. Nevertheless, the Scam continues!"}, {"text": "Censure (at least) Corrupt Adam Schiff! After what he got caught doing, any pol who does not so vote cannot be honest....are you listening Dems?"}, {"text": "Doral in Miami would have been the best place to hold the G-7, and free, but too much heat from the Do Nothing Radical Left Democrats &amp; their Partner, the Fake News Media! I’m surprised that they allow me to give up my $400,000 Plus Presidential Salary! We’ll find someplace else!"}, {"text": "Will be interviewed by @seanhannity tonight at 9:00 P.M. on @FoxNews. Enjoy!"}, {"text": "Thank you Dan and Kevin. Great Vote! https://t.co/MMJ5SanakG"}, {"text": "Thank you Liz. Shows great Republican support! https://t.co/WsuTmv6Tfh"}, {"text": "Congratulations to @JustinTrudeau on a wonderful and hard fought victory. Canada is well served. I look forward to working with you toward the betterment of both of our countries!"}, {"text": "“The Ambassador to the European Union has already testified, he said there was no quid pro quo. He said the President had told him that.” @kilmeade  @foxandfriends"}, {"text": "“I thought a very revealing poll was done by The New York Times. By about a 10 point margin, those in battleground states polled are against impeaching the President, and if Nancy Pelosi doesn’t take note of that, maybe she is the third rate politician.” @kilmeade @foxandfriends"}, {"text": "...A majority do not want him Impeached and removed from office. 94% of the people in these battleground states who voted for President Trump want him to continue as President. That’s squarely in his corner.” @SteveDoocy “That’s a revealing poll, don’t you think that matters?”..."}, {"text": "....@kilmeade   “I want to know about Hillary Clinton with the Dossier? I want to know if there was FISA abuse? We’re still waiting for that report!” @ainsleyearhardt  @foxandfriends"}, {"text": "So some day, if a Democrat becomes President and the Republicans win the House, even by a tiny margin, they can impeach the President, without due process or fairness or any legal rights. All Republicans must remember what they are witnessing here - a lynching. But we will WIN!"}, {"text": "Thank you Republicans. 185 out of 185 present voted for “US” last night. Really good!"}, {"text": "95% Approval Rating in the Republican Party. Thank you!"}, {"text": "Can’t believe that Nervous Nancy Pelosi isn’t moving faster on USMCA. Her people want it, they don’t know why she isn’t putting it up for a bipartisan vote. Taking too long!"}, {"text": "“The Democrats are trying to draw out this inquiry because they don’t have the support. Donald Trump is guilty only of winning the 2016 Election.” @MZHemingway @foxandfriends"}, {"text": "Great Job Tim! https://t.co/WhgO67CfKP"}, {"text": "Good news seems to be happening with respect to Turkey, Syria and the Middle East. Further reports to come later!"}, {"text": "Wrong, never even discussed this with Kellyanne Conway or Steve Mnuchin. Just more Fake News! https://t.co/bgR8TnytjJ"}, {"text": "The Do Nothing Dems have nothing but time! https://t.co/g9wsBfk16W"}, {"text": "The Witch Hunt continues! https://t.co/pBzhZfJEYb"}, {"text": "The Democrats Scam goes on and on! They Do Nothing! https://t.co/4ER1m6e39s"}, {"text": "Thank you Steve! https://t.co/ROfsFdSGZO"}, {"text": "It never ends. The Do Nothing Dems are terrible! https://t.co/l7Qk0WU8ML"}, {"text": "Neither he (Taylor) or any other witness has provided testimony that the Ukrainians were aware that military aid was being withheld. You can’t have a quid pro quo with no quo.” Congressman John Ratcliffe @foxandfriends Where is the Whistleblower? The Do Nothing Dems case is DEAD!"}, {"text": "Republicans are going to fight harder than ever to win back the House because of what the Do Nothing Democrats have done to our Country!"}, {"text": "....feel EMPOWERED. There’s a movement happening on these campuses like I’ve never seen before. When you have 3000 students wanting to get into an event that couldn’t get in, that’s pretty remarkable!”  @charliekirk11 Turning Point USA   KEEP AMERICA GREAT!"}, {"text": "....Order a couple of months ago saying that any school that does not uphold the First Amendment Rights of its students will lose Federal Funding. We have seen a huge change in how the Universities interact with us as a national &amp; local student organization. Our studends...."}, {"text": "Young campus Conservatives are flocking to Turning Point USA &amp; other Conservative speaker events all over the Country, AND IN RECORD NUMBERS. Thousands of students are turning out. “I just want to compliment the President of the United States for signing that historic Executive.."}, {"text": "Big success on the Turkey/Syria Border. Safe Zone created! Ceasefire has held and combat missions have ended. Kurds are safe and have worked very nicely with us. Captured ISIS prisoners secured. I will be making a statement at 11:00 A.M. from the White House. Thank you!"}, {"text": "Where’s the Whistleblower?"}, {"text": "https://t.co/7Ud0WLyo4g"}, {"text": "Thank you General Mazloum for your kind words and courage. Please extend my warmest regards to the Kurdish people. I look forward to seeing you soon. @mustefabali"}, {"text": "The Never Trumper Republicans, though on respirators with not many left, are in certain ways worse and more dangerous for our Country than the Do Nothing Democrats. Watch out for them, they are human scum!"}, {"text": "Never Trumper Republican John Bellinger, represents Never Trumper Diplomat Bill Taylor (who I don’t know), in testimony before Congress! Do Nothing Democrats allow Republicans Zero Representation, Zero due process, and Zero Transparency...."}, {"text": "....Does anybody think this is fair? Even though there was no quid pro quo, I’m sure they would like to try. Worse than the Dems!"}, {"text": "It would be really great if the people within the Trump Administration, all well-meaning and good (I hope!), could stop hiring Never Trumpers, who are worse than the Do Nothing Democrats. Nothing good will ever come from them!"}, {"text": "It was wonderful to be back in Pittsburgh, Pennsylvania with the incredible Patriots who fuel our factories, light up our homes, power our industries and fill our hearts with true American Pride! #SHALEINSIGHT2019 https://t.co/hWmN7zNud3"}, {"text": "PROMISES MADE, PROMISES KEPT! #SHALEINSIGHT2019 https://t.co/kCkw3K8k5o"}, {"text": "(Kiddingly) We’re building a Wall in Colorado”(then stated, “we’re not building a Wall in Kansas but they get the benefit of the Wall we’re building on the Border”) refered to people in the very packed auditorium, from Colorado &amp; Kansas, getting the benefit of the Border Wall!"}, {"text": "Just a continuation of the Witch Hunt! https://t.co/TTCXcg0jdU"}, {"text": "It is the only thing the Do Nothing Dems are doing! https://t.co/oqeetDNKzD"}, {"text": "Don’t hurt them please! https://t.co/cKVa2HlJQb"}, {"text": "The Federal Reserve is derelict in its duties if it doesn’t lower the Rate and even, ideally, stimulate. Take a look around the World at our competitors. Germany and others are  actually GETTING PAID to borrow money. Fed was way too fast to raise, and way too slow to cut!"}, {"text": "Thank you to House Republicans for being tough, smart, and understanding in detail the greatest Witch Hunt in American History. It has been going on since long before I even got Elected (the Insurance Policy!). A total Scam!"}, {"text": "The Oil Fields discussed in my speech on Turkey/Kurds yesterday were held by ISIS until the United States took them over with the help of the Kurds. We will NEVER let a reconstituted ISIS have those fields!"}, {"text": "I really enjoyed my conversation with General @MazloumAbdi. He appreciates what we have done, and I appreciate what the Kurds have done. Perhaps it is time for the Kurds to start heading to the Oil Region!"}, {"text": "Where is the Whistleblower, and why did he or she write such a fictitious and incorrect account of my phone call with the Ukrainian President? Why did the IG allow this to happen? Who is the so-called Informant (Schiff?) who was so inaccurate? A giant Scam!"}, {"text": "Another big dropout of the Presidential race was, along with 0% Tim Ryan, 0% @RepSwalwell. Such talk and bravado from both, and nothing to show. They stood for nothing, and the voters couldn’t stand by them. Obnoxious and greedy politicians never make it in the end!"}, {"text": "So Congressman Tim Ryan of Ohio has finally dropped out of the race for President, registering ZERO in the polls &amp; unable to even qualify for the debate stage. See Tim, it’s not so easy out there if you don’t know what you’re doing. He wasn’t effective for USA workers, just talk!"}, {"text": "....COMING HOME! We were supposed to be there for 30 days - That was 10 years ago. When these pundit fools who have called the Middle East wrong for 20 years ask what we are getting out of the deal, I simply say, THE OIL, AND WE ARE BRINGING OUR SOLDIERS BACK HOME, ISIS SECURED!"}, {"text": "....USA has gained Trillions of Dollars in wealth since November 2016. All others way down. Our power is Economic before having to use our newly rebuilt Military, a much better alternative. Oil is secured. Our soldiers have left and are leaving Syria for other places, then...."}, {"text": "Turkey fully understands not to fire on the Kurds as they leave what will be known as the Safe Zone for other fairly nearby areas. I don’t have to repeat that large scale Sanctions will be imposed for violations. Going well! ISIS secured by Kurds with Turkey ready as backup....."}, {"text": "“Donald J. Trump is an absolutely historic President already, in less than 3 years in office. His record is there for everyone to look at &amp; to examine and compare. This is an illegitimate effort to overthrow a President, not a formal Impeachment inquiry.” @LouDobbs  Thank you Lou"}, {"text": "Heading to South Carolina! https://t.co/CORtaPJq9p"}, {"text": "Thank you @robertjeffress! https://t.co/o6mk8orgrC"}, {"text": "It was my great honor to deliver the keynote address at the 2019 Second Step Presidential Justice Forum hosted by the 20/20 Bipartisan Justice Center in South Carolina, and my true honor to receive the Bipartisan Justice Award, thank you! https://t.co/uF9IWnI1pH"}, {"text": "I appreciate the support of Senator @LindseyGraham, @SenateMajLdr Mitch McConnell, and their Great Senate Republican colleagues, on the resolution condemning the Do Nothing Democrats for their Witch Hunt Impeachment inquiry, behind closed doors...."}, {"text": "....in the basement of the United States Capitol! They cannot win at the ballot box. Their sham for the past 3 years continues. The good news is that the American People get it, which will be proven once again on November 3, 2020!"}, {"text": "To Tim: The Button on the IPhone was FAR better than the Swipe!"}, {"text": "....The entire Impeachment Scam was based on my perfect Ukrainian call, and the Whistleblowers account of that call, which turned out to be false (a fraud?). Once I released the actual call, their entire case fell apart. The Democrats must end this Scam now. Witch Hunt!"}, {"text": "Democrats just announced that they no longer want the Whistleblower to testify. But everything was about the Whistleblower (they no longer want the second Whistleblower either), which they don’t want because the account of my call bore NO RELATIONSHIP to the call itself....."}, {"text": "My lawyers should sue the Democrats and Shifty Adam Schiff for fraud!"}, {"text": "Wow! https://t.co/lF3WUjiqHs"}, {"text": "Great Book! https://t.co/HYO77j6KRT"}, {"text": "https://t.co/zDEOQfpvk1 https://t.co/Bxpt7nQTjG"}, {"text": "https://t.co/o6mk8orgrC https://t.co/iUD808JXyt"}, {"text": "My Administration is fighting hard to end the Opioid Crisis. Join with us by disposing unused or expired prescription medications at over 4,000 locations across this great Country. Find a location TOMORROW, October 26th from 10am-2pm at https://t.co/CXK0LFpGMD. #TakeBackDay https://t.co/DvgrxZoLzp"}, {"text": "“General Michael Flynn’s attorney is demanding that charges be immediately dropped after they found that FBI Agents manipulated records against him. They say that James Clapper told a reporter to “take a kill shot at Flynn. This has been a complete setup of Michael Flynn...."}, {"text": "...Thank you @foxandfriends! Hopefully this is just the beginning of a massive story of injustice and treason. You will never learn this from the corrupt LameStream Media who get Pulitzer Prizes for reporting the story totally wrong. The ones who report it right get only RESPECT!"}, {"text": "..the President when Flynn had been cleared of everything long before that. The DOJ is withholding a lot of evidence &amp; information, as are Clapper &amp; Brennan &amp; all of the people who participated in the complete setup of Michael Flynn.”(Terrible!) Sidney Powell. This is a disgrace!"}, {"text": "....They exonerated him completely of being an agent of Russia (Recently Crooked Hillary charged Tulsi Gabbard &amp; Jill Stein with the same thing-SICK), and yet Mr. Comey still runs to the White House on February 14 and conjures up the Obstruction of Justice narrative against....."}, {"text": "Had a beautiful dinner last night at Camp David in celebration of the 10th Wedding Anniversary of Ivanka and Jared. Attended by a small number of family and friends, it could not have been nicer. Camp David is a special place. Cost of the event will be totally paid for by me!"}, {"text": "“Not a single American citizen has been charged with anything related to Russian Collusion, not one person.” @TuckerCarlson  It was all an illegal Witch Hunt!"}, {"text": "....We should all work together to clean up these hazardous waste and homeless sites before the whole city rots away. Very bad and dangerous conditions, also severely impacting the Pacific Ocean and water supply. Pelosi must work on this mess and turn her District around!"}, {"text": "I can’t believe that Nancy Pelosi’s District in San Francisco is in such horrible shape that the City itself is in violation of many sanitary &amp; environmental orders, causing it to owe the Federal Government billions of dollars - and all she works on is Impeachment....."}, {"text": "The Ukraine investigation is just as Corrupt and Fake as all of the other garbage that went on before it. Even Shifty Schiff got caught cheating when he made up what I said on the call!"}, {"text": "....greatly help the African American community (and all other communities), and which was unable to get done in past administrations despite a tremendous desire for it. This and best unemployment numbers EVER is more than Kamala will EVER be able to do for African Americans!"}, {"text": "Badly failing presidential candidate @KamalaHarris will not go to a very wonderful largely African American event today because yesterday I recieved a major award, at the same event, for being able to produce &amp; sign into law major Criminal Justice Reform legislation, which will.."}, {"text": "...."}, {"text": "My Administration is fighting hard to end the Opioid Crisis. Join with us by disposing unused or expired prescription medications at over 4,000 locations across this great Country. Find a location TODAY from 10am-2pm at https://t.co/CXK0LFpGMD. #TakeBackDay https://t.co/xBEyflYYGj"}, {"text": "The Fake Washington Post keeps doing phony stories, with zero sources, that I am concerned with the Impeachment scam. I am not because I did nothing wrong. It is the other side, including Schiff and his made up story, that are concerned. Witch Hunt continues!"}, {"text": "Where’s the Whistleblower?"}, {"text": "....Our Republican candidate @EddieRispone is a successful conservative businessman who will stand with me to create jobs and protect your Second Amendment. GET OUT AND VOTE for Eddie, the next Governor of the GREAT State of Louisiana!"}, {"text": "LOUISIANA! Extreme Democrat John Bel Edwards has sided with Nancy Pelosi and Chuck Schumer to support Sanctuary Cities, High Taxes, and Open Borders. He is crushing Louisiana’s economy and your Second Amendment rights...."}, {"text": "....He loves our Military and supports our Vets! Democrat Jim Hood will never give us his vote, is anti-Trump and pro-Crooked Hillary. Get out and VOTE for Tate Reeves on November 5th. He has my Complete and Total Endorsement!"}, {"text": "MISSISSIPPI! There is a VERY important election for Governor on November 5th. I need you to get out and VOTE for our Great Republican nominee, @TateReeves. Tate is Strong on Crime, tough on Illegal Immigration, and will protect your Second Amendment...."}, {"text": "....Matt has my Complete and Total Endorsement, and always has. GET OUT and VOTE on November 5th for your GREAT Governor, @MattBevin!"}, {"text": "Governor @MattBevin has done a wonderful job for the people of Kentucky! He continues to protect your very important Second Amendment. Matt is Strong on Crime and the Border, he Loves our Great Vets and Military...."}, {"text": "Something very big has just happened!"}, {"text": "As Diwali commences, @FLOTUS Melania and I wish those observing the Festival of Lights a blessed and happy celebration! #HappyDiwali https://t.co/LGXkUzMJiI"}, {"text": "https://t.co/yJ0VKdNxHP"}, {"text": "https://t.co/7esnNSoa5D"}, {"text": "Thank you to @MarthaRaddatz and @TerryMoran for a job well done! https://t.co/mcHjqX1K2L"}, {"text": "The S&amp;P just hit an ALL TIME HIGH. This is a big win for jobs, 401-K’s, and, frankly, EVERYONE! Our Country is doing great. Even killed long sought ISIS murderer, Al-Baghdadi. We are stronger than ever before, with GREAT upward potential. Enjoy!"}, {"text": "THANK YOU #IACP2019! https://t.co/iUr5OpgT7X"}, {"text": "An AMAZING CHAMPION. Great going Tiger! @TigerWoods https://t.co/GdmcpMG42s"}, {"text": "We have declassified a picture of the wonderful dog (name not declassified) that did such a GREAT JOB in capturing and killing the Leader of ISIS, Abu Bakr al-Baghdadi! https://t.co/PDMx9nZWvw"}, {"text": "So nice, thank you! https://t.co/UjgDeHSK7C"}, {"text": "Can you believe that Shifty Adam Schiff, the biggest leaker in D.C., and a corrupt politician, is upset that we didn’t inform him before we raided and killed the #1 terrorist in the WORLD!? Wouldn’t be surprised if the Do Nothing Democrats Impeach me over that! DRAIN THE SWAMP!!"}, {"text": "“Americans know by now that the Impeachment inquiry is just another hoax and silent coup to remove the President from office.” J.J. Crovatto  Don’t worry J.J., Schiff is a leaker &amp; corrupt politician who made up what I said on the call in order to hurt the Republican Party &amp; me!"}, {"text": "“There is no underlying crime in that transcript.” @IngrahamAngle  100% correct, and the Whistleblower disappeared after I released the transcript of the call. Where is the Whistleblower? That is why this is now called the Impeachment Hoax! The Do Nothing Dems are Doing Nothing!"}, {"text": "The only crimes in the Impeachment Hoax were committed by Shifty Adam Schiff, when he totally made up my phone conversation with the Ukrainian President and read it to Congress, together with numerous others on Shifty’s side. Schiff should be Impeached, and worse!"}, {"text": "“This is a big win for America, and also for President Trump.” @nypost"}, {"text": "Why are people that I never even heard of testifying about the call. Just READ THE CALL TRANSCRIPT AND THE IMPEACHMENT HOAX IS OVER! Ukrain said NO PRESSURE. https://t.co/VYmW8bYcgS"}, {"text": "Correct, a total scam! https://t.co/klpmeAwm03"}, {"text": "A great book by a great guy. Get it now! https://t.co/hwFtbpbIO0"}, {"text": "Where’s the Whistleblower? Just read the Transcript, everything else is made up garbage by Shifty Schiff and the Never Trumpers!"}, {"text": "The Do Nothing Democrats are working hard to make everyone forget the Best Economy Ever, the monumental weekend raid, Tax Cuts, the Rebuilding of our Military, etc. The Impeachment Hoax is a disgrace. Read the transcript!"}, {"text": "How many more Never Trumpers will be allowed to testify about a perfectly appropriate phone call when all anyone has to do is READ THE TRANSCRIPT! I knew people were listening in on the call (why would I say something inappropriate?), which was fine with me, but why so many?"}, {"text": "Supposedly, according to the Corrupt Media, the Ukraine call “concerned” today’s Never Trumper witness. Was he on the same call that I was? Can’t be possible! Please ask him to read the Transcript of the call. Witch Hunt!"}, {"text": "95% Approval Rating in the Republican Party, a record. Thank you!"}, {"text": "Just confirmed that Abu Bakr al-Baghdadi’s number one replacement has been terminated by American troops. Most likely would have taken the top spot - Now he is also Dead!"}, {"text": "A great new book just out, “The Plot Against the President. The True Story Of How Congressman Devin Nunez Uncovered the Biggest Political Scandal In U.S. History.” Shows very bad and corrupt people on the other side. Check it out!"}, {"text": "Consumer Confidence number very good. Housing sales in September up nicely. Economy Rocks!"}, {"text": "“Over in Europe and Japan they have NEGATIVE RATES. They get paid to borrow money. Don’t we have to follow our competitors?” @Varneyco  Yes we do. The Fed doesn’t have a clue! We have unlimited potential, only held back by the Federal Reserve. But we are winning anyway!"}, {"text": "Nervous Nancy Pelosi is doing everything possible to destroy the Republican Party. Our Polls show that it is going to be just the opposite. The Do Nothing Dems will lose many seats in 2020. They have a Death Wish, led by a corrupt politician, Adam Schiff!"}, {"text": ".....the call with the Ukrainian President was a totally appropriate one. As he said, “No Pressure.” This Impeachment nonsense is just a continuation of the Witch Hunt Hoax, which has been going on since before I even got elected. Rupublicans, go with Substance and close it out!"}, {"text": "Republicans are very unified and energized in our fight on the Impeachment Hoax with the Do Nothing Democrats, and now  are starting to go after the Substance even more than the very infair Process because just a casual reading of the Transcript leads EVERYBODY to see that....."}, {"text": "The Greatest Economy in American History!"}, {"text": "“It does appear it has to do with Nancy Pelosi retaining her Speakership in the next Congress. She would like that so she’s going to put it to a vote because that’s what her political left really wants.” @SteveDoocy @foxandfriends  A disgraceful use of Impeachment. Will backfire!"}, {"text": "A Federal Judge is allowing the Nick Sandman libel suit to move forward against the thoroughly disgusting Washington Post (which is no longer available at the White House!). He could now have a good chance of winning. Go Nick!"}, {"text": "Yesterday’s Never Trumper witness could find NO Quid Pro Quo in the Transcript of the phone call. There were many people listening to the call. How come they (including the President of Ukraine) found NOTHING wrong with it. Witch Hunt!"}, {"text": "“Precisely the same program that the Democrats are trying to  Impeach President Trump for supposedly slow walking, tomorrow, right here in the Senate, they (the Dems) say they’re going to filibuster for the exact same program.” @senatemajldr Mitch McConnell. Do Nothing Democrats!"}, {"text": "“Our Country cannot afford for the Democrats in Congress to take a one year vacation from any productive legislation just because they would rather obsess over Impeachment. ISIS &amp; other radical terrorists are not going to hit the pause button because Democrats won’t fund......"}, {"text": "....the United States Military. Congress needs to do its work. We need to fund our Armed Forces.”  @senatemajldr Mitch McConnell.  The Dems are a lost cause. In 2020, we need a big, beautiful WIN (all three)! #MAGA"}, {"text": "...our Military, 2nd Amendment, Energy, and so many other things that the Democrats don’t care about. Please stop the Dems from hurting a very good and hard-working man!\n\nhttps://t.co/uUnWOtVxBV"}, {"text": "My friend Mike @GovDunleavy of the Great State of Alaska, is being treated very unfairly by the Democrats because he is doing an unbelievable job and fulfilling every one of his promises. Now they are trying to Recall him because his agenda is the Economy, Jobs, and protecting..."}, {"text": "Thank you @GM, @FiatChrysler_NA, @Toyota, and @GloblAutomkrs for standing with us for Better, Cheaper, Safer Cars for Americans. California has treated the Auto Industry very poorly for many years, harming Workers and Consumers. We are fixing this problem! https://t.co/cf6I1e0yjQ"}, {"text": "AMERICAN HERO! https://t.co/XCCa2sGfsZ"}, {"text": "....Your current Governor, John Bel Edwards, has done a poor job with economic development (last in nation) and auto insurance (highest in nation) wants to raise your taxes BIG - vote for Eddie starting Saturday!"}, {"text": "Early voting in Louisiana for a man who will be a Great Governor, @EddieRispone, on Saturday, November 2nd. He will get your Auto Insurance and Taxes way down. He will protect your Military, Vets, Second Amendment and Energy...."}, {"text": "We will be having a big rally for Governor @MattBevin on Monday night in Kentucky. Get your tickets today! https://t.co/uoPhCLGHpH"}, {"text": "“Adam Schiff’s drive to impeach Trump based on opinions, deception and illusions – Not facts” @GreggJarrett https://t.co/N31CGYraYP"}, {"text": "Thank you @GLFOP! https://t.co/IpoUY7QPM2"}, {"text": "\"The Democrats have been on this path for 3 years. The first headline I saw...before the President was sworn in was that the Impeachment process was beginning...so this is just further evidence that this is what they had in mind from the very beginning.\" @senatemajldr https://t.co/scFWSh47Bq"}, {"text": "https://t.co/z0I7wBsgTP"}, {"text": "The Do Nothing Democrats have gone Crazy. Very bad for USA! https://t.co/3zApgOOA7I"}, {"text": "Thank you Daily Wire. Very cute recreation, but the “live” version of Conan will be leaving the Middle East for the White House sometime next week! https://t.co/Z1UfhxsSpT"}, {"text": "Congratulations to the Washington Nationals on a great season and an incredible World Series. Game 7 was amazing! @Nationals"}, {"text": ".....the Dems have selectively leaked. Nor was there any corrupt intent on the part of the President. Remember, the President knew that that call was being heard and documented by many people. Anyone with intent would be a tad more discreet, don’t you think? This farce should...."}, {"text": "“Now is the time for Republicans to stand together and defend the leader of their party against these smears. It would be one thing if there were any indication of an underlying crime, but there is not-not in the transcripts, and not in the secret witness testimony that....."}, {"text": ".....to any President, of either party, again. Laura @IngrahamAngle"}, {"text": "...never be allowed to roll into a winter showtrial. Indeed, allowing a long, drawn out trial in the Senate would merely validate and perpetuate the fraud begun in the House. The crisis is of the Democrats own making, and it’s up to Republicans to make sure this never happens...."}, {"text": "Thank you Matt. https://t.co/vDZqYIrgBy"}, {"text": "Congratulations to @FoxNews, you left @CNN &amp; @MSNBC in the dust (that’s because the don’t tell the truth!). https://t.co/C87eV3Zp7B"}, {"text": "China and the USA are working on selecting a new site for signing of Phase One of Trade Agreement, about 60% of total deal, after APEC in Chile was canceled do to unrelated circumstances. The new location will be announced soon. President Xi and President Trump will do signing!"}, {"text": "READ THE TRANSCRIPT!"}, {"text": "People are VERY disappointed in Jay Powell and the Federal Reserve. The Fed has called it wrong from the beginning, too fast, too slow. They even tightened in the beginning. Others are running circles around them and laughing all the way to the bank. Dollar &amp; Rates are hurting..."}, {"text": "....our manufacturers. We should have lower interest rates than Germany, Japan and all others. We are now, by far, the biggest and strongest Country, but the Fed puts us at a competitive disadvantage. China is not our problem, the Federal Reserve is! We will win anyway."}, {"text": "The Impeachment Hoax is hurting our Stock Market. The Do Nothing Democrats don’t care!"}, {"text": "The Greatest Witch Hunt In American History!"}, {"text": "While the Do Nothing Democrats FAIL the American People, and continue the Impeachment Scam, my Administration will continue to deliver REAL RESULTS, as seen over the past month, below! https://t.co/dxjHusgiFX"}, {"text": "The home of Nancy Pelosi. I can’t believe her voters can be happy with the job she and the Do Nothing Democrats are doing! San Francisco has really gone down hill. So sad! https://t.co/z0Tms6gkDy"}, {"text": "....New York, and always will, but unfortunately, despite the fact that I pay millions of dollars in city, state and local taxes each year, I have been treated very badly by the political leaders of both the city and state. Few have been treated worse. I hated having to make...."}, {"text": "1600 Pennsylvania Avenue, the White House, is the place I have come to love and will stay for, hopefully, another 5 years as we MAKE AMERICA GREAT AGAIN, but my family and I will be making Palm Beach, Florida, our Permanent Residence. I cherish New York, and the people of....."}, {"text": "....this decision, but in the end it will be best for all concerned. As President, I will always be there to help New York and the great people of New York. It will always have a special place in my heart!"}, {"text": "Thank you! https://t.co/8yUP8Pex8c"}, {"text": "A great place! https://t.co/4RfSNw3RZf"}, {"text": "But the Crooked Democrats don’t want people to know this! Thank you to Tim Morrison for your honesty. https://t.co/1AxrArFJ6c"}, {"text": "Thanks Lee! https://t.co/TE5xHk3YzO"}, {"text": "“It has been 3 years and Donald Trump hasn’t done anything wrong. Donald Trump hasn’t done a single thing of which he has been accused.” @RushLimbaughEIB  @seanhannity  A Witch Hunt like no other!"}, {"text": "“This is the biggest, most disgusting scandal, and it’s all on the Democrat  Party that has highjacked the Impeachment process, our tax dollars, the House of Representatives, to push their 2020 Election. That’s what’s going on.” @marklevinshow  Cannot be said any better!"}, {"text": "Chicago will never stop its crime wave with the current Superintendent of Police. It just won’t happen! Thank you to Kevin Graham and all of the GREAT Chicago Police Officers I just had the privilege to meet. Tremendous crime fighting potential if allowed to do your thing!"}, {"text": "Wow, a blowout JOBS number just out, adjusted for revisions and the General Motors strike, 303,000. This is far greater than expectations. USA ROCKS!"}, {"text": "“The Democrats are so immersed in this (SCAM). They couldn’t care less about the American people!” @RushLimbaughEIB"}, {"text": "“The Democrats need more than this.” @tombrokaw  Much more!"}, {"text": "ISIS has a new leader. We know exactly who he is!"}, {"text": "“Adam Schiff has taken all of the power for himself. That is very unfair. There were dozens of people on this call, yesterdays witness knew that and had no problems (nor did any of them). Facts matter, and that’s why this is not about Impeachment.” Guy Lewis, former prosecutor..."}, {"text": "....@FoxNews  @BillHemmer  The public is watching and seeing for themselves how unfair this process is. Corrupt politicians, Pelosi and Schiff, are trying to take down the Republican Party. It will never happen, we will take back the House!"}, {"text": "LOUISIANA! Extreme Democrat John Bel Edwards has sided with Nancy Pelosi and Chuck Schumer to support Sanctuary Cities, High Taxes, and Open Borders. He is crushing Louisiana’s economy and your Second Amendment rights...."}, {"text": "....Our Republican candidate @EddieRispone is a successful conservative businessman who will stand with me to create jobs and protect your Second Amendment. GET OUT AND VOTE for Eddie, the next Governor of the GREAT State of Louisiana!"}, {"text": "Stock Market up BIG! Record highs for S&amp;P 500 and NASDAQ. Enjoy!"}, {"text": "....in New York, and another reason they are leaving. Taxes and energy costs are way too high, Upstate is being allowed to die as other nearby states frack &amp; drill for Gold (oil) while reducing taxes &amp; creating jobs by the thousands. NYC is getting dirty &amp; unsafe again, as...."}, {"text": "I love New York, but New York can never be great again under the current leadership of Governor Andrew Cuomo (the brother of Fredo), or Mayor Bill DeBlasio. Cuomo has weaponized the prosecutors to do his dirty work (and to keep him out of jams), a reason some don’t want to be..."}, {"text": ".....with a President and Federal Government that wants our wonerful City and State to flourish and thrive. I Love New York!"}, {"text": "....our great police are being disrespected, even with water dumped on them, because a Mayor and Governor just don’t “have their backs.” New York’s Finest must be cherished, respected and loved. Too many prople are leaving our special New York. Great leaders would work...."}, {"text": "Republicans have never been more unified than they are right now! The Dems are a mess under the corrupt leadership of Nervous Nancy Pelosi and Shifty Adam Schiff!"}, {"text": "Oh no, Beto just dropped out of race for President despite him saying he was “born for this.” I don’t think so!"}, {"text": "You can’t Impeach someone who hasn’t done anything wrong!"}, {"text": "The Whistleblower must come forward to explain why his account of the phone call with the Ukrainian President was so inaccurate (fraudulent?). Why did the Whistleblower deal with corrupt politician Shifty Adam Schiff and/or his committee?"}, {"text": "A great new book by Howie Carr, “What Really Happened, How Donald J. Trump Saved America From Hillary Clinton,” is on sale now. Howie is a talented New England force who was there at the very beginning!"}, {"text": "Tate Reeves will be a great Governor of Mississippi, and what an electric Rally last night. Vote for Tate on Tuesday! https://t.co/5AZHe5DT9A"}, {"text": "Louisiana has a chance to have a really great Governor in @EddieRispone. Auto insurance costs and taxes will be coming way down with Eddie, and your 2nd Amendment will be protected. Current Democrat governor has done a really poor job! VOTE EARLY FOR EDDIE!"}, {"text": "Big Rally in Kentucky on Monday night for a man who has worked really hard &amp; done a GREAT job, Governor @MattBevin. Kentucky is having the best economic year ever under Matt’s leadership. He is a fantastic guy who loves our Military, our Vets and our 2nd Amendment. Vote Tuesday!"}, {"text": "The Whistleblower has disappeared. Where is the Whistleblower?"}, {"text": "Schiff will change the transcripts just like he fraudulently made up the phone call. He is a corrupt politician! https://t.co/b12GFXv6tE"}, {"text": "A giant Scam! https://t.co/E2gcPaddD1"}, {"text": "Didn’t he pick the Whistleblower? https://t.co/yalRJr8DgA"}, {"text": "https://t.co/zJ9nW8i3ao"}, {"text": "..Every year, as the fire’s rage &amp; California burns, it is the same thing-and then he comes to the Federal Government for $$$ help. No more. Get your act together Governor. You don’t see close to the level of burn in other states...But our teams are working well together in....."}, {"text": "The Governor of California, @GavinNewsom, has done a terrible job of forest management. I told him from the first day we met that he must “clean” his forest floors regardless of what his bosses, the environmentalists, DEMAND of him. Must also do burns and cut fire stoppers....."}, {"text": "....putting these massive, and many, fires out. Great firefighters! Also, open up the ridiculously closed water lanes coming down from the North. Don’t pour it out into the Pacific Ocean. Should be done immediately. California desperately needs water, and you can have it now!"}, {"text": "The Whistleblower got it sooo wrong that HE must come forward. The Fake News Media knows who he is but, being an arm of the Democrat Party, don’t want to reveal him because there would be hell to pay. \n Reveal the Whistleblower and end the Impeachment Hoax!"}, {"text": "Great fight Champ! https://t.co/URRR7vnSCj"}, {"text": "Walking into Madison Square Garden last night with @danawhite for the big @UFC Championship fight was a little bit like walking into a Trump Rally. Plenty of MAGA &amp; KAG present. Great energy. Fantastic job Dana! Heading to D.C. and then to Kentucky for a big @MattBevin Rally..."}, {"text": "....Matt has been a GREAT Governor. Kentucky (I Love You!), please be sure to vote for Matt Bevin on TUESDAY. Matt will never let you down, and we have to send a strong signal to Nancy Pelosi and the Radical Left Democrats. See you on Monday night, VOTE TUESDAY!!!"}, {"text": "“Morrison testifies he saw nothing wrong with the Trump call.” @OANN"}, {"text": "Thank you to @OANN for the absolutely incredible Special Report narrated by @PearsonSharp. Seldom do the American people get to see journalistic work of this quality. Now it would be great if the legitimate sections of law enforcement would study your SMEARS, SPIES AND LIES...."}, {"text": "....and FEDERAL CONTRACTOR SPIES stories. The finest law enforcement on the planet could not have shown a ROADMAP like that which was produced by you. @OANN should be VERY proud of this great work. I wish more people were seeking the facts and the truth. Keep it up!"}, {"text": "Many people listened to my phone call with the Ukrainian President while it was being made. I never heard any complaints. The reason is that it was totally appropriate, I say perfect. Republicans have never been more unified, and my Republican Approval Rating is now 95%!"}, {"text": "The Angry Majority!"}, {"text": "Fake News! https://t.co/pL9gMFvZEn"}, {"text": "The Democrats are Fixers, and they are working overtime to FIX the Impeachment “Process” in order to hurt the Republican Party and me. Nancy Pelosi should instead Fix her broken District and Corrupt Adam should clean up &amp; manage the California forests which are always burning!"}, {"text": "The Fake News Media is working hard so that information about the Whistleblower’s identity, which may be very bad for them and their Democrat partners, never reaches the Public."}, {"text": "I hope everyone in the Great State of Virginia will get out and VOTE on Tuesday in all of the local and state elections to send a signal to D.C. that you want lower taxes, a strong Military, Border &amp; 2nd Amendment, great healthcare, and must take care of our Vets. VOTE REPUBLICAN"}, {"text": "Virginia has the best Unemployment and Economic numbers in the history of the State. If the Democrats get in, those numbers will go rapidly in the other direction. On Tuesday, Vote Republican!"}, {"text": "https://t.co/3O0ABd3HGt"}, {"text": "If Shifty Adam Schiff, who is a corrupt politician who fraudulently made up what I said on the “call,” is allowed to release transcripts of the Never Trumpers &amp; others that are &amp; were interviewed, he will change the words that were said to suit the Dems purposes. Republicans..."}, {"text": "....should give their own transcripts of the interviews to contrast with Schiff’s manipulated propaganda. House Republicans must have nothing to do with Shifty’s rendition of those interviews. He is a proven liar, leaker &amp; freak who is really the one who should be impeached!"}, {"text": "False stories are being reported that a few Republican Senators are saying that President Trump may have done a quid pro quo, but it doesn’t matter, there is nothing wrong with that, it is not an impeachable event. Perhaps so, but read the transcript, there is no quid pro quo!"}, {"text": "Don’t miss this show! https://t.co/EhY8CNAUqP"}, {"text": "We won’t Steve! https://t.co/iKr859gKEL"}, {"text": "Good point! https://t.co/L2ZyCY8QlI"}, {"text": "@marklevinshow Mark Levin: “We ought to talk about the substance of this phone call. We have the call, I don’t know what we need witnesses for? Can’t we read English? Do I need a Whistleblower to tell me what I’m reading? Do I need a Lt. C. to tell me? NO.” So plain and simple!"}, {"text": "Great Republican Geary Higgins has my complete and total Endorsement for Virginia Senate, 13th District. He is strong on Crime, the Border, our Military, Cutting Taxes, and protecting your 2nd Amendment. Dem John Bell will take your guns &amp; raise your taxes. Vote for Geary Higgins"}, {"text": "Louisiana, get out and Vote Early for @EddieRispone as your next Governor. Lower Taxes and car insurance. Will protect your 2nd Amendment. John Bel Edwards is always fighting our MAGA Agenda. Wants to raise your taxes and car insurance to the sky. Vote for Republican Eddie R!"}, {"text": "Great! But how do you know it was a “mistweet?” May be something with deep meaning! https://t.co/00EXMCgQLp"}, {"text": "Mark Levin, a great lawyer and scholar, said last night on his @marklevinshow, that all you have to do is read the transcript of the call, you do not need Never Trumpers or other witnesses to say what it means or says. It is plainly and very well stated for all to see. Witch Hunt"}, {"text": "What I said on the phone call with the Ukrainian President is “perfectly” stated. There is no reason to call witnesses to analyze my words and meaning. This is just another Democrat Hoax that I have had to live with from the day I got elected (and before!). Disgraceful!"}, {"text": "The Whistleblower gave false information &amp; dealt with corrupt politician Schiff. He must be brought forward to testify. Written answers not acceptable! Where is the 2nd Whistleblower? He disappeared after I released the transcript. Does he even exist? Where is the informant? Con!"}, {"text": "95% Approval Rating in the Republican Party. Thank you!"}, {"text": "“There is no Whistleblower. There is someone with an agenda against Donald Trump. What he was blowing the whistle on didn’t happen. We have the transcript of the call. This is all a farce and no Republican should forget that.” @dbongino @foxandfriends"}, {"text": "Stock Market hits RECORD HIGH. Spend your money well!"}, {"text": "Many people say they know me, claiming to be “best friends” and really close etc., when I don’t know these people at all. This happens, I suppose, to all who become President. With that being stated, I don’t know, to the best of my knowledge, a man named Michael Esposito....."}, {"text": "....I don’t like him using my name to build his consulting company, or whatever. Please advise his clients and Administration officials accordingly."}, {"text": "Big Rally in Kentucky TONIGHT for a man who has worked really hard &amp; done a GREAT job, Gov @MattBevin. Kentucky is having the best economic year ever under Matt’s leadership. He is a fantastic guy who loves our Military, our Vets and our 2A. Vote Tuesday! https://t.co/6MYQiI7c3X"}, {"text": "Read the Transcript!"}, {"text": "All-Time High for Stock Market and all the Fake News wants to talk about is the Impeachment Hoax!"}, {"text": "My son, @DonaldJTrumpJr is coming out with a new book, “Triggered: How the Left Thrives on Hate and Wants to Silence Us” – available tomorrow, November 5th! A great new book that I highly recommend for ALL to read. Go order it today!"}, {"text": "Vote for Sean Spicer on Dancing with the Stars. He is a great and very loyal guy who is working very hard! #MAGA https://t.co/JGvKANCRqZ"}, {"text": "Virginia, with all of the massive amount of defense and other work I brought to you, and with everything planned, go out and vote Republican today. I know the Dems are saying that they have your vote locked up, but that would mean a long slide down. VOTE REPUBLICAN TODAY!"}, {"text": "The Do Nothing Dems have gone Radical Left Crazy. The can’t get anything done! https://t.co/wasvWli9jr"}, {"text": "Fantastic being in the Great State of Kentucky last night. Vote for Matt Bevin NOW! @MattBevin  One of Best Governors in U.S. He will never let you down!"}, {"text": "“The Impeachment Hoax has fired up voters in Kentucky, Mississippi and Louisiana.” @foxandfriends"}, {"text": "A wonderful family and friends from Utah got caught between two vicious drug cartels, who were shooting at each other, with the result being many great American people killed, including young children, and some missing. If Mexico needs or requests help in cleaning out these....."}, {"text": "....monsters, the United States stands ready, willing &amp; able to get involved and do the job quickly and effectively. The great new President of Mexico has made this a big issue, but the cartels have become so large and powerful that you sometimes need an army to defeat an army!"}, {"text": "This is the time for Mexico, with the help of the United States, to wage WAR on the drug cartels and wipe them off the face of the earth. We merely await a call from your great new president!"}, {"text": "FIND YOUR POLLING LOCATION HERE! https://t.co/0rnhb4z3HU"}, {"text": "So sad to see what is happening in New York where Governor Cuomo &amp;  Mayor DeBlasio are letting out 900 Criminals, some hardened &amp; bad, onto the sidewalks of our rapidly declining, because of them, city. The Radical Left Dems are killing our cities. NYPD Commissioner is resigning!"}, {"text": "A very good start! Please all work hard to get a final deal. https://t.co/IYGeBqQIQ9"}, {"text": "KENTUCKY! \n \nGet out today and VOTE for @MattBevin and the entire Republican ticket! \n \nMISSISSIPPI! \n \nGet out today and VOTE for @TateReeves and the entire Republican ticket!\n \n#VoteOnNov5 #ElectionDay \n\nFind your polling location below!\nhttps://t.co/0rnhb4z3HU"}, {"text": "Thank you so much CLUB 45. You are truly Great Americans. See you in Florida! https://t.co/0NuayEXEPn"}, {"text": "KENTUCKY! #KYGov \n \nGet out today and VOTE for @MattBevin and the entire Republican ticket! \n \nMISSISSIPPI! #MSGov \n \nGet out today and VOTE for @TateReeves and the entire Republican ticket!\n\nPolls are open for a few more hours, find your location below! \nhttps://t.co/0rnhb4z3HU"}, {"text": "95% Approval Rating in the Republican Party. Thank you! https://t.co/Z0VHUlAwMD"}, {"text": "Great going Daniel, proud of you! https://t.co/0dUY5HoATN"}, {"text": "#ElectionNight  Won 5 out of 6 elections in Kentucky, including 5 great candidates that I spoke for and introduced last night. @MattBevin picked up at least 15 points in last days, but perhaps not enough (Fake News will blame Trump!). Winning in Mississippi Governor race!"}, {"text": "Congratulations to @tatereeves on winning Governor of the Great State of Mississippi. Our big Rally on Friday night moved the numbers from a tie to a big WIN. Great reaction under pressure Tate!"}, {"text": "A lot of winning in Kentucky. Check out the numbers. https://t.co/xcXIzIwylg"}, {"text": "Our big Kentucky Rally on Monday night had a massive impact on all of the races. The increase in Governors race was at least 15 points, and maybe 20! Will be in Louisiana for @EddieRispone on Wednesday night. Big Rally!"}, {"text": "Great going Tate! https://t.co/ghtl3Zmj1z"}, {"text": "Based on the Kentucky results, Mitch McConnell @senatemajldr will win BIG in Kentucky next year!"}, {"text": "“Based on the things I’ve seen, the Democrats have no case, or a weak case, at best. I don’t think there are, or will be, well founded articles of Impeachment here.” Robert Wray, respected former prosecutor. It is a phony scam by the Do Nothing Dems! @foxandfriends"}, {"text": "Thank you to Kurt Volker, U.S. Envoy to Ukraine, who said in his Congressional Testimony, just released, “You asked what conversations did I have about that quid pro quo, et cetra. NONE, because I didn’t know there was a quid pro quo.”  Witch Hunt!"}, {"text": "Stock Markets (all three) hit another ALL TIME &amp; HISTORIC HIGH yesterday! You are sooo lucky to have me as your President (just kidding!). Spend your money well!"}, {"text": "Just had a meeting with top representatives from Egypt, Ethiopia, and Sudan to help solve their long running dispute on the Grand Ethiopian Renaissance Dam, one of the largest in the world, currently being built. The meeting went well and discussions will continue during the day! https://t.co/MsWuEBgZxK"}, {"text": "....Also talked about their Border with Syria, the eradication of terrorism, the ending of hostilities with the Kurds, and many other topics. Look forward to seeing President Erdogan next Wednesday, November 13th at the @WhiteHouse!"}, {"text": "Just had a very good call with President @RTErdogan of Turkey. He informed me that they have captured numerous ISIS fighters that were reported to have escaped during the conflict – including a wife and sister of terrorist killer al Baghdadi…."}, {"text": "Thanks to many of you here today, my Administration and Republicans in Congress have now confirmed 157 FEDERAL JUDGES who will uphold our Constitution AS WRITTEN, a profoundly historic milestone and a truly momentous achievement! https://t.co/s7u6wjAvjB"}, {"text": "A great evening last night in Kentucky and Mississippi for the Republican Party with 13 BIG WINS, including a Governorship in Mississippi. Congratulations to everyone! https://t.co/bvQLOmwlbd"}, {"text": "https://t.co/uxVQ4b1iwS"}, {"text": "LOUISIANA! Early voting is underway until Saturday, it’s time to get out and VOTE to REPLACE Radical Liberal Democrat John Bel Edwards with a great new REPUBLICAN Governor, @EddieRispone! #GeauxVote\n\nPOLL FINDER: https://t.co/0rnhb4hsjk https://t.co/7RtlPqKu2U"}, {"text": "Years ago, when Media was legitimate, people known as “Fact Checkers” would always call to check and see if a story was accurate. Nowadays they don’t use “Fact Checkers” anymore, they just write whatever they want!"}, {"text": "The story in the Amazon Washington Post, of course picked up by Fake News CNN, saying “President Trump asked for AG Barr to host a news conference clearing him on Ukraine,” is totally untrue and just another FAKE NEWS story with anonymous sources that don’t exist...."}, {"text": "....The LameStream Media, which is The Enemy of the People, is working overtime with made up stories in order to drive dissension and distrust!"}, {"text": "Just returned to the @WhiteHouse after a great evening in Monroe, Louisiana with a massive turnout of Great American Patriots. With early voting underway until Sat, find your polling location below &amp; go vote for your next #LAgov, @EddieRispone! #GeauxVote➡️https://t.co/0rnhb4z3HU https://t.co/VLqgd5SOEc"}, {"text": "Bill Barr did not decline my request to talk about Ukraine. The story was a Fake Washington Post con job with an “anonymous” source that doesn’t exist. Just read the Transcript. The Justice Department already ruled that the call was good. We don’t have freedom of the press!"}, {"text": "The degenerate Washington Post MADE UP the story about me asking Bill Barr to hold a news conference. Never happened, and there were no sources!"}, {"text": "Read the Transcript!"}, {"text": "Based on the information released last night about the Fake Whistleblowers attorney, the Impeachment Hoax should be ended IMMEDIATELY! There is no case, except against the other side!"}, {"text": "“What did Hunter Biden do for the money?” @SenJohnKennedy  A very good question. He and Sleepy Joe must testify!"}, {"text": "It was just explained to me that for next weeks Fake Hearing (trial) in the House, as they interview Never Trumpers and others, I get NO LAWYER &amp; NO DUE PROCESS. It is a Pelosi, Schiff, Scam against the Republican Party and me. This Witch Hunt should not be allowed to proceed!"}, {"text": "THANK YOU! #MAGA https://t.co/e6dZshYFMV"}, {"text": "The Amazon Washington Post and three lowlife reporters, Matt Zapotosky, Josh Dawsey, and Carol Leonnig, wrote another Fake News story, without any sources (pure fiction), about Bill Barr &amp; myself. We both deny this story, which they knew before they wrote it. A garbage newspaper!"}, {"text": "The Radical Left Dems and LameStream Media are just trying to make it hard for Republicans and me to win in 2020. The new Impeachment Hoax is already turning against them!"}, {"text": "Stock Market up big today. A New Record. Enjoy!"}, {"text": "STATEMENT FROM PRESIDENT DONALD J. TRUMP https://t.co/EktztHfLk6"}, {"text": "https://t.co/z0I7wBsgTP"}, {"text": "I will be announcing the winners of the #MAGACHALLENGE and inviting them to the @WhiteHouse to meet with me and perform. Good luck! https://t.co/3PYzOvYz17"}, {"text": "“Mark Levin blasts Adam Schiff, claims 'the law is on the president's side' on Ukraine” https://t.co/GhO065fd8X"}, {"text": "Fake News is reporting that I am talking to Mark Burnett about doing a big show, perhaps The Apprentice, after the presidency, which I would assume they mean in 5 years. This is not true, never had such a conversation, don’t even have time to think about it. False reporting!"}, {"text": "Good luck Vince, this will be great! https://t.co/084GASJN6e"}, {"text": "True! https://t.co/dwdOnYAjlw"}, {"text": "We will win big! https://t.co/ZM01nPimh3"}, {"text": "Just finished reading my son Donald’s just out new book, “Triggered.” It is really good! He, along with many of us, was very unfairly treated. But we all fight back, and we always win!"}, {"text": "Bringing the word “Nationalism” back into the mainstream - great job by Rich Lowry! Very important book. https://t.co/yQI4ylGgDb"}, {"text": "But the Witch Hunt continues. After 3 years of relentless attacks against the Republican Party &amp; me, the Do Nothing Dems are losers for America! https://t.co/met2y8VoPe"}, {"text": "PRESIDENTIAL HARASSMENT!"}, {"text": "I recommend that Nervous Nancy Pelosi (who backed up Schiff’s lie), Shifty Adam Schiff, Sleepy Joe Biden, the Whistleblower (who miraculously disappeared after I released the transcript of the call), the 2nd Whistleblower (who also disappeared), &amp; the I.G., be part of the list!"}, {"text": "....Whatever happened to the so-called “informer” to Whistleblower #1? Seems to have disappeared after I released the Transcript of the call. Shouldn’t he be on the list to testify? Witch Hunt!"}, {"text": "95% Approval Rating in the Republican Party. Thank you! #MAGA #KAG2020"}, {"text": "Thank you Lee and David! https://t.co/cztdiqqiiH"}, {"text": "A terrible lie. How can she do such a thing? https://t.co/bSvlYI7dqe"}, {"text": "Totally! https://t.co/VqpNDMua5X"}, {"text": "Thank you to LSU and Alabama for a great game!"}, {"text": "But the Fake News will never show this. Thank you! https://t.co/T8grDsDRvJ"}, {"text": "Thank you Terrence! https://t.co/flwd34IsOn"}, {"text": "Thank you Andrew. Meadow was watching and is so proud of her great father and family!"}, {"text": "Great! https://t.co/QlLjEHUR0G"}, {"text": "Such GREAT people! https://t.co/y5IgJXXfXf"}, {"text": "“He is not a Whistleblower. He is a deepstater. Let the President do the job he was elected to do.” @JudgeJeanine"}, {"text": "https://t.co/KkZEHQMf8W https://t.co/DWb93QBKjB"}, {"text": "Such an amazing game &amp; place! https://t.co/dGmXYxgKV5"}, {"text": "Make America Great Again! https://t.co/ffS9kLtjxE"}, {"text": "ABC is as bad as the rest of them. Journalistic standards are nonexistent today. The press is so dishonest that we no longer have Freedom of the Press! https://t.co/nzF31cLYw7"}, {"text": "Corrupt politician Adam Schiff wants people from the White House to testify in his and Pelosi’s disgraceful Witch Hunt, yet he will not allow a White House lawyer, nor will he allow ANY of our requested witnesses. This is a first in due process and Congressional history!"}, {"text": "“There’s nothing there! I’m trying to let the House know that they’re dividing America for no good reason. We’ve got a lot of things we should be doing, like lowering drug costs &amp; getting a trade deal with Mexico and Canada.” @LindseyGrahamSC  The Do Nothing Dems have gone crazy!"}, {"text": "The call to the Ukrainian President was PERFECT. Read the Transcript! There was NOTHING said that was in any way wrong. Republicans, don’t be led into the fools trap of saying it was not perfect, but is not impeachable. No, it is much stronger than that. NOTHING WAS DONE WRONG!"}, {"text": ".@NikkiHaley is out with a new book, “With All Due Respect” this week. Make sure you order your copy today, or stop by one of her book tour stops to get a copy and say hello. Good luck Nikki! https://t.co/uHKAAlVuLt"}, {"text": "https://t.co/YuljikAYZT"}, {"text": "https://t.co/fRBs5FExir"}, {"text": "https://t.co/9mYIafMb9y"}, {"text": "If Iran is able to turn over to the U.S. kidnapped former FBI Agent Robert A. Levinson, who has been missing in Iran for 12 years, it would be a very positive step. At the same time, upon information &amp; belief, Iran is, &amp; has been, enriching uranium. THAT WOULD BE A VERY BAD STEP!"}, {"text": "A great new book just out, “The Plot Against the President. The True Story Of How Congressman Devin Nunes Uncovered the Biggest Political Scandal In U.S. History.” Shows very bad and corrupt people on the other side. Check it out! https://t.co/KQETvKO6Q9"}, {"text": "https://t.co/LEjupyeKxw https://t.co/tox0vh5bbd"}, {"text": "https://t.co/5NgNEZJm8G https://t.co/R5b47GeEp4"}, {"text": "HAPPY VETERANS DAY!"}, {"text": "Will be meeting with representatives of the Vaping industry, together with medical professionals and individual state representatives, to come up with an acceptable solution to the Vaping and E-cigarette dilemma. Children’s health &amp; safety, together with jobs, will be a focus!"}, {"text": "So with one Rally by me at the end of the campaign, I lift the poll numbers of Kentucky Governor Matt Bevin by 19 points, he just misses, every other Republican in the Commonwealth wins big, and the Fake News blames me for a bad night! OK! By the way, Mississippi won everything!"}, {"text": "The lawyer for the Whistleblower takes away all credibility from this big Impeachment Scam! It should be ended and the Whistleblower, his lawyer and Corrupt politician Schiff should be investigared for fraud!"}, {"text": "Shifty Adam Schiff will only release doctored transcripts. We haven’t even seen the documents and are restricted from (get this) having a lawyer. Republicans should put out their own transcripts! Schiff must testify as to why he MADE UP a statement from me, and read it to all!"}, {"text": "“The Chinese say (about Trump’s Trade War &amp; Tariffs), ‘he brought us to the table.’ This is the most prosperous economy the world has ever seen, and it’s going to be a very prosperous economy.” Jamie Dimon on @60Minutes  Thank you President Trump &amp; the Republican Party!"}, {"text": "Today, we come together as one Nation to salute the Veterans of the United States Armed Forces – the greatest warriors ever to walk on the face of the Earth. Our Veterans risked everything for us. Now, it is our duty to serve and protect THEM every day of our lives! https://t.co/vC3UGvWF9S"}, {"text": "Where is the Whistleblower who gave so much false information? Must testify along with Schiff and others!"}, {"text": "To think I signed the Whistleblower Protection Act! https://t.co/OSmPPcRs7x"}, {"text": "Read the Transcript. It is PERFECT!"}, {"text": "Schiff is giving Republicans NO WITNESSES, NO LAWYER &amp; NO DUE PROCESS! It is a totally one sided Witch Hunt. This can’t be making the Democrats look good. Such a farce!"}, {"text": "Just like Schiff fabricated my phone call, he will fabricate the transcripts that he is making and releasing!"}, {"text": "In order to continue being the most Transparent President in history, I will be releasing sometime this week the Transcript of the first, and therefore most important, phone call I had with the President of Ukraine. I am sure you will find it tantalizing!"}, {"text": "Schiff and the Dems have created this whole thing, they reverse engineer it. They’ve been vowing to impeach for three years. Why should we listen to them? Why should we want to?”  @greggutfeld @FoxNews"}, {"text": "“The President has until September 30th to give this aid to Ukraine. He gets it out on September 11th., 3 weeks before the deadline. So, we give our ally aid, and Joe Biden is not investigated. Remember that, they get the aid and we get nothing in return. The Democrats...."}, {"text": "....want that to be an impeachable offense? Good luck with that!” @JesseBWatters @FoxNews"}, {"text": "“This isn’t about Ukraine. This isn’t about Impeachment. This is about subverting Democracy!” @BillOReilly So true, and led by angry and dishonest people who hate themselves, and must hate our Country!"}, {"text": "A great try by @seanspicer. We are all proud of you!"}, {"text": "Why is such a focus put on 2nd and 3rd hand witnesses, many of whom are Never Trumpers, or whose lawyers are Never Trumpers, when all you have to do is read the phone call (transcript) with the Ukrainian President and see first hand? He and others also stated that there was....."}, {"text": "....Ukrainian energy company, and more millions taken from China, and now reports of other companies and countries also giving him big money, are certainly looking very corrupt (to put it mildly!) to me. Both Bidens should be forced to testify in this No Due Process Scam!"}, {"text": ".....”no pressure” put on him to investigate Sleepy Joe Biden even though, as President, I have an “obligation” to look into corruption, and Biden’s actions, on tape, about firing the prosecutor, and his son’s taking millions of dollars, with no knowledge or talent, from a....."}, {"text": "I will be releasing the transcript of the first, and therefore more important, phone call with the Ukrainian President before week’s end!"}, {"text": "Economy is BOOMING. Seems set to have yet another record day!"}, {"text": "Many of the people in DACA, no longer very young, are far from “angels.” Some are very tough, hardened criminals. President Obama said he had no legal right to sign order, but would anyway. If Supreme Court remedies with overturn, a deal will be made with Dems for them to stay!"}, {"text": "A total Impeachment Scam by the Do Nothing Democrats! https://t.co/aFTQe293JF"}, {"text": "DACA recipients with arrest records: 53,792! That is a very large proportion of the total. @LouDobbs  Not good, but we will be able to make a deal with the Dems!"}, {"text": "“This ridiculous Impeachment is a travesty, it’s not an inquiry. Just read the transcript.” @LouDobbs"}, {"text": "“The circus is coming to town. The corrupt, compromised, coward &amp; congenital liar Adam Schiff Show on Capital Hill, brought to you by his raging psychotic Democrats &amp; the top allies in the Media Mob. Everything you’re going to see in the next two weeks is rigged....."}, {"text": "....to hurt Donald Trump and we, the people that support him. The Left has never accepted the results of the 2016 Election. They never saw this coming. This is not just about President Trump. They hate everyone he is representing.” @seanhannity @FoxNews  Sean the amazing warrior!"}, {"text": "....This is a phony showtrial. There is zero due process, none. It is yet another fraudulent hoax conspiracy theory. It is another Witch Hunt. This is what the Socialist Doemocrat Party has become. There’s not one thing the Democrats have done in the past 3 years except try..."}, {"text": "“Millions of Americans will see what a partisan sham this whole thing is.” Rush Limbaugh @foxandfriends  Also, why is corrupt politician Schiff allowed to hand over cross examination to a high priced outside lawyer. Did that lawyer ever work for me, which would be a conflict?"}, {"text": "The Democrats have stacked the deck against President Trump and the Republicans. They have leaked out everything. @SteveDoocy @foxandfriends"}, {"text": "“Nancy Pelosi cares more about power than she does about principle. She did not want to go down this road. She realizes this is a huge loser for Democrats. The Founders envisioned the worst people being in politics, yet they couldn’t envision this. You have these people taking..."}, {"text": "...the most powerful tool the legislative branch has, Impeachment, &amp; they’ve turned it into a political cudgel, which is not at all what the Founders intended. When you hear Schiff use all these words like quid pro quo, it is because they can’t specify that Donald Trump broke.."}, {"text": "....any laws or did anything wrong, and they have to move away from quid pro quo because there was no quid, and there was no quo. Ukraine got it’s money (3 weeks early), and there was no investigation.” @CharlesHurt @foxandfriends"}, {"text": "NEVER TRUMPERS!"}, {"text": "READ THE TRANSCRIPT!"}, {"text": "https://t.co/FJ8gMdh5bX"}, {"text": "Thank you @FranklinGraham. It is a time of “shame” for our Country. The Democrats know what they are doing is wrong! https://t.co/O32ybh04vc"}, {"text": "Wow! Was just told that my son’s book, “Triggered,” is Number One on The New York Times Bestseller List. Congratulations Don!"}, {"text": ".@RepRatcliffe asked the two “star” witnesses, “where is the impeachable event in that call?” Both stared straight ahead with a blank look on their face, remained silent, &amp; were unable to answer the question. That would be the end of a case run by normal people! - but not Shifty!"}, {"text": "Hit New Stock Market record again yesterday, the 20th time this year, with GREAT potential for the future. USA is where the action is. Companies and jobs are coming back like never before!"}, {"text": "Walmart announces great numbers. No impact from Tariffs (which are contributing $Billions to our Treasury). Inflation low (do you hear that Powell?)!"}, {"text": "“Neither one of the Democrat star witnesses at the Impeachment hearings could point out an impeachable offense. That’s the result!” @Varneyco  @FoxBusiness"}, {"text": "“That hearing was about a policy dispute.” Robert Ray. “Regular people watching this cannot conclude that the President of the United States can be impeached.” @Varneyco"}, {"text": ".@DanHenninger  WSJ: Nancy Pelosi had it right the first time when she did not want to go down the Impeachment path. Make it a voting issue. But no, the Left insisted on raising this to the gravity of a constitutional crisis &amp; Impeachment. The hearings suggested it’s not going..."}, {"text": "....anywhere, so we’ve now had 3 years of the Democrats chasing Donald Trump. Nancy Pelosi’s worried about the American voter looking for someone to blame for that eventually. Look at her own story in the House. What have they done? The average American can’t identify anything..."}, {"text": "....that the House Democrats have done since she’s become Speaker, other than chase Donald Trump.” This Impeachment Hoax is such a bad precedent and sooo bad for our Country!"}, {"text": "Where’s the Fake Whistleblower?"}, {"text": "We continue to monitor the terrible events at Saugus High School in Santa Clarita, California through our ongoing communications with Local, State, and Federal Authorities...."}, {"text": "....We send our deepest condolences to the families and friends of those tragically lost, and we pray for the speedy recovery of the wounded."}, {"text": "Getting ready to land in Louisiana to do Rally with Great Republican @EddieRispone for Governor. He will get your taxes and auto insurance (highest in Country!) way down. Loves our Military &amp; Vets. Will protect your 2nd Amendment. VOTE SATURDAY!"}, {"text": "This Saturday, the eyes of history are looking at the people of Louisiana. If you want to defend your values, your jobs, and your freedom, then you need to REPLACE Radical Liberal John Bel Edwards with a true Louisiana Patriot: @EddieRispone! #GeauxVote https://t.co/odAuD5DFPB"}, {"text": "Democrats must apologize to USA: Ukrainian Foreign Minister Vadym Prystaiko said that “United States Ambassador Gordon Sondland did NOT link financial military assistance to a request for Ukraine to open up an investigation into former V.P. Joe Biden &amp; his son, Hunter Biden....."}, {"text": "....Ambassador Sondland did not tell us, and certainly did not tell me, about a connection between the assistance and the investigation.” THE FAKE IMPEACHMENT INQUIRY IS NOW DEAD!"}, {"text": "The Impeachment Witch Hunt should be over with the statement made last night by the President and Foreign Minister of Ukraine. Nervous Nancy Pelosi, who should be home cleaning up the dangerous &amp; disgusting Slum she is making of her District in San Francisco, where even the......"}, {"text": "......filth pouring into the Pacific Ocean is rapidly becoming an environmental hazard, is getting NOTHING DONE. She is a Do Nothing Democrat as Speaker, and will hopefully not be in that position very long. Approve USMCA, which has been sitting on her desk for months!"}, {"text": "Everywhere Marie Yovanovitch went turned bad. She started off in Somalia, how did that go? Then fast forward to Ukraine, where the new Ukrainian President spoke unfavorably about her in my second phone call with him. It is a U.S. President’s absolute right to appoint ambassadors."}, {"text": "....They call it “serving at the pleasure of the President.” The U.S. now has a very strong and powerful foreign policy, much different than proceeding administrations. It is called, quite simply, America First! With all of that, however, I have done FAR more for Ukraine than O."}, {"text": "Another Record Stock Market, 21 times this year, despite an ongoing, &amp; totally unfounded, Witch Hunt, &amp; a Democrat Party that would love to see a nice, big, juicy recession. In actuality, the potential for the United States is unlimited. We will power through the Do Nothing Dems!"}, {"text": "https://t.co/0zTfpzHCNK"}, {"text": "https://t.co/XE7ofTy7Sf"}, {"text": "https://t.co/ObHvebm4ry"}, {"text": "https://t.co/86HWwzDlEo"}, {"text": "https://t.co/qz1OfL56rg"}, {"text": "We have vacancies in various departments because we do not want or need as many people as past administrations (and save great cost), and also, the Democrats delay the approval process to levels unprecedented in the history of our Country!"}, {"text": "Stock Market up big. New and Historic Record. Job, jobs, jobs!"}, {"text": "So they now convict Roger Stone of lying and want to jail him for many years to come. Well, what about Crooked Hillary, Comey, Strzok, Page, McCabe, Brennan, Clapper, Shifty Schiff, Ohr &amp; Nellie, Steele &amp; all of the others, including even Mueller himself? Didn’t they lie?...."}, {"text": "....A double standard like never seen before in the history of our Country?"}, {"text": "https://t.co/8h6ZmdGlPf https://t.co/shaijXMXli"}, {"text": "THANK YOU! #MAGA #KAG https://t.co/Pcq7IbehVp"}, {"text": "https://t.co/YvlBpfsiTa"}, {"text": "#NewHoaxSameSwamp https://t.co/GIg9R9Txe0"}, {"text": "Good morning Louisiana! Polls are open at 7AM. Get out and VOTE for @EddieRispone to be your next Gov! He will get your taxes and auto insurance (highest in Country!) way down. Loves our Military &amp; Vets. Will protect your 2A. Find your polling place below: https://t.co/0rnhb4z3HU"}, {"text": "LOUISIANA, VOTE @EddieRispone TODAY! He will be a great governor!"}, {"text": "Dow hits 28,000 - FIRST TIME EVER, HIGHEST EVER! Gee, Pelosi &amp; Schitt have a good idea, “lets Impeach the President.” If something like that ever happened, it would lead to the biggest FALL in Market History. It’s called a Depression, not a Recession! So much for 401-K’s &amp; Jobs!"}, {"text": "“My support for Donald Trump has never been greater than it is right now. It is paramountly obvious watching this, these people have to go. You elected Donald Trump to drain the Swamp, well, dismissing people like Yovanovitch is what that looks like. Dismissing people like Kent.."}, {"text": "....and Taylor, dismissing everybody involved from the Obama holdover days trying to undermine Trump, getting rid of those people, dismissing them, this is what it looks like. It was never going to be claen, they were never going to sit by idly and just let Trump do this!” Rush L"}, {"text": "“Triggered,” a great book by my son, Don. Now number one on @NYTIMES LIST. Keep it there for a while!"}, {"text": "“I mean, come on. The Democrats are doing focus groups to try and figure out what words to use to move the needle. The Democrats know this is political and they’re just trying to drag Trump’s name into the mud!” Lisa Booth @foxandfriends Thank you Lisa!"}, {"text": "Congratulations Kimberley. Great book! https://t.co/IFlMf1qIrb"}, {"text": "True! https://t.co/ySWZMUnQfd"}, {"text": "https://t.co/YqJrGDPAOj"}, {"text": "https://t.co/65ERQ7YfUS"}, {"text": "https://t.co/5Tbgwkpv4p"}, {"text": "Visited a great family of a young man under major surgery at the amazing Walter Reed Medical Center. Those are truly some of the best doctors anywhere in the world. Also began phase one of my yearly physical. Everything very good (great!). Will complete next year."}, {"text": "Thank you Pete. Our great warfighters must be allowed to fight. I would not have done this for Sgt. Bergdahl or Chelsea Manning! https://t.co/3zM6LVqYn7"}, {"text": "A new Republican Star is born. Great going @EliseStefanik! https://t.co/9QH4oUa2eg"}, {"text": "Dowd never understood the pulse of the Republican Party, present or past. He’s just a 3rd rate hit job for Fake News @ABC! https://t.co/RMIWNmBqOb"}, {"text": "Mr. Chairman, Joe Biden may be Sleepy and Very Slow, but he is not a “rabid dog.” He is actually somewhat better than that, but I am the only one who can get you where you have to be. You should act quickly, get the deal done. See you soon! https://t.co/kO2k14lTf7"}, {"text": ".@MariaBartiromo has a GREAT show going on right now, 10:00 A.M. Fantastic guests talk about the Fake Impeachment!  @FoxNews"}, {"text": "Our great Farmers will recieve another major round of “cash,” compliments of China Tariffs, prior to Thanksgiving. The smaller farms and farmers will be big beneficiaries. In the meantime, and as you may have noticed, China is starting to buy big again. Japan deal DONE. Enjoy!"}, {"text": "A BIG difference! https://t.co/DFjge9s7fO"}, {"text": "Joe Ricketts, one of our Country’s most successful businessmen, including being the owner of the Chicago Cubs, has just written a great new book, THE HARDER YOU WORK, THE LUCKIER YOU GET. So true! Much can be learned from Joe. Go get the book!"}, {"text": "The Do Nothing Dems are now doing even less - and soooo much work to be done!"}, {"text": "I agree Katrina, Pam Bondi is a great woman! https://t.co/NllcAz0bWB"}, {"text": "https://t.co/z0I7wBsgTP"}, {"text": "https://t.co/YvlBpfsiTa"}, {"text": "https://t.co/Ks1BN41CGf"}, {"text": "https://t.co/Ypzhrlpgkz"}, {"text": "Paul Krugman has called me wrong from day one. People at the Failing New York Times are very angry at him for having “missed” by soooo much. Paul, match over! https://t.co/5kspoUPhIX"}, {"text": "https://t.co/8bPq1Oy71z"}, {"text": "https://t.co/N6jsblFuMc"}, {"text": "https://t.co/nJBvFD1fGD"}, {"text": "Thanks Eric! https://t.co/6Ai7bqto3P"}, {"text": ".@SteveScalise blew the nasty &amp; obnoxious Chris Wallace (will never be his father, Mike!) away on Chris’s lowest rated (unless I’m on) morning show. This kind of dumb and unfair interview would never have happened in the @FoxNews past. Great job Steve!"}, {"text": "Schiff is a Corrupt Politician! https://t.co/DDBqlfIFLV"}, {"text": "Paul Krugman of @nytimes has been wrong about me from the very beginning. Anyone who has followed his “words of wisdom” has lost a great deal of money. Paul, just concede the game, say I was right, and lets start a brand new game! https://t.co/O6bw61vcHL"}, {"text": "https://t.co/I3lO117SVh"}, {"text": "Tell Jennifer Williams, whoever that is, to read BOTH transcripts of the presidential calls, &amp; see the just released ststement from Ukraine. Then she should meet with the other Never Trumpers, who I don’t know &amp; mostly never even heard of, &amp; work out a better presidential attack!"}, {"text": "The Crazed, Do Nothing Democrats are turning Impeachment into a routine partisan weapon. That is very bad for our Country, and not what the Founders had in mind!!!!"}, {"text": "Republicans &amp; others must remember, the Ukrainian President and Foreign Minister both said that there was no pressure placed on them whatsoever. Also, they didn’t even know the money wasn’t paid, and got the money with no conditions. But why isn’t Germany, France (Europe) paying?"}, {"text": "https://t.co/ru2n7i2gzu"}, {"text": "Where is the Fake Whistleblower?"}, {"text": "https://t.co/D66PEkuX6d"}, {"text": "https://t.co/1Rg66Tn4uP"}, {"text": "“The Impeachment started before he even became President.” @greggutfeld  @FoxNews"}, {"text": "“All they do is bring up witnesses who didn’t witness anything.” @KatrinaPierson @SteveHiltonx  Nothing matters except the two transcripts of the presidential calls, and the statement of no pressure put out by Ukraine!"}, {"text": "https://t.co/Mqj5tXaDAz"}, {"text": "Never has the Republican Party been so united as it is now. 95% A.R. This is a great fraud being played out against the American people by the Fake News Media &amp; their partner, the Do Nothing Democrats. The rules are rigged by Pelosi &amp; Schiff, but we are winning, and we will win!"}, {"text": "Our Crazy, Do Nothing (where’s USMCA, infrastructure, lower drug pricing &amp; much more?) Speaker of the House, Nervous Nancy Pelosi, who is petrified by her Radical Left knowing she will soon be gone (they &amp; Fake News Media are her BOSS), suggested on Sunday’s DEFACE THE NATION...."}, {"text": "....that I testify about the phony Impeachment Witch Hunt. She also said I could do it in writing. Even though I did nothing wrong, and don’t like giving credibility to this No Due Process Hoax, I like the idea &amp; will, in order to get Congress focused again, strongly consider it!"}, {"text": "Just finished a very good &amp; cordial meeting at the White House with Jay Powell of the Federal Reserve. Everything was discussed including interest rates, negative interest, low inflation, easing, Dollar strength &amp; its effect on manufacturing, trade with China, E.U. &amp; others, etc."}, {"text": "“Congressman Van Drew (D-NJ) SLAMS Democrats for ‘fracturing the Nation’ with Impeachment probe. ‘We already know how it’s going to end.” @FoxNews"}, {"text": "https://t.co/BKo27n6tmz"}, {"text": "THANK YOU! #MAGA #KAG https://t.co/igO1r1cTHS"}, {"text": "GREAT NEWS! #MAGA #KAG https://t.co/GXDE2IlGGu"}, {"text": "Mark Levin speaking one week after I took office. This was always a planned COUP and the Radical Left Democrats will suffer at the polls in 2020! https://t.co/XHd5grQUaM"}, {"text": "At my meeting with Jay Powell this morning, I protested fact that our Fed Rate is set too high relative to the interest rates of other competitor countries. In fact, our rates should be lower than all others (we are the U.S.). Too strong a Dollar hurting manufacturers &amp; growth!"}, {"text": "The Do Nothing Democrats have disgraced our great Country! https://t.co/lcSs55Wo18"}, {"text": "Nancy Pelosi just stated that “it is dangerous to let the voters decide Trump’s fate.” @FoxNews  In other words, she thinks I’m going to win and doesn’t want to take a chance on letting the voters decide. Like Al Green, she wants to change our voting system. Wow, she’s CRAZY!"}, {"text": "NASDAQ UP 27% THIS YEAR ALONE!"}, {"text": "https://t.co/HvYx12NUkS"}, {"text": "https://t.co/z0I7wBsgTP"}, {"text": "I agree, but in the end we will win and save our Country from certain destruction! https://t.co/CPjdxq5hXT"}, {"text": "A great day for Republicans, a great day for our Country!"}, {"text": "Congressman Van Drew (D-NJ): We’ve spent millions of Dollars, in my opinion, tons of money, tons of time, tons of hurt, fracturing the Nation apart. I haven’t seen this to be a good thing.”"}, {"text": "Thank you Tennessee! https://t.co/MYP1FaJhUx"}, {"text": "Read the transcripts! https://t.co/gQxYzjWehV"}, {"text": "True. Great job @RepMikeTurner! https://t.co/T0AdyNLuVb"}, {"text": "The three year Hoax continues! https://t.co/Yht2KQb5aW"}, {"text": "“White House Confidence Grows As Hearings Wear On.” @WashTimes  This is just an attempted takedown of the Republican Party by the Do Nothing Democrats. It will never work. #2020"}, {"text": "Nancy Pelosi will go down as the least productive Speaker of the House in history. She is dominated by AOC Plus 3 and the Radical Left. Mexico and Canada, after waiting for 6 months to be approved, are ready to flee - and who can blame them? Too bad!"}, {"text": "https://t.co/HbgEgZsPZ9"}, {"text": "We join families of Kevin King &amp; Tim Weeks in celebrating their release from Taliban captivity. Thanks to President Ghani for his courageous support. Let’s hope this leads to more good things on the peace front like a ceasefire that will help end this long war. Proud of my team!"}, {"text": "Impeachment Witch Hunt is now OVER! Ambassador Sondland asks U.S. President (me): “What do you want from Ukraine? I keep hearing all these different ideas &amp; theories. What do you want? It was a very abrupt conversation. He was not in a good mood. He (the President) just said,”..."}, {"text": "....”I WANT NOTHING! I WANT NOTHING! I WANT NO QUID PRO QUO! TELL PRESIDENT ZELENSKY TO DO THE RIGHT THING!” Later, Ambassador Sondland said that I told him, “Good, go tell the truth!” This Witch Hunt must end NOW. So bad for our Country!"}, {"text": "I WANT NOTHING! https://t.co/KKUfwSIRAi"}, {"text": "Today I opened a major Apple Manufacturing plant in Texas that will bring high paying jobs back to America. Today Nancy Pelosi closed Congress because she doesn’t care about American Workers!"}, {"text": "If this were a prizefight, they’d stop it!"}, {"text": "https://t.co/ytr7dRvbUc https://t.co/G6lGfyxSUs"}, {"text": "Watch @TuckerCarlson, @seanhannity, @IngrahamAngle. Big News! @FoxNews"}, {"text": "“All four of Gordon Sondland’s lawyers are Democrat Donors.” @TuckerCarlson  Despite this, big win today for Republicans!"}, {"text": "Poll: Trump leads top 2020 Democrats in Wisconsin https://t.co/P7z7Si8I0h."}, {"text": "https://t.co/osezECwPO1"}, {"text": "Why do @ShannonBream &amp; @FoxNews waste airtime on Democrat Rep. Eric Swalwell, who recently left the Presidential Primaries having attained a grand number of ZERO in the polls. I don’t even know how that is possible. Fox should stay with the people that got them there, not losers!"}, {"text": "During my visit yesterday to Austin, Texas, for the startup of the new Mac Pro, &amp; the discussion of a new one $billion campus, also in Texas, I asked Tim Cook to see if he could get Apple involved in building 5G in the U.S. They have it all - Money, Technology, Vision &amp; Cook!l"}, {"text": "The Republican Party, and me, had a GREAT day yesterday with respect to the phony Impeachment Hoax, &amp; yet, when I got home to the White House &amp; checked out the news coverage on much of television, you would have no idea they were reporting on the same event. FAKE &amp; CORRUPT NEWS!"}, {"text": "Bob Mueller, after spending two years and 45 million dollars, went over all of my financials, &amp; my taxes, and found nothing. Now the Witch Hunt continues with local New York Democrat prosecutors going over every financial deal I have ever done. This has never happened to a....."}, {"text": ".....President before. What they are doing is not legal. But I’m clean, and when I release my financial statement (my decision) sometime prior to Election, it will only show one thing - that I am much richer than people even thought - And that is a good thing. Jobs, Jobs, Jobs!"}, {"text": "“Freed Taliban hostages arrive in Germany.” @foxandfriends  @FoxNews @OANN  We got them back!"}, {"text": "I never in my wildest dreams thought my name would in any way be associated with the ugly word, Impeachment! The calls (Transcripts) were PERFECT, there was NOTHING said that was wrong. No pressure on Ukraine. Great corruption &amp; dishonesty by Schiff on the other side!"}, {"text": "Corrupt politician Adam Schiff’s lies are growing by the day. Keep fighting tough, Republicans, you are dealing with human scum who have taken Due Process and all of the Republican Party’s rights away from us during the most unfair hearings in American History......"}, {"text": ".....But we are winning big, and they will soon be on our turf."}, {"text": "“The new House Resolution gives Adam Schiff (the most dishonest man in politics) the power unilaterally to release edited transcripts. Rule 10 gives Chairman Schiff absolutely no jurisdiction. Subpoenas issued as part of Dems’ Impeachment inquiry are illegal.” Sam Dewey @FoxNews"}, {"text": "....”Nothing gives Schiff jurisdiction over Impeachment.”"}, {"text": "The Navy will NOT be taking away Warfighter and Navy Seal Eddie Gallagher’s Trident Pin. This case was handled very badly from the beginning. Get back to business!"}, {"text": "Read the two Transcripts of Ukrainian calls!"}, {"text": "I have been watching people making phone calls my entire life. My hearing is, and has been, great. Never have I been watching a person making a call, which was not on speakerphone, and been able to hear or understand a conversation. I’ve even tried, but to no avail. Try it live!"}, {"text": "Ken Starr, Former Independent Counsel: “Does this reach the level of treason, bribery or other high crimes and misdemeanors? My assessment of the evidence so far, NO WHERE CLOSE. The evidence is conflicting &amp; ambiguous. Ambassador Sondland’s testimony stated that...."}, {"text": ".....President Trump said the Ukraine President should just do the right thing (No Quid Pro Quo). You shouldn’t charge, but you cannot convict, a sitting president on the basis of conflicting and ambiguous evidence, and destabilize the American Government.” Thank you Ken!"}, {"text": "Iran has become so unstable that the regime has shut down their entire Internet System so that the Great Iranian people cannot talk about the tremendous violence taking place within the country...."}, {"text": "....They want ZERO transparency, thinking the world will not find out the death and tragedy that the Iranian Regime is causing!"}, {"text": "SCHIFF'S \"FACT\" WITNESSES! https://t.co/Pab2y1BVoN"}, {"text": "\"SCHIFF'S CHARADE\" @SeanHannity https://t.co/Go2HsiEyTT"}, {"text": "MARK LEVIN ON IMPEACHMENT HYSTERIA! https://t.co/sFT4qGqajO"}, {"text": "https://t.co/HvYx12NUkS"}, {"text": "Thank you @EliseStefanik and @SteveScalise, GREAT JOB! https://t.co/K8qQbCAXbj"}, {"text": "https://t.co/h92LyjD0Eh"}, {"text": "“Former FBI Employee Accused of Altering FISA Documents.” Hello, here we go! @foxandfriends"}, {"text": "I will be interviewed on @foxandfriends this morning at 8:00 A.M. I know that there’s not much to talk about, but we will try to keep the conversation going. Enjoy! @SteveDoocy @ainsleyearhardt @kilmeade"}, {"text": "Thank you to @senatemajldr Mitch McConnell and @GOPLeader Kevin McCarthy for their Great Leadership! There has never been so much unity and spirit in the Republican Party, as there is right now!"}, {"text": ".@SecAzar and I will soon release a plan to let Florida and other States import prescription drugs that are MUCH CHEAPER than what we have now! Hard-working Americans don’t deserve to pay such high prices for the drugs they need. We are fighting DAILY to make sure this HAPPENS..."}, {"text": "...House Republicans are showing real LEADERSHIP and prepared to enact bipartisan solutions for drug prices. Do Nothing Democrats are playing partisan politics with YOUR drug prices! We are READY to work together if they actually want to get something done!"}, {"text": "...Pelosi and her Do Nothing Democrats drug pricing bill doesn’t do the trick. FEWER cures! FEWER treatments! Time for the Democrats to get serious about bipartisan solutions to lowering prescription drug prices for families..."}, {"text": "...While we had the first prescription drug price decrease in 50 years, Americans still pay far too much for drugs – other countries pay far less – that is WRONG! We will soon be putting more options on the table..."}, {"text": "https://t.co/Mn4EJ7Jbh8"}, {"text": "“The support for Impeachment is not there. I think the Democrats will have to come up with a new game plan.” @jasoninthehouse @FoxNews"}, {"text": "Adam Schiff will be compelled to testify should the Democrats decide, despite the fact that my presidential conversations were totally appropriate (perfect), to go forward with the Impeachment Hoax. Polls have now turned very strongly against Impeachment!"}, {"text": "Joe Concha, The Hill: “In Emerson College Poll, Impeachment among independents, 49% Oppose, 34% Support. You see why Pelosi is reluctant to go in with this. Dems have to go home and explain why they haven’t done something on Opioid crisis, drug prices, USMCA, the Border, etc."}, {"text": "“The Democrats dirty tricks have started this whole thing. The Whistleblower, the guy who took his case to Schiff’s staff first, is what really blows the lid off this entire saga. He worked for Biden on Ukraine policy when Biden was VP. He worked for deep state henchman John"}, {"text": ".....Brennan, too. And the Whistleblower also worked for Susan Rice. It’s an understatement to say that this is a Witch Hunt.” @IngrahamAngle  They spied on my campaign!"}, {"text": "Daniel Cameron, who just won the A.G. race in the Great Commonwealth of Kentucky, is a young and very talented political star. You will be hearing much from Cameron in the years to come!"}, {"text": "NEW YORK POST EDITORIAL. “Worse Than Pointless. All those hours of televised testimony plainly failed on their announced goal: to change American’s minds. Part of the problem is that Democrats already leaked the best evidence they had. More important, NOT ONE WITNESS OFFERED....."}, {"text": "....ANY DIRECT EVIDENCE THAT PRESIDENT TRUMP DID ANYTHING IMPEACHABLE. No one heard him order a quid pro quo. No one offered a convincing reason why Trump’s interest in having Ukraine probe potential cortuption warrants Impeachment. “I want no Quid Pro Quo” Ambassador...."}, {"text": "....Sondland said Trump told him. None of this will move the needle for anyone. And now Dems in Swing Districts head home for Thanksgiving to hear from voters. Pelosi &amp; Co. are putting on a show to appease the Democratic base instead of doing the work ALL Americans need done.”"}, {"text": "Thank you Kevin for the nice words! https://t.co/DfY1V38EhD"}, {"text": "95% Approval Rate in the Republican Party, a record! Thank you!"}, {"text": "https://t.co/iSzJDM7CZw"}, {"text": "https://t.co/x7ATRLwGpY"}, {"text": "https://t.co/XexXL5HYRU"}, {"text": "Pushed hard to have Apple build in USA! https://t.co/BRfXBkJdc2"}, {"text": "Navy Seal Eddie Gallagher will be on @foxandfriends this morning at 7:30 A.M. Have no fear, all will end well for everyone!"}, {"text": "Nancy Pelosi, Adam Schiff, AOC and the rest of the Democrats are not getting important legislation done, hence, the Do Nothing Democrats. USMCA, National Defense Authorization Act, Gun Safety, Prescription Drug Prices, &amp; Infrastructure are dead in the water because of the Dems!"}, {"text": "Polls have now turned very strongly against Impeachment, especially in swing states. 75% to 25%. Thank you!"}, {"text": "Too bad we didn’t have the G-7 here. I offered to pick up the entire cost, would have saved at least $35,000,000 for the USA. Best location. Very stupid people thought I would gain. Wrong! Looking at Camp David. Will announce soon. https://t.co/8RF7IHVyxN"}, {"text": "This is the real story behind the Do Nothing Democrats! https://t.co/4tPTICdSR1"}, {"text": "The Unspoken Truth: What Impeachment Exposed About Trump and 2020 https://t.co/pYTYBcD55I"}, {"text": "Exclusive: Elise Stefanik Reflects on Her Two-Week Whirlwind https://t.co/5SownqVBuD"}, {"text": "Agnes, your great boy Ronald is looking down, very proud of you! https://t.co/BHPu6IIdAN"}, {"text": "100% Correct! https://t.co/VJfkmaraGV"}, {"text": "But I did nothing wrong. Read the Transcripts (2)! https://t.co/Ef9O5kOgrg"}, {"text": "Witch Hunt! https://t.co/CvZtyHMsGo"}, {"text": "This is a great and well reseached book on Justice K. The Ruth Marcus book is a badly written &amp; reseached disaster. So many incorrect facts. Fake News, just like the @washingtonpost! https://t.co/i6GwghuEsU"}, {"text": "The Impeachment Scam is driving Republican Poll Numbers UP, UP, UP! Thank you Shifty."}, {"text": "“The whole Russia thing was a Hoax, and the Ukraine thing is a Hoax, and the Democrats are a Joke. This is a disaster for them!” @DevinNunes @FoxNews The Do Nothing Democrats are hurting our Country, and they don’t care!"}, {"text": "Democrats going back to their Districts for Thanksgiving are getting absolutely hammered by their constituents over the phony Impeachment Scam. Republicans will have a great #2020 Election!"}, {"text": "I was not pleased with the way that Navy Seal Eddie Gallagher’s trial was handled by the Navy. He was treated very badly but, despite this, was completely exonerated on all major charges. I then restored Eddie’s rank. Likewise, large cost overruns from past administration’s....."}, {"text": "....honors that he has earned, including his Trident Pin. Admiral and now Ambassador to Norway Ken Braithwaite will be nominated by me to be the new Secretary of the Navy. A man of great achievement and success, I know Ken will do an outstanding job!"}, {"text": "....contracting procedures were not addressed to my satisfaction. Therefore, Secretary of the Navy Richard Spencer’s services have been terminated by Secretary of Defense Mark Esper. I thank Richard for his service &amp; commitment. Eddie will retire peacefully with all of the....."}, {"text": "“President Trump is facing a process which is unprecedented for its unfairness.” Sam Dewey"}, {"text": "Support for Impeachment is dropping like a rock, down into the 20’s in some Polls. Dems should now get down to work and finally approve USMCA, and much more!"}, {"text": "“The Democrats are getting hit and slammed on Impeachment. It is getting less and less popular by the day.” @kilmeade @foxandfriends"}, {"text": "Another new Stock Market Record. Enjoy!"}, {"text": "https://t.co/BETsNAWsNs"}, {"text": "“DOW, NASDAQ, S&amp;P 500 CLOSE AT RECORD HIGHS” https://t.co/q8IuuuUGjb"}, {"text": "“Democrats committed to impeaching Trump for no reason.” Will backfire into big 2020 Victory for Republicans! @IngrahamAngle"}, {"text": "https://t.co/Rya9MUlX1v"}, {"text": "“Poll shows Dems losing interest in Impeachment inquiry all across the board. These Polls are actually devastating to the Democrats. But the writing was on the wall. He’s done so many great things. He’s devastated ISIS &amp; killed AlBaghdadi, building Wall.” Jason Meister @FoxNews"}, {"text": "Great job Heather! https://t.co/8OX8wkug4t"}, {"text": "I will always protect our great warfighters. I’ve got your backs!"}, {"text": "When the Military rips down an old &amp; badly broken Border Wall in an important location, &amp; replaces it with a brand new 30 ft. high Steel &amp; Concrete Wall, Nancy Pelosi says we are not building a Wall. Wrong, and it is going up fast. Brandon Judd just gave us great marks! @FoxNews"}, {"text": "The D.C. Wolves and Fake News Media are reading far too much into people being forced by Courts to testify before Congress. I am fighting for future Presidents and the Office of the President. Other than that, I would actually like people to testify. Don McGahn’s respected...."}, {"text": "...lawyer has already stated that I did nothing wrong. John Bolton is a patriot and may know that I held back the money from Ukraine because it is considered a corrupt country, &amp; I wanted to know why nearby European countries weren’t putting up money also. Likewise, I would...."}, {"text": "...love to have Mike Pompeo, Rick Perry, Mick Mulvaney and many others testify about the phony Impeachment Hoax. It is a Democrat Scam that is going nowhere but, future Presidents should in no way be compromised. What has happened to me should never happen to another President!"}, {"text": "https://t.co/1EYKod0tee"}, {"text": "“OMB Official: Ukraine Aid Held Up Because Other Countries Weren't Giving” https://t.co/nYwMq3M5SB"}, {"text": "THANK YOU FLORIDA! #KAG2020 https://t.co/mNB4KMEj9u"}, {"text": "https://t.co/Jd7IbQBUvu"}, {"text": "GOD BLESS THE U.S.A.! #MAGA\nhttps://t.co/CYkQGHAgcx"}, {"text": "https://t.co/11nzKwOCtU"}, {"text": "People now realize it is a Democrat Hoax! https://t.co/6O3lFa2wU7"}, {"text": "New Stock Market Record today, AGAIN. Congratulations USA!"}, {"text": "95% Approval Rating in the Republican Party. Thank you!"}, {"text": "HAPPY THANKSGIVING! https://t.co/2GoxJEk6fN"}, {"text": "HAPPY THANKSGIVING! https://t.co/7SGZnHindW"}, {"text": "I thought Newsweek was out of business? https://t.co/3ro4eSJloo"}, {"text": "Just returned to the United States after spending a GREAT Thanksgiving with our Courageous American Warriors in Afghanistan! https://t.co/b2vgY5BH6z"}, {"text": "https://t.co/AUoFQexhR4"}, {"text": "Thank you to @BuckMcNeely1 and Oliver North for the nice words and thoughts in an excellent interview. Best wishes!"}, {"text": "And the Do Nothing Democrats want to impeach President Trump? https://t.co/i3tPDJtuuA"}, {"text": "Robert Johnson knows business &amp; politics. He also understands lowest African American Unemployment in U.S. history! https://t.co/NalNOFG53T"}, {"text": "I will be representing our Country in London at NATO, while the Democrats are holding the most ridiculous Impeachment hearings in history. Read the Transcripts, NOTHING was done or said wrong! The Radical Left is undercutting our Country. Hearings scheduled on same dates as NATO!"}, {"text": "Nancy Pelosi won’t put it up for a vote. Has delayed it for 6 months. See you in #2020! https://t.co/lOrWm9u10r"}, {"text": "An incredible experience! https://t.co/n6BNQY6dIx"}, {"text": "“Sen. Tim Scott Says Trump 'Innocent,' 'No Way' Senate Convicts” https://t.co/P6ONkI8n0P"}, {"text": "“Trump did nothing impeachable, day-by-day review of all impeachment hearing testimony shows” @GreggJarrett https://t.co/QbFeEmWkTB"}, {"text": "“Schiff’s impeachment hearings wasting time when Congress must do real work” https://t.co/4lb9bWrVRL"}, {"text": "....in America, community by community where we will eradicate AIDS in 10 years, program already started. American leadership has proven that together we can save lives."}, {"text": "On World AIDS Day, The First Lady and I express our support for those living with HIV/AIDS and mourn the lives lost. We reaffirm our commitment to end the HIV/AIDS epidemic...."}]