[{"text": "@kmlellenburg Ocat Yadseut"}, {"text": "@brandoncarney Frenchy Dipshire"}, {"text": "@TheMattCamp Chick Notoppingston"}, {"text": "@Betty73326590 Boring Von Trollington"}, {"text": "@dingy_64 Frudu Boggens"}, {"text": "@Lostairship Bake Chively"}, {"text": "@WorldBossJah No you don't, but...\nLidsley Alonia"}, {"text": "@steveejon Joe"}, {"text": "@tha_jamaican_1 Choco Frostinator"}, {"text": "@sawmillthug Bacolas Beefli"}, {"text": "@JunkRobbaz Spoonsly Frosticus"}, {"text": "@TrickEBot Leafless Chicky Styles"}, {"text": "@NScrufftuna Eats Alliton"}, {"text": "@slothththththth Sure. +1 to your charm. Why not?"}, {"text": "@HaugJonathon Square Beefington"}, {"text": "@Payalstyles030 🙌🙌🙌🙌🙌"}, {"text": "@njhero3 Dweebzy Unoriginalion"}, {"text": "@DarthGator955 Salsa Crunchleaf"}, {"text": "@Luu_Dogg Fork Fritas"}, {"text": "@ANagusame Dippus Saucingshire"}, {"text": "@Brycen7 Buck Spicenish"}, {"text": "@Diegomontana12 Fourthrite Fourthing Fourfather The Fourth"}, {"text": "@earthlypuma Sippity Doodah"}, {"text": "@Chaungu81946211 Chillbo Dippins"}, {"text": "@Reece76007181 Choco Soft Servington"}, {"text": "@xbtusdyy Zip Spicerton the Tenth"}, {"text": "@niqqa_pasta Bagley Saltingstone"}, {"text": "@MissSariBlu Stack Baconcrisp"}, {"text": "@MIkonik12 First, it's you're. \nSecond, while Wendy wasn't adopted, her father Dave was. That's why the Dave Thomas Foundation for Adoption was his passion\nDespite your attempt to use it as an insult, many lives are made better through the adoption process."}, {"text": "@MeggzCharm Sweetin Saltshire"}, {"text": "@Yorktown4250 Beefston Plainsboro"}, {"text": "@WalterWesley14 Slacker Moochingstone"}, {"text": "@MARLEYandMOM Leif Crunchenmunch"}, {"text": "@Jennlynn1101 They are testing one in Canada."}, {"text": "@IcyDurrr Crisp Baconnugg."}, {"text": "@LostZenz_YT Spice Dippsworth"}, {"text": "@Hamilton05Joey Salt Taterstine"}, {"text": "@the_Jack_Hatter Chilli Vanilli"}, {"text": "@PeepsRoyale Acrosston Pondictus"}, {"text": "@FhathurS Yawnsly Boringjoke"}, {"text": "@KingAramis525 Fively Buckstus"}, {"text": "@alexisloera6 Cheesimus Borgarshire"}, {"text": "@Caleb_Mc_Waleb Shot Downington"}, {"text": "@NachoDogs Asiagoth Ranchingcrunch"}, {"text": "@daddydampbread ok jabroni"}, {"text": "@DoubleAUB Dr. Beef Sippsworth"}, {"text": "@IAmJuanGz Combo Spicinshire"}, {"text": "@bucknbroncos Baconia Junior"}, {"text": "@ZweihanderRPG Saltine Sweetswall"}, {"text": "@konnor_blank2 https://t.co/UbcAtbD8NT"}, {"text": "@NateTG502 Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@FSonda5 That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@JoTripp18 This isn’t the quality we expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@classicstarr Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@ashleyperogino We’re sorry you had an experience like this. Can you provide us with the address of your visit, along with your contact info so we can make it up to you?"}, {"text": "@nicolletteburns That's not okay. Please DM us with the address of this location, along with your phone number, and we'll make it up to you."}, {"text": "@KFromsouthpark We’d love to make this right. DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@DoorDash Dashington Doorsbury"}, {"text": "@RTAHisFace_ This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@LaughingGiraffy We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@chamm2281 Renee is the best!"}, {"text": "@AndySlagter That's not okay. Can you DM us with the full address of your visit, along with your contact info?"}, {"text": "@nowaytosunday That's not okay! Please DM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@maskedray Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@jessicaakin14 That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@hopingfearfully This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@mediabeast27 That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@AdamHeise That's not okay! Please DM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@bella_3301 We're sorry to hear that! Please DM us your phone # so we can look into this further. Thanks!"}, {"text": "Haha, you were hoping someone cool like Mr. PBH would show up, but nope. Random Wendy's logo. Outta Nowhere! haha yeah! https://t.co/JmjocwQNdd"}, {"text": "@ESiguetodo schwifty haha yeah"}, {"text": "@Baloneyjuice it's alright doing yard work and whatnot"}, {"text": "@alexisloera6 wubba lubba dub dub haha yeah"}, {"text": "@TavionEsmond watch both"}, {"text": "@Gcristian01 epic gamer move"}, {"text": "@Pyrostanical1 best logo haha"}, {"text": "@SesaLil we can go as low as four"}, {"text": "@Idontdodrugs01 ayyyyyeeeee"}, {"text": "@putmeinthemcu cool"}, {"text": "@spongbob_facts just a big ol logo slapped on there so you can remember square cheeseburger when you get schwifty haha yeah"}, {"text": "@TheWo1fen Someone get this person some medicine!"}, {"text": "@Andrew96004712 haha yeah"}, {"text": "@norms456 that's the guy. Pencilvester's friend"}, {"text": "@LetsHappy0350 yes"}, {"text": "@BlkLarryDavid 3 most dangerous letters in sports entertainment"}, {"text": "@isplover133 https://t.co/W9w7BO8uCZ"}, {"text": "@hoofthetacoman sweet delicious brand. \nbrand likes what you like.\nyou like brand now."}, {"text": "@isplover133 don't think that's much of their demo tbh"}, {"text": "@DrBatman8283 Once you figure it out, stop looking in the mirror and watch this Richard and Mortimer video"}, {"text": "@marissaaa_88 thanks"}, {"text": "@OtisDojo That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@CurtisJamesBell This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@KellyPutm We'll be waiting! Have you downloaded our app? If so, DM us your email address so we can push you an offer to use on your next visit with us."}, {"text": "@geeknik Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@sar_fong That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@jenna_marie_93 Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@CAguilarTO That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@FrasisAssmore HI there- That's not okay! Please DM us the restaurant location and your phone number so we can look into this. Thanks!"}, {"text": "@playboiuwu Hi there-\nWe're disappointed to hear this. DM us the address, we'd like to gather some additional details about your order. Also, please provide us with your name and phone number so that we can follow up to make things right."}, {"text": "@DylanM64 Hi there-\nWe're disappointed to hear this. DM us the address, we'd like to gather some additional details about your visit. Also, please provide us with your phone number so that we can follow up to make things right."}, {"text": "@aaronblues2 Hi there- We'd love to make this right. DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@_maryobrien_ Hi there- We're sorry you left disappointed! Will you DM us the address of your visit and your phone number? We’d love to make things up to you."}, {"text": "@Clhancock07 Hi there- This isn't the service we expect. Please DM us with the location and your phone number so we can look into this further."}, {"text": "@MihaelMELLO_K Hi there-\nOh no! Please DM us the restaurant location with your name and phone # so we can make this right. Thanks!"}, {"text": "@theodyse Hi there-\nThis isn't the service we expect. Please DM us with the location, your name and phone number so we can look into this further."}, {"text": "@thedanielazahra We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@RecepiecE That's not okay! Please DM us the restaurant location and your phone # so we can investigate this. Thanks!"}, {"text": "@chuckmelrath Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@rene_gray We're sorry you left disappointed! Can you DM us the address of your visit and your phone number? We’d love to make things up to you."}, {"text": "@chelseybuggie That is great to hear! What location did you visit? We will share your compliments with their management team."}, {"text": "@NATECLlP Oh no! That’s not the quality we expect from our restaurants. Can you DM us the address of the Wendy's you visited, and your phone number so we can make this right?"}, {"text": "@shivanie6 That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@appaquarhor This isn't the service we expect. Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@alloutaudio Oh no! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@officialgolden Oh no! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@mikepizzitola This isn’t the quality we expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@CloudGeko123 Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@SarahKillings15 We're sorry you left disappointed! Can you DM us the address of your visit and your phone number? We’d love to make things up to you."}, {"text": "@Miriam26Lopez We'd love to make this right. DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@realcj8717 We're disappointed to hear this. DM us, we'd like to gather some additional details about your visit. Also, please provide us with your phone number so that we can follow up to make things right."}, {"text": "@dandisturbed Accurate"}, {"text": "@B_On_Fly_Ish It’ll be nationwide next year"}, {"text": "@RocketCorn See you soon"}, {"text": "@JosephSimeone11 We’d love to make this right. DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@DawnDaJet This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@kripsterr17 We're sorry to hear this! Please DM us the restaurant location and your phone # so we can look into this further. Thanks!"}, {"text": "@IHateKPop12345 That's not happening"}, {"text": "@YabbaDabbaJew Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@rediniamoney This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@BRowengartner That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@javonnaali This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@Ada00764149 @GreenpeaceCA Thanks for reaching out! We’ll pass this on to our product team!"}, {"text": "@amandakantorcik Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@V3XTweets That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@Flenz90 This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@rayz_o_sunshine We’re sorry about this! Can you please DM us with what happened tonight? We would also like to have your phone number and the restaurant address so that we can have someone from the management team contact you to make this right."}, {"text": "Oh, just rolling out free food for our 50th birthday nbd. https://t.co/7EkNQLMLKA"}, {"text": "@putmeinthemcu color scheme looking sharp"}, {"text": "@Complex Let's party"}, {"text": "@AliAmee06867824 😐"}, {"text": "@mcfrostysalty 😂"}, {"text": "@cluckiee it's true"}, {"text": "@aquillafern Oh no! That’s not the quality we expect from our restaurants. Can you DM us the address of the Wendy's you visited, and your phone number so we can make this right?"}, {"text": "@skittles_kid93 you get the things you win"}, {"text": "@TheSkram bet"}, {"text": "@kirbyman384 thanks"}, {"text": "@BanCoolMan_RL no u"}, {"text": "@MackenzieWacht1 come through"}, {"text": "@nestiabudi eat"}, {"text": "@iisadouche no, that says scan"}, {"text": "@LiamDugan13 This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@MikeJReed That’s too long to wait! Can you DM us the address of the Wendy's you visited, and your phone number so we can make this up to you?"}, {"text": "@ADrogowski That's not okay. Please DM us with the address of this location, along with your phone number, and we'll make it up to you."}, {"text": "@Stebie20 This isn't the service we expect. Please DM us with your contact info so we can look into this further."}, {"text": "@jhaneslvld nice"}, {"text": "@beanzym We’re sorry to hear that! Would you like a follow-up call from the management team above this restaurant? If so, please DM us your phone number!"}, {"text": "@_kristimurphy Hi there-\nWe'd love to make this right. DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@EliseOrSomeShit ugh"}, {"text": "@ohmybriah Hi there- We take things like this very seriously. Will you DM us the address of your visit and your phone number? We’d love to make this up to you."}, {"text": "@Miami_hesstj2 why do you even bother tweeting when no one follows you? \nIt's just one of those enigmas."}, {"text": "@sweetivaree ;)"}, {"text": "@20Valencia02 We have Birthday Cake Frosty right now, and it is delicious."}, {"text": "@FromAVillainPOV Hi there-\nWe're sorry you left disappointed! Will you DM us the address of your visit and your phone number? We’d love to make things up to you."}, {"text": "@_bryan_0014 they are going crazy, don't let them go crazy without you"}, {"text": "@_SlumpBoy1300 best deal in the biz"}, {"text": "@AyeYo_Sydney Hi there-\nWe're disappointed to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@abasicmom Hi there- Our Birthday Cake Frosty® Cookie Sundae has sprinkles and a cookie. Our Birthday Cake Frosty is a creamy vanilla Frosty mixed with the flavor of a classic birthday cake. Thanks for reaching out."}, {"text": "@ccaspper3 😍😍😍😍😍"}, {"text": "@rryansears not too bad"}, {"text": "@dschocks Thanks!"}, {"text": "@KugoTheMighty you could maybe win them"}, {"text": "@DickActual That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@CoachBriBills Thank you for sharing this with us! We will forward your compliments to the management team, so the staff can be recognized for this."}, {"text": "@druw1983 Oh no!  That is definitely not okay.  Please DM and share  your experience with us as well as which location you visited specifically.  Also, provide your phone number so that management can reach out to make this right."}, {"text": "@BaelloKarizma This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@diana201441 That doesn't sound right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@klcampbell99 This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@BIGBADBRUH72 in 12 -18 months"}, {"text": "@gothren We'll be heading your way soon"}, {"text": "@Recruits4Dogs @Wendy not ignoring anything, we don't have the current means to do that operationally. Doesn't mean it won't happen one day."}, {"text": "@guccikissescc come on by"}, {"text": "@mushroomplanet like for alexa and stuff?"}, {"text": "@macdara_o Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@inkyfinghuhz This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@Squeguin the girl in the picture on our profile"}, {"text": "@NeverGrace_ful We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@IanBeh1102 That's not okay! Please DM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@ggabriellelala We’d love to make this right. DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@KidKinsey @McDonalds It's still here."}, {"text": "@RohansPenNib still have it"}, {"text": "@Lissolas This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@TiffanyDente Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Tomm_Sawyer Hi there, please DM us the email address associated with  your mobile account. We will look into this further for you. Thanks!"}, {"text": "@tiller022 ancient"}, {"text": "@conncatherine What a cute dog you have! If you message us his name and address we will send him some #DogsLoveWendys swag 🐶❤️ 🍟🍔 👍"}, {"text": "@neschalk Oh no! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@MrBigRamOffical ok"}, {"text": "@mirror_egg Coming to the UK in about 12-18 months"}, {"text": "@aglawpaul Wonder if the tweet was sitting in the warming drawer for the three days it took to reply."}, {"text": "@mirror_egg Not sure. Maybe one day."}, {"text": "@jocelyn_gianna Oh no! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@Jordan69188008 no"}, {"text": "@volturiparty noice"}, {"text": "@JKnocka Need the fire to keep everybody warm"}, {"text": "It’s our birthday and we’ll Frosty how we want to. https://t.co/PNva8Flvn8"}, {"text": "@OmggKay lol"}, {"text": "@DylanBostic4 nope"}, {"text": "@Gru_bald not a-peel-ing"}, {"text": "@victor_b1996 Thanks!"}, {"text": "@WhosAjaLuck They are great together"}, {"text": "@TheNerdGoddesss Happy Birthday!"}, {"text": "@Crasne_Hamster very"}, {"text": "@YevetteParker Happy birthday to you as well"}, {"text": "@ScooterFett It is great!"}, {"text": "@DocManchild That would be crazy"}, {"text": "@Predator_USA Thanks!"}, {"text": "@MatthewBetley haha it's perfect"}, {"text": "@Tenumil price will vary by location"}, {"text": "@BlackbirdPyrite CELEBRATE!"}, {"text": "@BeanedSprout This isn't the service we expect. Please DM us with your contact info so we can look into this further."}, {"text": "@Gage64217925 what's a menue?"}, {"text": "It's our birthday week, so we're chillin and playing some games. Come hang. \nhttps://t.co/J4Z5cZlvtz"}, {"text": "@__Luke_Johnson_ 😍😍😍"}, {"text": "@Paradoxoffire sweet"}, {"text": "@andrxwwx 2 for $5 and a Birthday Cake Frosty"}, {"text": "@danielF640 birthday twins 🎉"}, {"text": "@thattetrisguy Wendy"}, {"text": "@duhzsy NOW"}, {"text": "@ThomasAndToons gamer Wendy"}, {"text": "@sewanelewan Oh no! Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@Dominguez_J0se That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Jeffery76456287 Do it"}, {"text": "@jessicajane81 Heck yeah"}, {"text": "@_Shmana_ 🙌🙌🙌🙌"}, {"text": "@bookerislit it is a good game"}, {"text": "@CornHack That's not okay! Please DM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@jtaylorarnold That's not okay! Please DM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@JiyyJiyy Oh no! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@JaySi11 Oh no! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@smileysmorgan That's not okay! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@LoloThee That's not okay! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@mrsmjjxn Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Bocephus50 That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@misstysahrennn_ That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@Emannikcufesin This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@KiproNW That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@miapurdin Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@DnDinBigD @daemacher @BilanciaKitty @LenViggiani @adiagocoda @StuntMonkeyZee Definitely do #3"}, {"text": "@Voxbii @SUBWAY Wendy’s"}, {"text": "@SmokinTunez Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@iamnaomiaugust That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@Justice_West That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@iamnaomiaugust This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@sar_barsy Yes, please. We are not a pillow"}, {"text": "@thecurvynerd Oh no! That’s not the quality we expect from our restaurants. Can you DM us the address of the Wendy's you visited, and your phone number so we can make this right?"}, {"text": "@LakeNeuron We’re sorry to hear that! Can you DM us the address of the Wendy's you visited, and your phone number so we can make this right?"}, {"text": "@Kate9675 We’re sorry to hear that! Would you like a follow-up call from the management team above this restaurant? If so, please DM us your phone number!"}, {"text": "@ishoot305 We're sorry to hear that! Please DM us the restaurant location and your phone # so we can look into this further. Thanks!"}, {"text": "@TreenaMichelleL Hi there, please DM us your contact information and we will have the GM reach out to you. Thanks!"}, {"text": "@RatedRRyan He's the best in the world. Who wouldn't be excited to see him back?"}, {"text": "@T_shep7 This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@ANTIUSOfficial Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@EvilMark665 Or they've looked up the definition of the word Overrated."}, {"text": "@xxSinofPridexx They're just the best thing on earth tbh"}, {"text": "@Dragonsu_ 🙌🙌🙌🙌🙌"}, {"text": "@The_Dave_L This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@hazelstrips Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@MonicaCheyenneD Love this thing"}, {"text": "@jbxmarkmywords That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@IvanFuen_ Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@amelior8 We’re sorry to hear that! Would you like a follow-up call from the management team above this restaurant? If so, please DM us your phone number!"}, {"text": "@Chardos9 This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@MikeyPiccininni We’re sorry to hear that! Would you like a follow-up call from the management team above this restaurant? If so, please DM us your phone number!"}, {"text": "@JanasyaReid We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@_BabyDollBri That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@edguevarad ¡Oh no, eso no está bien! Por favor envíanos un mensaje privado con la ubicación del restaurante y detalles sobre tu experiencia. ¡Gracias!"}, {"text": "@mxrchita ¡Eso no está bien! Por favor envíanos un mensaje privado con la ubicación del restaurante y detalles sobre tu experiencia. ¡Gracias!"}, {"text": "@KatieVisockis This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@Kvrby1 That's not okay! Please DM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@BabyBlizo This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@SplatForceTaku We're sorry to hear that! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@CravingTJourney Oh no! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@ericaadland We're sorry to hear that! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@AMcNeilis That's not okay! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@carrie14_phill Oh no! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@nony545 We're sorry to hear that! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@saturnlifestyle Hi there- We'd love to make this right. DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@Shannon_Gammel Oh no! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@2kidswhere Hi there-\nWe're sorry you left disappointed! Will you DM us the address of your visit with your name and phone number? We’d love to make things up to you."}, {"text": "@geospatialdawg Oh no! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@BoutThatNaOH We're sorry you left disappointed! Can you DM us the address of your visit and your phone number? We’d love to make things up to you."}, {"text": "@timshutes Hey there! Thank you for bringing this to our attention. Will you DM us the address of this location?"}, {"text": "@lump_tOast 🙌🙌🙌🙌🙌"}, {"text": "@healthcareuni12 This isn’t the quality we’d expect. Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@mahamooody Hi there! This is a US promotion. Thanks for reaching out."}, {"text": "@rockwell0419 Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Gage64217925 Sorta, but gotta work"}, {"text": "@EvoLutionEvoTV Yes. I met him at a function."}, {"text": "@Liacarose That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@HopeCollier Thank you for bringing this to our attention. Will you DM us the address of this location? We will forward along your feedback."}, {"text": "@mviron We are so sorry about this. Please DM us your contact information so we can look into this further. Thanks!"}, {"text": "@lanceentrekin26 We're sorry to hear this. Please DM us with the location and your phone number so we can look into this further."}, {"text": "@smakman1019 Chess pieces"}, {"text": "@harDCor_barra It is SO GOOD"}, {"text": "@jasonlampman It’s great"}, {"text": "@jsticegrl Lol"}, {"text": "@CashAppRacks Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@lovely_Leslie1 This isn’t the quality we expect. Please DM us with info on this location, along with your phone number, and we'll make it up to you."}, {"text": "@_xoxolysssa10 THE BEST"}, {"text": "@KansasLily That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@osullivan_devin That's not okay! Please DM us the restaurant location and your phone number so we can look into this. Thanks!"}, {"text": "@Jaku @J0hnnyXm4s @GhostExpress Daaaaaaang"}, {"text": "@zayzay4271 its true"}, {"text": "@flooreedaaa Hi there! Thank you for bringing this to our attention. Will you DM us the address of this location? We will forward along your feedback and make sure this is addressed."}, {"text": "@Bryannn_05 Looking good"}, {"text": "@ArgentRukain It's amazing"}, {"text": "Sir, this is a Wendy's. https://t.co/ixFkKclppX"}, {"text": "@GenePark But it's actually our terrible memer commercial. \nBest meme ever."}, {"text": "@jobyrd01 Deal of the decade"}, {"text": "@Thejakeoltmann A joke used by thousands that spreads like that is the very definition of a meme"}, {"text": "@artsy_ms LIKE A BOSS"}, {"text": "@MannyTrannie @GenePark That's part of the point of it, so yeah"}, {"text": "@counter_econ @GenePark There's the magic"}, {"text": "@ChipTheChocolat gamer moment"}, {"text": "@SwagChawklet the absolute mad lads"}, {"text": "@BasedKashiBar GIANT THUMBS UP EMOJI"}, {"text": "@JumpingCactus01 very"}, {"text": "@QWAVY12 Figured you were already exhausted from the mirror roasting you everyday"}, {"text": "@RicoSuaveJD @lachlan The Discord for people that tell the joke wrong"}, {"text": "@ItsYoxi They're just a regular joke"}, {"text": "@tired_idiot1 unfollow if you don't want to see brand content, genius"}, {"text": "@DidUKno78488421 I do"}, {"text": "@BangtanMinjoon no bamboozle"}, {"text": "@ItsYoxi there it is"}, {"text": "@SmujMaiku wat"}, {"text": "@OGAmberRose Good choice"}, {"text": "@katyparries all these kids watching the office for the first time won't ever let us forget"}, {"text": "@SmujMaiku makes sense"}, {"text": "@LAGNOZ depends on the day if being honest"}, {"text": "@Sharker919 that's the memer of the decade"}, {"text": "@httpAmericasAss please keep the volume to a minimum, the baby is sleeping"}, {"text": "@redbox COMES OUT TOMORROW! WE'LL BE STREAMING IT ALL DAY"}, {"text": "@TwopeatSZN let's go"}, {"text": "@domonique_x3 come through"}, {"text": "@_victoriafields Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@JAYSONORJHANI That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@PBandJCleric Baconator"}, {"text": "@xavierBrandao2 Of course"}, {"text": "@2017Kitkat1 Ok"}, {"text": "@aeherrera_raf ¡Eso no está bien! Por favor envíanos un mensaje con la ubicación del restaurante y detalles sobre tu experiencia. ¡Gracias!"}, {"text": "@lawats_ That's not okay! Please DM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@electdes This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@EpicMarioYT @xavierBrandao2 I was sitting next to the ramp at All Out."}, {"text": "@milian65 Hi there! This isn't the service we expect. Please DM us the location and your phone number so we can make it up to you?"}, {"text": "@garrettolin Hi there! We're sorry you left disappointed! Will you DM us the address of your visit and your phone number? We’d love to make things up to you."}, {"text": "@alance22 That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@alance22 This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@LanceBrowder That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@timmeyers78 We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@DjEverett Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@JonChurchAubin That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@LincourtCory Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "Daaaaaaang. These tees looking FRESH (never frozen)! https://t.co/gYLsUtjKqN"}, {"text": "@JakeRepNY they are a little winkled"}, {"text": "@WhosAjaLuck Come get some"}, {"text": "@MiCasali17 Hope they stay forever"}, {"text": "@lecheszn they're pretty dope"}, {"text": "@imMattoh If you don't want to see something from a brand, unfollow the brand, genius"}, {"text": "@BMouse101 That's a pretty huge leap of assumption to make. \nOf course it is."}, {"text": "@RealScottHaag Thanks Scott!"}, {"text": "@Mizzle13J get me one too"}, {"text": "@enormhi We're saying they didn't freeze a t-shirt if you're trying to be literal."}, {"text": "@Adam_M_Matthews hi"}, {"text": "@coffeegirl1283 sounds reeeeeeeeeal good"}, {"text": "@alfboi_02 what a time to be alive"}, {"text": "@Peeps40836 exactly what we say about beef"}, {"text": "@EmberDraco on their website"}, {"text": "@Strawberriicee Nice!"}, {"text": "@Strawberriicee 😉"}, {"text": "@DuaneCahill This isn't the service we expect. Please DM us with your contact info so we can look into this further."}, {"text": "@ajezus We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@oohh_nana Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@ahgatse We certainly don’t like to hear that. Can you DM us the address of your visit and your phone number? We would love to make this right."}, {"text": "@SMalon12 such a good deal"}, {"text": "@JaelieBean we're talking about t-shirts Jaelynn"}, {"text": "Sup, It's our birthday, so we're gonna eat some Birthday Cake Frosty and spend all day Catching them all. Come hang in the chat.\n\nhttps://t.co/sQfjVH1iaa"}, {"text": "@garyalan82 We’re sorry to hear that! Can you DM us the address of the Wendy's you visited, and your phone number so we can make this right?"}, {"text": "@ManUp26 We’re sorry to hear that! Would you like a follow-up call from the management team above this restaurant? If so, please DM us your phone number!"}, {"text": "@_ashycole Thank you for bringing this to our attention. Can you DM us the address of this location? We will forward along your feedback and make sure this is addressed."}, {"text": "@RobotsPJs We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Ridiculuce That's not okay! Please DM us the restaurant location and your phone # so we can investigate this. Thanks!"}, {"text": "@adajohn44 That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@DawnZal This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@LickMyGunn Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Coolfiz12 That's not okay! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@iFerrara1 That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Samanthakate77 This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@justshanderson That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@sarahesteppppp This isn't the service we expect. Please DM us with the location and your phone number so we can look into this further."}, {"text": "@erin7686 That's not okay! Please DM us the restaurant location and your phone number so we can look into this. Thanks!"}, {"text": "@MDanahay This isn’t the quality we expect. Please DM us with info on this location, along with your phone number, and we'll make it up to you."}, {"text": "@Miran424 We’re sorry that happened. Can you DM us the address of your visit, along with your name and  phone number or e-mail address so we can make it right?"}, {"text": "@Joshmiller1834 We certainly don’t like to see that. Which location did you visit? Can you DM us your phone number or e-mail address so we can address this?"}, {"text": "@that1gameher Oh no! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@Bella74357753 We’re sorry you had a poor experience. Can you DM us the date/time and address of your visit, along with your name and phone number or e-mail address so we can have someone reach out to address this?"}, {"text": "@harlemshaker_07 That’s not the quality we expect from our restaurants. Can you DM us the address of your visit, along with your name and phone number or e-mail address so we can make it up to you?"}, {"text": "@bruh_moment_18 We did exact that lol"}, {"text": "@MMAGenius1 Oh no! That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@mckenna3_2 We’re sorry to hear that! Would you like a follow-up call from the management team above this restaurant? If so, please DM us your phone number!"}, {"text": "Thanks for all the birthday wishes! Haha \nNot sure about you, but we think we make 50 look good. \nBuy cheeseburgers."}, {"text": "@ProblemsGives Perfect"}, {"text": "@sawyeris_life Sure"}, {"text": "@EdgeAriasJuan #ad"}, {"text": "@splatstv Ayyyeeee"}, {"text": "@NeiaChristane Maybe one of these days"}, {"text": "@aabigaiiil Order that delivery"}, {"text": "@eidqn Heck yeah"}, {"text": "@Aubrey52091612 Fax"}, {"text": "@hughart_michael It’s called a Baconator. Ever heard of it"}, {"text": "@neombruh It’s a whole facial routine"}, {"text": "@RealCerealBee Why Banjo &amp; Kazooie and not just Banjo Kazooie"}, {"text": "@DeceasedDisease Usually"}, {"text": "@worldofyeri Buy a baked potato or something"}, {"text": "@alexisloera6 Thanks"}, {"text": "@jpgillin Yes. Buy cheeseburgers again"}, {"text": "@imjustgoodbaby Oh no! That's definitely not okay. Please DM us the restaurant location and your phone number so we can make this right."}, {"text": "@MasonBandurske Oh no! Please DM us with the exact location of your visit, along with your contact info so we can have someone reach out and make this right."}, {"text": "@2639carter Sorry to see this! Can you DM us with the exact location of your visit, along with your contact info so we can have someone reach out to make it up to you?"}, {"text": "@Laurenx3 Oh no! Please DM us the restaurant location and your phone number so we can make this right."}, {"text": "@AstroNaughtFans We’re sorry you had an experience like this! Please DM us with the exact location of your visit, along with your contact info so we can have someone reach out and make this right."}, {"text": "@DeanGraymaker69 That’s not the quality service we expect from our restaurants. Can you DM us the full address of your visit, and your name and phone number or e-mail address so we can have someone reach out to address this?"}, {"text": "@c0lbycarr This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@LexxFuckinHAZEE Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@FAREBEAR32 That's not okay! Please DM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@drewprice32 We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Mohamad43953563 Hi there, please DM us with the address of the location you visited along with your contact information. We will have someone from the upper management team reach out to assist you."}, {"text": "@Downg0esfrazier We're sorry to hear that! Please DM us your phone # so we can make this right. Thanks!"}, {"text": "@BradHuekels We certainly don’t like to hear that! Please DM us the restaurant location and your phone number so we can make this right."}, {"text": "@FilRosay Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Jessica76908911 That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@crabtree_tyler That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@iain_b This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@fuquar7 That's not okay! Please DM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@fr0ggie27 This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@jeffwells13 This isn't the service we expect. Please DM us your contact info so we can look into this further."}, {"text": "@cenzosenerchia That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@JB77922 That doesn't look right! Please DM us phone # so we can make this right. Thanks!"}, {"text": "@elizabeth_lamp This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@OptimizedMom Well that’s just too long. Can you DM us with the address of your visit, along with your e-mail address or phone number so we can address this?"}, {"text": "@twigggggggg So sorry Kayla, can you DM us the address of your visit, along with your phone number or e-mail address so we can have someone reach out to address this?"}, {"text": "@tiffanymdavis94 Well that’s just too long. Can you DM us with the address of your visit, along with your e-mail address or phone number so we can address this?"}, {"text": "@warbraid That is wonderful to hear! Can you DM us with the address of the restaurant you visited? We'd love to share your compliments with their management team."}, {"text": "@pandalovesfrogs Hi there! We'd love to make this right. DM us with info on this location, along with your name and number, and we'll make it up to you. Thanks for reaching out."}, {"text": "@hannahadam8 Hi there! We're sorry you left disappointed! Will you DM us the address of your visit and your phone number? We’d love to make things up to you."}, {"text": "@liittlered29 Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@brennasullivan_ This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@XOLitPixie That's not okay! Please DM us the restaurant location and your phone # so we can investigate this. Thanks!"}, {"text": "@PaulUlez3789 That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@GerenEmily Oh no! That's definitely not okay. Please DM us the restaurant location in Medina you visited and your phone number so we can make this right."}, {"text": "@hippieabs Oh no! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@JerseychickDar We're sorry to hear that! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@Abuddyman We're sorry to hear that! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@luvmyfrofro01 Oh no! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@BMiller_12 Oh no! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@Janie1Charles Oh no! That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@Kassheartt That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@ShinyLox Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@RealJoshMorrow This isn’t the quality we expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@Ben_Schmid That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@DarinDetwiler Thank you for bringing this to our attention. Can you DM us the address of this location? We will forward along your feedback and make sure this is addressed."}, {"text": "@chlorineboyer We’re sorry you had an experience like this. Can you provide us with the address of your visit, along with your contact info so we can make it up to you?"}, {"text": "@CFrazier2212 We take things like this very seriously. Can you DM us the address of your visit and your phone number? We’d love to make this up to you."}, {"text": "@Timothu11 This isn't the service we expect. Please DM us with your contact info so we can look into this further."}, {"text": "@amalzingsong Oh no! Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@mdwslw That's not good. Please DM us your phone number so we can make this right!"}, {"text": "@Hiaker We’d love to make this right. DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@coote_steve This isn't the quality we'd expect. Please DM us with your contact info so we can look into this further."}, {"text": "@DerekSchuett We’d love to make this right. DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@Sazzy827 Oh no! Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@weitz9 Order accuracy issues are maddening! Can you DM us the address of your visit and your phone number? We’d love to make things up to you."}, {"text": "@ztbricks Thanks! Looks awesome"}, {"text": "@SharmCharm__ Hi there! We're sorry you left disappointed! Will you DM us the address of your visit along with your contact information? We’d love to make things up to you."}, {"text": "@Fortnit90143855 Hi there-\nWe’re sorry you had an experience like this. Can DM us with the address of your visit, along with your contact info so we can make it up to you?"}, {"text": "@Rizeoftheginger there's really no such thing as too much tbh"}, {"text": "@Archon90141273 thanks"}, {"text": "@LynetteEPI We're sorry to hear that! Please DM us phone # so we can make this right. Thanks!"}, {"text": "@AveryPalmer4 Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@CoreyMaddocks This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@15jennings_j This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@jarredf32 We're sorry to hear that! Please DM us your phone # so we can make this right. Thanks!"}, {"text": "@yung_evalyn That's not okay! Please DM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@DylanSedam Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@ThatProdigy Here for you"}, {"text": "@sunshine4170 That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@LoveDejaVuu Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@timescar226 This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@Rstorrs This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@BMBenzo That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Justin89647311 Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@iamnotpussykins We’re sorry to hear that! Would you like a follow-up call from the management team above this restaurant? If so, please DM us your phone number!"}, {"text": "@dreambig_baby23 That's not okay. Please DM us with the address of this location, along with your phone number, and we'll make it up to you."}, {"text": "@espn @trulyseltzer How many passing yards?"}, {"text": "@katiecakes121 the best"}, {"text": "@AJMILBRANDT If you set the record, then you know the answer"}, {"text": "@BaccaDeww the same reason anyone with red hair has red hair"}, {"text": "@Nicholeburrito let's party"}, {"text": "@GFshjam we have good food"}, {"text": "@iAmDotJ_ don't forget again"}, {"text": "@iHevii We're disappointed to hear this! Please DM us your phone number so we can make this right."}, {"text": "@leitrim_peters Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@BonesTweetsYo Such a good deal"}, {"text": "@bill89207304 Ok"}, {"text": "@bill89207304 Ok"}, {"text": "@Petfalcon1 Yooooo. This is amazing"}, {"text": "@Petfalcon1 Amazing"}, {"text": "@KaniDayOfficial 👀👀👀👀👀👀"}, {"text": "@Nevaeh32659268 This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@randallsans We’re sorry to hear that! Would you like a follow-up call from the management team above this restaurant? If so, please DM us your phone number!"}, {"text": "@Skittles @SeokJinIsCutee @a6doff Modern problems require modern solutions."}, {"text": "@CRCalhoun0 That's not okay! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@CheyenneRenee22 Oh no! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@KristensenEva That's not okay! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@Doc_Edge77 We're sorry to hear that! Please DM us your phone # so we can make this right. Thanks!"}, {"text": "@godofwar1006 Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@scarabeara We're sorry you left disappointed! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@angelapwjd This isn't the service we expect. Please DM us your phone # so we can make this right. Thanks!"}, {"text": "@kristengall2 We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Shakey_Rsquad That's not okay! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@kayytee___ Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@TheBobalou We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@jaykrice That's not okay! Please DM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@JonSheaAllDay Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@YMajestyxx We’d love to make this right. DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@bxby_jaeee Thank you for bringing this to our attention. Can you DM us the address of this location? We will forward along your feedback and make sure this is addressed."}, {"text": "@joemc115 meme would be better if you took \"The Machines Broke\" off and let people get the joke from the hat. Maybe try a non-impact font as well."}, {"text": "@skylarhannan That's not okay! Please DM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@dsears266 We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@coxbrother We're sorry you left disappointed! Can you DM us the address of your visit and your phone number? We’d love to make things up to you."}, {"text": "@serrato_jorge This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@impressah This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@OhKaylaJo Hi there, please DM us your contact information and we will look into this further for you."}, {"text": "@iluvmacnchez Yo, these are awesome"}, {"text": "@Bapst_23B This isn't the service we expect. Please DM us with the location and your phone number so we can look into this further and make this right."}, {"text": "@shannonkarnygm1 We're disappointed to hear this. Please DM us with the location and your phone number so we can look into this further."}, {"text": "@leadinsideout Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@_breeezayy That's not okay! Please DM us the restaurant location and your phone number so we can look into this. Thanks!"}, {"text": "@mommaSallyAnn That's not okay! Please DM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@kmichaelprince That's a smart kid, which we credit to good parenting. Please DM us his name and mailing address so we can send some Wendy's swag his way!  #KidsLoveWendys 😀"}, {"text": "@LbbhBigCrybaby You aren’t simply a clown. You are the entire circus."}, {"text": "@NoCapMatt Hi there! Hi there-\nWe'd be happy to connect you with the Human Resources point of contact for the restaurant you worked. DM us the address of the restaurant, your full name and phone number so HR can reach out."}, {"text": "@CyrusCarlos1 That's not okay! Please DM us the restaurant location and your phone number so we can make this right. Thanks!"}, {"text": "@jaygremillion Hey there! Please DM us the exact restaurant location so we can look into this. Thanks!"}, {"text": "@thecbdvirgo Oh no! Can you DM us the address of the Wendy's you visited and your phone number? We'd love to make this right."}, {"text": "@MorganHoolian That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@Olivemyloveash That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@NOTJUSTTHEMRS Oh no! Can you DM us the address of the Wendy's you visited and your phone number? We'd love to make this right."}, {"text": "@devinmorris99 cool"}, {"text": "@morgiehampton A wise investment"}, {"text": "@hemenway_9 What a cute dog you have. If you DM us his name and address we will send him some #DogsLoveWendys swag 🐶❤️ 🍟🍔 👍"}, {"text": "@JAZurMagination Hey Jasmine, We’re sorry that happened. Can you DM us the address of your most recent visit, along with your name and phone number or e-mail address so we can make it right?"}, {"text": "@abrebel We’re sorry to hear about this! Can you please DM us your phone number so that we can have someone from the management team contact you to make this right?"}, {"text": "@geauspork Oh no! Please DM us your phone # so we can make this right. Thanks!"}, {"text": "@playboibezos We're sorry to hear about this! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@HoeImSuckerFree That doesn't sound right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@TerpZone Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@RhondaAllaby This isn’t the quality we’d expect. Can you DM us the address of your visit and your phone number? We’d love to make things up to you."}, {"text": "@ZumbaKy We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@meghanlangley_ We're sorry you left disappointed! Can you DM us the address of your visit and your phone number? We’d love to make things up to you."}, {"text": "@briguyIL That doesn't look right! Please DM us with the location and your contact info so we can look into this further."}, {"text": "@thomas_flii We’re sorry you had an experience like this. Can you provide us with the address of your visit, along with your contact info so we can make it up to you?"}, {"text": "@TheBraotis Hey Brian, We certainly don’t like to see that. Which location did you visit? Can you DM us your phone number or e-mail address so we can address this?"}, {"text": "@kristenmdrums We’re sorry you had an experience like this. Can you DM us with the address of your visit, along with your name and  phone number or e-mail address so we can have someone reach out to address this?"}, {"text": "@titan96h Hey Titus, That’s not the quality we expect from our restaurants. Can you DM us the address of your visit, along with your phone number or e-mail address so we can make it up to you?"}, {"text": "@B_dsgn Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Margo72797239 That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@RySebastian This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@Whos_Tony We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@i_GetMoney23 Oh no!  That is definitely not okay.  Please DM us and share more about your experience with us as well as which location you visited specifically.  Also, provide your phone number so that management can reach out to make this right."}, {"text": "@niqvenus We're disappointed to hear this! Please DM us with the exact location in Bellingham you visited, along with your contact info so we can have someone reach out and make this right."}, {"text": "@yerrrrrbecks Sorry to hear this! Please DM us the restaurant location and your phone number so we can make this right."}, {"text": "@Ppllikemegetsl1 We certainly don’t like to see that! Please DM us with info on this location so we can bring it to the attention of the restaurant operators."}, {"text": "@eddiemonsoon Oh no! Can you DM us your contact info so we can have someone reach out to make it up to you?"}, {"text": "@ynugblud Get your flexin muscles ready and dunk on that fool."}, {"text": "@ynugblud Well don’t bully"}, {"text": "@KickGameRunGame Boy do we have some news for you next year."}, {"text": "@SamHunt37194446 yes. very cute doggo"}, {"text": "@dancrgrl817 We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@JefferyBogatay you should give me free Wendy's for two years"}, {"text": "@TomDankEngine25 an Uber to Wendy's"}, {"text": "@TheOnikaStan Best deal"}, {"text": "@TracyKirk4 😏"}, {"text": "@AshyaRoberts better at picking places to eat"}, {"text": "@jlojno always"}, {"text": "@mckinse93716504 out"}, {"text": "@OmarNegrinLIVE Wendy Morty is best Morty"}, {"text": "@JMsumba Hello! The cookie pieces and sprinkles come with the Birthday Cake Frosty Cookie Sundae. Thanks for reaching out!"}, {"text": "@LenaStarz 😍"}, {"text": "@karineebean That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@hippiechick7400 We certainly don’t like to see that. Can you DM us your name and phone number or e-mail address so we can address this?"}, {"text": "@FluffalRaichu Sounds like a great day"}, {"text": "@HenryGaleas3 Can't see it with you standing in front of it."}, {"text": "@cmastaflexx Oh no! Can you DM us the address of the Wendy's you visited and your phone number? We'd love to make this right."}, {"text": "@Pluckers hi"}, {"text": "@Pluckers its ok. just hanging. you?"}, {"text": "@Abby34017112 maybe one day, you never know"}, {"text": "@_LalaBabi_ Hi we would be happy to connect you with the Human Resources point of contact for the restaurant you work for. Can you DM us with the address of the restaurant and your phone number so I can have them contact you?"}, {"text": "@tmoore677 Hi Tom, We certainly don’t like to see that. Which location did you visit? Can you DM us your phone number or e-mail address so we can make it right?"}, {"text": "@niqqitee Hey there! Can you DM us the address of your visit? We'd love to pass on your compliment to the restaurant!"}, {"text": "@coachdurst This isn’t the quality we expect. Please DM us with info on this location, along with your phone number, and we'll make it right with you."}, {"text": "@storyofmy_life7 Hey there! Can you DM us details of your visit, the address of your visit, and your phone number so we can make it up to you?? Thanks so much!"}, {"text": "@troy_perry We’re sorry that happened Troy. Can you DM us the address of your visit, along with your name and  phone number or e-mail address so we can make it right?"}, {"text": "@Haoleboy89 Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@EverestJimmy Hi there! We certainly don’t like to see that. Can you DM us the address of your visit and your phone number? We would love to make this right."}, {"text": "@Dough836 Hi there! We're sorry you left disappointed! Will you DM us the address of your visit and your phone number? We’d love to make things up to you."}, {"text": "@__kbolaydiggs__ Hi there! DM us the restaurant location, we'd like to gather some additional details about your visit. Also, please provide us with your name and phone number so that we can follow up to make things right."}, {"text": "@iSpeakTyi This isn't the service we expect. Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@daniel_bussey That's not okay! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@ImaCMUmom56 We’d love to make this right. DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@baybaxendale This isn’t the service we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@johnsmi36295465 sounds pretty great"}, {"text": "@GeorgiaGuyTay Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@the_weedwhacker We're sorry you left disappointed! Can you DM us the address of your visit and your phone number? We’d love to make things up to you."}, {"text": "@LynnAshanta Hi there! We're disappointed to hear that! Please DM us the restaurant location along with your name and phone # so we can make this right. Thanks!"}, {"text": "@AllisonD_O_C_E 🙌🙌🙌🙌🙌"}, {"text": "@jasmin_maher IT IS SOOOOOO GOOD"}, {"text": "@OGSCORPIOQUEEN Don’t wait so long to come back!"}, {"text": "nice https://t.co/mcwvGzvbWl"}, {"text": "@dstluke Get yourself a 2 for $5 and a 4 for $4. That's 6 for $9!"}, {"text": "@Timmydale79 nice"}, {"text": "@MasterHand4444 because 2+4=6 and 5+4=9"}, {"text": "@JCharlesBennett no, that's his recipe. He is very proud of it"}, {"text": "@woahlyssa sup 😉"}, {"text": "@lazilymax Only cool people. Probably why you hadn't heard."}, {"text": "@Graeig 😉"}, {"text": "@AlecHarrison247 lol"}, {"text": "@Cespinozn 🍔🍔🍔🍔"}, {"text": "@noahsatty Weird you used the plural. We were under the impression you were living off just the one."}, {"text": "@memegodmel we are a restaurant"}, {"text": "@TrainerLuke1621 @lazilymax Let's get an F in the chat"}, {"text": "@Eighty8fn just here to party"}, {"text": "@Ghost_Enzo Hi there! We're sorry you left disappointed! Will you DM us the address of your visit and your phone number? We’d love to make things up to you."}, {"text": "@Chloe_May_21 it isn't"}, {"text": "@Cameron30014658 i'll alert the media"}, {"text": "@jimmy_1173 also true"}, {"text": "@GuyTheGuardian THANKS!"}, {"text": "@LaddJarrett @Ghost_Enzo Yeah, you gonna snitch?"}, {"text": "@Gmanstoops1 My ego likes you"}, {"text": "@MusicLuvAlways1 Congrats Momma!"}, {"text": "@awqss1 That's not okay. Please DM us with the address of this location, along with your phone number, and we'll make it up to you."}, {"text": "@PopTartsUS samezies"}, {"text": "@fragmntdSoul Any time"}, {"text": "@KensterKenster 2 for 5 pls"}, {"text": "@badge564 DM us, we would like to gather some additional details about your visit."}, {"text": "@nicolette_keith Sorry to hear this! Please DM us the restaurant location and your phone number so we can make this right."}, {"text": "@littlebuddababy Oh no! Can you DM us with the exact location of your visit, along with your contact info so we can have someone reach out to make it up to you?"}, {"text": "@bronxbomber1185 No"}, {"text": "@710_dab_queen We're disappointed to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@TarHeels610 We're disappointed to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Alex38000330 Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@AmyyyLyn That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@jennn21 This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@fameiscourtney That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@sergin95 That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@emcox3 Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@bladeoffire1 Hi there! We got you. Have you downloaded our app? if so, DM us your email address so we can push you an offer to use on your next visit with us."}, {"text": "@Momfessions1 Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Carrie_Lynn2 That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@ManicHispanic86 This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@ANGeiger This isn't the service we expect. Please DM us with your contact info so we can look into this further."}, {"text": "@ZachZugelder We're sorry you left disappointed! Can you DM us your phone number? We’d love to make things up to you."}, {"text": "@nickbaker0721 That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@tumbleweedB Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@prittyboyswagg8 We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@ItsTheQueenB_ We certainly don’t like to hear that. Can you DM us the address of your visit and your phone number? We would love to make this right."}, {"text": "@Ijalene_ We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@MS_DJDB We’re sorry to hear about this! Can you please DM us your phone number so that we can have someone from the management team contact you to make this right?"}, {"text": "@trev_ik Should get us across the river to Nibelheim"}, {"text": "@Tempar8 Haven't played it"}, {"text": "@trev_ik hahahahahahahaha"}, {"text": "@BSA19741 These 32-bit graphics are tight"}, {"text": "@RxBrad You bout to give one back orrrrrr"}, {"text": "@isabelsentle Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@davion_thomas You did the right thing"}, {"text": "@alex_van_meter Do it"}, {"text": "@Bloodline_NZL @WWEonFOX @WrestleMania Nah, we tag against the entire internet"}, {"text": "@WWEonFOX @WrestleMania Cena v Tanahashi"}, {"text": "@VincentG917 We're disappointed to hear that! Please DM us the exact restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@lynnb331 This isn't the service we expect. Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Mayadam710 This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@Mr_Whirl85 That's not okay! Please DM us the restaurant location and your phone # so we can investigate this. Thanks!"}, {"text": "@graciedehaven Putting up pro numbers"}, {"text": "@pincheguapo918 We’re sorry to hear that! Would you like a follow-up call from the management team above this restaurant? If so, please DM us your phone number!"}, {"text": "@742Kapital_T Hi There! The 4 for $4 will now include a JCB, Double Stack, Crispy Chicken Sandwich and a Junior Cheeseburger. We hope this helps. PLease enjoy!"}, {"text": "@mlbride1974 Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@collin_graff17 That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@MONEYDONTSLEEP1 That's not okay! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@Marve1ousmarv Hi Marv, That’s not the quality we expect from our restaurants. Can you DM us the address of your visit, along with your name and phone number or e-mail address so we can make it up to you?"}, {"text": "@to_mara_land Oh no! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@lilduckiewaddle Ok, tell that to everything that isn't birthday cake, but tastes like birthday cake."}, {"text": "@With_LOVE_Dess That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@ReemDeemMeme Hey there! Thanks for reaching out! The sprinkles and sugar cookie pieces are part of the Birthday Cake Frosty Cookie Sundae. Have a great day!"}, {"text": "@davinamarie83 We’re sorry to hear that! Can you DM us the address of the Wendy's you visited, and your phone number so we can make this right?"}, {"text": "@yung_drxp We're disappointed to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@y61903989 This isn’t the quality we expect. Please DM us with info on this location, along with your phone number, and we'll make it right with you."}, {"text": "@MrScott10 That doesn't look right! Please DM us the exact restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@4rgrls That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@NylaRoseBeast Aye, lemme get uuhhhhhhhhhhhhhhh\n4 for $4"}, {"text": "@MrsAshleyyyR We're disappointed to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Mannyk_27 This isn’t the quality we expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@VictoriaArmone Oh no! That's definitely not okay. Please DM us the restaurant location and your phone number so we can make this right."}, {"text": "@PNitzki We certainly don’t like to see that! Please DM us with the exact location of her visit, along with her contact info so we can have someone reach out and make this right."}, {"text": "@DeniseCarter4 Sorry to see this! Can you DM us with the exact location of your visit, along with your contact info so we can have someone reach out to make it up to you?"}, {"text": "@KarisDyer Oh no! Please DM us your phone number so we can make this right."}, {"text": "@lilchipotIe That's not okay! Please DM us with the exact location of your visit, along with your number, and we'll make it up to you."}, {"text": "@4million4peace @CFBONFOX @RobStoneONFOX @MattLeinartQB 👀👀👀"}, {"text": "@yaboymsmit That's not okay. Please DM us with the address of this location, along with your phone number, and we'll make it up to you."}, {"text": "@CFBONFOX What duo would have a higher average draft position? Reggie/Matt or Fields/Dobbins #BIGNOON"}, {"text": "@ray_raykeith We’d love to make this right. DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@Ryan58800839 Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@beckivarner That's not okay! Please DM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@P_DavisTweets We're sorry to hear that! Please DM us your phone # so we can make this right. Thanks!"}, {"text": "@rivxrhxlland This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@YoungbloodJk That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Blake_Latimer1 This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@CFBONFOX What is better: Reggie’s 4.33 40-yard dash time or Wendy’s 444? #BIGNOON"}, {"text": "@_BrittBuckley_ Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@LRicciBoyle This isn't the service we expect. Please DM us with your contact info so we can look into this further."}, {"text": "@CFBONFOX @BeanieWells26 @LaVarArrington @BeanieWells26 knows what's up with the Spicy Barbeque Chicken sandwich 🙌"}, {"text": "@timmcdonald27 That's not okay! Please DM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@ClaytaviousKoon That’s not okay. Please DM us the full address of your visit, along with your name and e-mail address or phone number so we can make it up to you!"}, {"text": "@mybestworstself Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@MFloress23 We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@darinez_lf This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@AustinDouglas17 That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@iIvetteCirino Glad to hear this! We'll send some kudos their way."}, {"text": "@bladeoffire1 Hi there! There is a $5 small Dave's double combo on our mobile app. You can download our app for offers."}, {"text": "@BrolicG We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "To be fair, you have to have a very high IQ to understand Rick and Morty. So make sure you watch it this Sunday night, genius. https://t.co/09fnZoRaF5"}, {"text": "@rohanisneat Epic gamer moment"}, {"text": "@TavionEsmond Basically yeah. Buy a cheeseburger"}, {"text": "@iceberg325 @BurgerKing Negative numbers"}, {"text": "@proffitt_dillon The only move"}, {"text": "@trev2x_ This isn't the service we expect. Please DM us your contact info so we can look into this further."}, {"text": "@ScaryF9 That's not okay! Please DM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@AlulisMs That doesn't look right! Please DM us the restaurant location and your phone # so we can look into this further. Thanks!"}, {"text": "@Kharece__ Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@airusiam This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@nnece__ That's not okay at all! Please DM us the restaurant location and your phone number so we can make this right. Thanks!"}, {"text": "@Wreckingcrue86 Hi there! We're sorry you left disappointed! Will you DM us the address of your visit along with your phone number? We’d love to make things up to you."}, {"text": "@Lnmopea Hi there! We're disappointed to hear that! Please DM us the restaurant location and your contact information so we can make this right. Thanks!"}, {"text": "@kristinsmetanko Hi there! We're disappointed to hear this. DM us, we'd like to gather some additional details about your visit. Also, please provide us with your phone number so that we can follow up to make things right."}, {"text": "@Alexmattt Hi there! That’s too long to wait! Can you DM us the address of your visit and your phone number? We’d love to make things up to you."}, {"text": "@BennUriostegui Hi there! We're disappointed to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@ShannYouCute Hi there! We're disappointed to hear that! Please DM us the restaurant location and your name and phone # so we can make this right. Thanks!"}, {"text": "@AlexSchulteOnZ Hi there! That's not okay! Please DM us the restaurant location and your phone number so we can look into this. Thanks!"}, {"text": "@denniskdraws Hi there! Our vanilla Frosty will return in January. Thanks."}, {"text": "@hmua_chloe Hi there! We'd love to make this right. DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@EPensky Hi there! That's not okay! Please DM us the restaurant location and your phone number so we can look into this. Thanks!"}, {"text": "@realfilmsnobs HI there! We're disappointed to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@cjwebber76 We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@jamaicanhot We certainly don’t like to hear that! Please DM us the restaurant location and your phone number so we can make this right."}, {"text": "@kimanisho Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@BeamQman We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@BlancoJennyy Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@brandyjenay We're sorry to hear that! Please DM us your phone # so we can make this right. Thanks!"}, {"text": "@jeannajoplin That's not okay! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@LauMarieRod This isn’t the quality we’d expect. Please DM us your phone # so we can make this right. Thanks!"}, {"text": "@Aximili55 We’re sorry to hear that! Can you DM us the address of the Wendy's you visited, and your phone number so we can make this right?"}, {"text": "@kwanzaagecko Hey there! Can you DM us details of your visit, the address of your visit, and your phone number so we can make it up to you?? Thanks so much!"}, {"text": "@youzabish We’re sorry to hear that! Would you like a follow-up call from the management team above this restaurant? If so, please DM us your phone number!"}, {"text": "@tonytonetweets Oh no! That's not okay! Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@Seda_912 That's not okay! Can you DM us the address of the Wendy's you visited and your phone number? We'd love to make this right."}, {"text": "@Snow_Plow427 We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@marydrake111 That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@OhSnapSarah_xo That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@MrsB3Esq That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@singleoakbarrel Oh no! Can you DM us the address of the Wendy's you visited and your phone number? We'd love to make this right."}, {"text": "@jocelyndavis001 We're disappointed to hear this. DM us, we'd like to gather some additional details about your visit. Also, please provide us with your phone number so that we can follow up to make things right."}, {"text": "@ShibaAboutTown We’re sorry to hear about this! Can you please DM us your phone number so that we can have someone from the management team contact you to make this right?"}, {"text": "@viveklulla That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@GiGigadget9 That's not okay! Please DM us the restaurant location and your phone # so we can investigate this. Thanks!"}, {"text": "@A_A_RON_892 This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@TiaOutsold Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@mcdaniel_the That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@RogerLuong1 That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@grimmstagrammm That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@Ironvan26 Hi there, the 2020 Frosty tags will be available for purchase on November 25th. They will be available in store or at https://t.co/rzgctAXoOQ. Thank you for reaching out and have a great day!"}, {"text": "@fromthatstate not sure tbh"}, {"text": "@mattrlewis2 Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@BreeTheGreat_ That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@ImChocolateSwag This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@GuyReno This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@DaNameisHawk We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@bArbee_gUryl That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@strangetingss a failure in messaging. But now you know, and that's what matters"}, {"text": "@AmandaDelbeke Can you send us a DM when you have a chance?"}, {"text": "@RebelKanan That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@TheJGMASON Oh no! We're sorry that this happened! Please DM us your contact info so we can have someone reach out and make this right."}, {"text": "@itsamazonalexa That's not okay! Please DM us with the exact location of your visit, along with your contact info so we can have someone reach out and make this right."}, {"text": "@natdaddy We're sorry to hear that! Please DM us your phone # so we can make this right. Thanks!"}, {"text": "@itsWeSing That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@Imer34_ That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@_ariadneb That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@stumptownlunch Gotta get the key tag!"}, {"text": "@coldpepsi270 Nice"}, {"text": "@Geohistoria basically. cheese is our gravy and bacon is our cheese"}, {"text": "@BenShelley6 Quality"}, {"text": "@khail_xo So good"}, {"text": "@TwinklyPower Thanks for coming by!"}, {"text": "@HeartyKari This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@bladeoffire1 Hi there! This is local promotion for a franchise. Please reach out to them. Thanks."}, {"text": "@Grubersauce This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@ohmyemma_ That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@KaniDayOfficial 👀👀👀👀👀👀"}, {"text": "@RealArmedes We are sorry to hear about this. Please DM us with the address of this location and we will send out a report to the upper management team."}, {"text": "@ShaherraR This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@strnman We certainly don’t like to hear that! Please DM us the restaurant location and your phone number so we can make this right."}, {"text": "@SkyaCay Savage. Love it."}, {"text": "@iRyanGlen and you should"}, {"text": "@Rilessss23 perfect"}, {"text": "@gapgirl982 This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@fabglance We’re sorry to hear that! Can you DM us the address of your visit and your phone number? We’d love to make things up to you."}, {"text": "@Fritz_son_Shyne That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@Oldboy_Nikku That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@JustinsBurnr That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@OfficialMacKyJ Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@ItsCoCoDuh_bish We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Wickel4 Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Slushi__ Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@kristmarch That's not okay! Please DM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@FullTimeMulti Do it. Dye it red."}, {"text": "@TryingDave The week is still the same length as every week tho"}, {"text": "@NorthsideBeauty Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@figueroa1048 This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@CLNCLTR32 Come through"}, {"text": "@MidwestRonin so good"}, {"text": "@ya_boi_dan_ Hi there! That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@godhonestliar fell in love with a freezer and got stuck in a bad relationship"}, {"text": "@Kosi_TheGoddess That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@MNkatycat We’re sorry to hear that! Can you DM us the address of the Wendy's you visited, and your phone number so we can make this right?"}, {"text": "@CKDoesDisney Hi there! That doesn't look right! Please DM us the restaurant location and your name and phone # so we can make this right. Thanks!"}, {"text": "@neilnw86 Hi there! This isn’t the quality we expect. Please DM us with info on this location, along with your contact information, and we'll make it up to you."}, {"text": "@robgarbo Hey there! Can you DM us details of your visit, the address of your visit, and your phone number so we can make it up to you?? Thanks so much!"}, {"text": "@_TheLeader We’re sorry you had an experience like this. Can you DM us the address of the Wendy’s you visited, and your phone number so we can make it up to you?"}, {"text": "@Antonio75514587 @McDonalds Big oof"}, {"text": "@_ShortNSimple We're disappointed to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@tymmcote Hi there! That's not okay! Please DM us the restaurant location and your phone number so we can look into this. Thanks!"}, {"text": "@Bethanyylynnn_ Hi there! That's not okay! Please DM us the restaurant location and your phone number so we can look into this. Thanks!"}, {"text": "@AmberJHacker That's awesome! Can you provide us with the address of the restaurant you visited? We'd love to share your compliments with their management team."}, {"text": "@MamaCashew We'd love to make this right. DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@jordon_quintell No"}, {"text": "@Skeeb410 We’re sorry you had an experience like this. Can you provide us with the address of your visit, along with your contact info so we can make it up to you?"}, {"text": "@Gavin66217413 It must be protected at all costs."}, {"text": "@Shandri09143294 🙌🙌🙌🙌🙌"}, {"text": "You show up to Wendy’s for the 2 for $5. What ya gonna get? Don’t see your favorite? Comment with your go-to combo below!"}, {"text": "@gamermaniac55 Gotta get the nuggets"}, {"text": "@putmeinthemcu Spicy life"}, {"text": "@rohanisneat Makes sense"}, {"text": "@pixelyunicorn Oh dang"}, {"text": "@RealRosalinaL Zero likes around here"}, {"text": "@DLangerrr That’s fair"}, {"text": "@Andrewgspeedrun Also great"}, {"text": "@TheDevilMiner Niiiiice"}, {"text": "@landonsairpods We live that life"}, {"text": "@MicahBush22 Of course of course"}, {"text": "@FFONugget Fair enough"}, {"text": "@metsfan49 Oh yeah?"}, {"text": "@_jer18_ It’s just different stuff"}, {"text": "@RageaholicRick Very understandable"}, {"text": "@TitoTrill Whoa 😮"}, {"text": "@MPromethus Solid contender"}, {"text": "@yashiewashie dope"}, {"text": "@Svenmoravec That double Spicy hits different"}, {"text": "@metsfan49 Nice!"}, {"text": "@kyutele You beat the system. This is the Kobayshi Maru of food orders."}, {"text": "@HwhDud We’ll be there soon"}, {"text": "@ThomasAndToons Good thinking"}, {"text": "@MaddZomB You can get that too, they just only give you so many poll options"}, {"text": "@Homebwoi We're sorry to hear that! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@__Locc We’re sorry to hear that! Can you DM us the address of your visit and your phone number? We’d love to make things up to you."}, {"text": "@L_Robee23 That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@BryanJennings10 That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@mhoney14 We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Malllayna That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@WhitneyLaNae_ Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@cl0udcake We’re sorry that happened. We know 1 nug can really make the difference. Can you DM us the address of your visit, along with your name and phone number or e-mail address so we can make it right?"}, {"text": "@Leomie_Anderson Oh no! We certainly don’t like to hear that. Please DM us with the exact location of your visit, along with your contact info so we can have someone reach out and make this right."}, {"text": "@TeamSuper_SoCal We're disappointed to hear this! Please DM us your phone number so we can make this right."}, {"text": "@EWNielsen That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@neilmosher Oh no! That’s not the quality we expect from our restaurants. Can you DM us the address of the Wendy's you visited, and your phone number so we can make this right?"}, {"text": "@Derek_is_Eric That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@jrj2tech That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@johnlundell Hi there! This isn't the service we expect. Please  your phone number so we can make this right."}, {"text": "@RiperRoo094 Been using that one on the wishing well for years."}, {"text": "@YoungPuppy1987 Thank you friend!"}, {"text": "@HamzahTheGoat Too lazy to write my own Tinder bio, too happy to care."}, {"text": "@antoniablanda Sounds like a wonderful mistake to make"}, {"text": "@TravisButDumber it's the flavor"}, {"text": "@sodamnfab_ That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@pale_jewess was wondering where that went"}, {"text": "@ccantlin1011 That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@alexathanasiou_ We’re sorry to hear that! Would you like a follow-up call from the management team above this restaurant? If so, please DM us your phone number!"}, {"text": "@meganloeffler We’re sorry you had an experience like this. Can you DM us the address of the Wendy’s you visited, and your phone number so we can make it up to you?"}, {"text": "@arc_angelx That's not okay! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Zqueennance We're disappointed to hear that! Please DM us the exact restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Tofnik That's not okay! Please DM us the restaurant location and your phone number so we can make this right. Thanks!"}, {"text": "@ThiccGuy4 We're disappointed to hear that! Please DM us the restaurant location so we can make this right. Thanks!"}, {"text": "@a_nick51 That's not okay! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@itsMrFoxinSocks That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@AZap24 This isn't the service we expect. Please DM us with the exact location and your phone number so we can make this right. Thanks!"}, {"text": "@kriskaylin We're disappointed to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@ZELDEN_16 That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@janenovacane This isn't the service we expect. Please DM us with the location and your phone number so we can make this right."}, {"text": "@christopherhaag That's not okay! Please DM us the restaurant location and your phone # so we can investigate this. Thanks!"}, {"text": "@RionTHFC That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@CareyMinard That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@cuteypatotey Hi there! We take things like this very seriously. Will you DM us the address of your visit and your phone number so we can look into this. Thanks!"}, {"text": "@nighthawk1024 Hi there! We'd love to make this right. DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@wenksndranks Hi there! We take things like this very seriously. Will you DM us the address of your visit and your contact information so we can look into this?"}, {"text": "@headbusta420 Hi there! That's not okay! Please DM us the restaurant location and your phone number so we can look into this. Thanks!"}, {"text": "@NateFillers Hi there! Hi there-\nWe're disappointed to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@ShawnJo57111022 Hi there! That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@pzeuschner Hi there! Hours will vary by location, please reach out to your local Wendy’s to find out their holiday hours."}, {"text": "@meredith_guziak Hi there! That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@JohnRSaratoga We're sorry to hear that! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@SGoldzilla That's not okay! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@mac_ffball That's not okay! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@amandahhh_13 We're sorry to hear that! Please DM us the restaurant location and your phone # or email so we can make this right. Thanks!"}, {"text": "@xsarraah_ Oh no! Can you DM us the full address of the location you visited, along with your contact info?"}, {"text": "@K_Law124 We're glad you stopped by, but that's too long to wait. If you'd like to DM us your info, we'll make it right!"}, {"text": "@LBounchaleunso We got you! If you have our app, DM us your email address so we can send an offer your way for your next visit 😎"}, {"text": "@LitAssCarlos Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Johnnycali420 We'll be waiting! Have you downloaded our app? if you have, DM us your email address so we can push you an offer to use on your next visit with us 😎"}, {"text": "@VickRos85 This isn't the service we expect. Please DM us with your contact info so we can look into this further."}, {"text": "@EricM00169282 We’re sorry to hear that! Would you like a follow-up call from the management team above this restaurant? If so, please DM us your phone number!"}, {"text": "@RyanLottinger That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@buzzydoe That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@Lexnwndrlnd Thanks for reaching out! We’ll pass this on to the management team that oversees this location!"}, {"text": "@Kristen71295 Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@f1prancinghorse That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@groundhogday_86 That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@halde63 This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@Leich91 Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Atl_finest16 This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@bmariaphon That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@geminitsm We’re sorry to hear that! Would you like a follow-up call from the management team above this restaurant? If so, please DM us your phone number!"}, {"text": "@TheSpiceNyoLife We’re sorry to hear that! Would you like a follow-up call from the management team above this restaurant? If so, please DM us your phone number!"}, {"text": "@Gigacus That's not okay. Can you DM us the address of the Wendy’s you visited, and your phone number? We would love to make this right."}, {"text": "@sax_ladybug We’re sorry you had an experience like that. Can you DM us the address of your visit, along with your name and phone number or e-mail address so we can have someone reach out to address this?"}, {"text": "@HungryAsianRke We’d love to make this right. DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@EstefMuriedas This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@wooks66 This isn't the service we expect. Please DM us with the location and your contact info so we can look into this further."}, {"text": "@Rissa45110811 That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@ItsJBB3 We’d love to make this right. DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@AmBushfromMSFT Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "Join the Queen in the fight against the ancient darkness that is frozen beef: https://t.co/zZY37HJZQP https://t.co/QkqVwQpIIg"}, {"text": "@Seth18520145 It’s called a refrigerator, genius."}, {"text": "@TweetOfMoses_ Lol"}, {"text": "@literallyGod123 Haha ayyeee"}, {"text": "@21_henchman Your loyalty is appreciated"}, {"text": "@RayveReviewsYT Pro gamer move"}, {"text": "@DefNotDoom Sup"}, {"text": "@HugeHodor Yes"}, {"text": "@MPromethus Bless you"}, {"text": "@Kaliiph The only way"}, {"text": "@NDieckman Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Ed_Ucated_Ron We certainly don’t like to see that. Can you DM us your name and phone number or e-mail address so we can make it right?"}, {"text": "@graceword13 We’re sorry that happened. Can you DM us the address of your visit, along with your name and phone number or e-mail address so we can make it right?"}, {"text": "@Londynnn__ That’s not the quality we expect from our restaurants. Can you DM us the full address of your visit, and your name and phone number or e-mail address so we can have someone reach out to address this?"}, {"text": "@Nae_Starr We certainly don’t like to see that Janae. Please DM us the address of the location you visited and your phone number or e-mail address so we can address this?"}, {"text": "@Shianne20737250 Oh no! Please PM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Wytt40969642 That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@buck_hunter0508 This isn’t the quality we’d expect. Please DM us with info on this location, along with your number, and we'll make it up to you."}, {"text": "@Cbrronin That's not okay! Please PM us the restaurant location and your phone # so we can look into this. Thanks!"}, {"text": "@Brandon_1004 We're disappointed to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@Elegantramona1 We're disappointed to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@bbqpotatochips_ That doesn't look right! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@notianjett Hi there! That doesn't look right! Please DM us the restaurant location and your name and phone # so we can make this right. Thanks!"}, {"text": "@pewpewpewclick Hi there! That's not okay! Please DM us the restaurant location and your phone number so we can look into this. Thanks!"}, {"text": "@crlegalfunding Hi there! Please DM us the restaurant location and your contact information so we can make this right. Thanks!"}, {"text": "@dirickrealtor Hi there! That's not okay! Please DM us the restaurant location and your phone number so we can look into this. Thanks!"}, {"text": "@PeytonBeachler Hi there! We're disappointed to see this. DM us, we'd like to gather some additional details about your visit. Also, please provide us with your phone number so that we can follow up to make things right."}, {"text": "@iamShalakemia Hi there! That's not okay! Please DM us the restaurant location along with your name and phone number so we can look into this. Thanks!"}, {"text": "@yoloswag78901 Hi there! DM us your email address for your mobile account and we can look into this charge. Thanks."}, {"text": "@marimur1015 Hi there! Hi there-\nThis isn't the service we expect. Please DM us with the location and your phone number so we can look into this further."}, {"text": "@mnemosyneprae22 Hi there! We're disappointed to hear this. DM us, we'd like to gather some additional details about your visit. Also, please provide us with your name and phone number so that we can follow up to make things right."}, {"text": "@tepuryear Hi there! That's not okay! Please DM us the restaurant location and your phone number so we can look into this. Thanks!"}, {"text": "@ljs_in_love Hi there! We're disappointed to hear this. DM us, we'd like to gather some additional details about your visit. Also, please provide us with your phone number so that we can follow up to make things right."}, {"text": "@iamShalakemia Hi there! Thank you for the restaurant information. Please provide your contact information, so the management team can reach out."}, {"text": "@stevendbristow Hi there! Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@brookeangel98 Hi there! This isn't the service we expect. Please DM us with the location and your phone number so we can look into this further."}, {"text": "@TheDaniS89 Hi there! This isn’t the quality we expect. Please DM us with info on this location, along with your phone number, and we'll make it up to you."}, {"text": "@SmithCW54 Sorry to see this! Please DM us the restaurant location and your phone number so we can make this right."}, {"text": "@CANDYMUA_ Oh no! Please DM us with the exact location of your visit, along with your contact info so we can have someone reach out and make this right."}, {"text": "@dusk2D0n_ We certainly don’t like to hear that! Please DM us with the exact location of your visit, along with your number, and we'll make it up to you."}, {"text": "@scorpihoein We're sorry to hear that! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@CelluloidTerror Oh no! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}, {"text": "@YogiBarra11 That doesn't look right! Please DM us your phone # so we can make this right. Thanks!"}, {"text": "@samivano We're sorry to hear that! Please DM us your phone # so we can make this right. Thanks!"}, {"text": "@Charizo20 That's not okay! Please DM us the restaurant location and your phone # so we can make this right. Thanks!"}]